package top.yqingyu.common.utils;

import com.alibaba.fastjson2.JSONObject;

import java.io.Serial;
import java.time.LocalDate;
import java.util.Arrays;
import java.util.HashMap;
import java.util.List;

public class CCConstants {
    public static final LocalDate JZ_DAY = LocalDate.of(1949, 10, 1);
    public static final LocalDate JZ_YEAR = LocalDate.of(1984, 2, 2);
    public static final String[] TG = {"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"};
    public static final String[] DZ = {"子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"};
    public static final List<String> JIA_ZI = Arrays.asList("甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥");
    public static final String[] STAR_28 = {"轸水蚓宿星", "角木蛟宿星", "亢金龙宿星", "氐土貉宿星", "房日兔宿星", "心月狐宿星", "尾火虎宿星", "箕水豹宿星", "斗木獬宿星", "牛金牛宿星", "女土蝠宿星", "虚日鼠宿星", "危月燕宿星", "室火猪宿星", "璧水貐宿星", "奎木狼宿星", "娄金狗宿星", "胃土雉宿星", "昴日鸡宿星", "毕月乌宿星", "觜火猴宿星", "参水猿宿星", "井木犴宿星", "鬼金羊宿星", "柳土獐宿星", "星日马宿星", "张月鹿宿星", "翼火蛇宿星"};
    public static final String[] SHENGXIAO = {"鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"};
    public static final String[] TG_PZBJ = {"甲不开仓财物耗散", "乙不栽植千株不长", "丙不修灶必见灾殃", "丁不剃头头必生疮", "戊不受田田主不祥", "己不破券二比并亡", "庚不经络织机虚张", "辛不合酱主人不尝", "壬不汲水更难提防", "癸不词讼理弱敌强"};
    public static final String[] DZ_PZBJ = {"子不问卜自惹祸殃", "丑不冠带主不还乡", "寅不祭祀神鬼不尝", "卯不穿井水泉不香", "辰不哭泣必主重丧", "巳不远行财物伏藏", "午不苫盖屋主更张", "未不服药毒气入肠", "申不安床鬼祟入房", "酉不宴客醉坐颠狂", "戌不吃犬作怪上床", "亥不嫁娶不利新郎"};
    public static final String[] NUMBER = {"零", "一", "二", "三", "四", "五", "六", "七", "八", "九"};
    public static final String[] MONTH = {"正月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "冬月", "腊月"};
    public static final String[] SEASON = {"孟春", "仲春", "季春", "孟夏", "仲夏", "季夏", "孟秋", "仲秋", "季秋", "孟冬", "仲冬", "季冬"};
    public static final String[] DAY = {"初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十"};
    public static final String[] YUE_XIANG = {"朔月", "既朔月", "蛾眉新月", "蛾眉新月", "蛾眉月", "夕月", "上弦月", "上弦月", "九夜月", "宵月", "宵月", "宵月", "渐盈凸月", "小望月", "望月", "既望月", "立待月", "居待月", "寝待月", "更待月", "渐亏凸月", "下弦月", "下弦月", "有明月", "有明月", "蛾眉残月", "蛾眉残月", "残月", "晓月", "晦月"};
    public static final String[] JIE = {"小寒", "立春", "惊蛰", "清明", "立夏", "芒种", "小暑", "立秋", "白露", "寒露", "立冬", "大雪"};
    public static final String[] QI = {"大寒", "雨水", "春分", "谷雨", "小满", "夏至", "大暑", "处暑", "秋分", "霜降", "小雪", "冬至"};
    public static final String[] JIE_QI = {"小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"};
    public static final String[] ZHI_SHEN = {"青龙", "明堂", "天刑", "朱雀", "金匮", "天德", "白虎", "玉堂", "天牢", "玄武", "司命", "勾陈"};
    public static final String[] JIAN_CHU = {"建日", "除日", "满日", "平日", "定日", "执日", "破日", "危日", "成日", "收日", "开日", "闭日"};
    public static final String[] COMPASS = {"正北", "东北", "正东", "东南", "正南", "西南", "正西", "西北"};
    public static final HashMap<String, String> WuXing = new HashMap<>(60) {
        @java.io.Serial
        private static final long serialVersionUID = 362498820763181265L;

        {
            put("甲子", "海中金");
            put("甲午", "沙中金");
            put("丙寅", "炉中火");
            put("丙申", "山下火");
            put("戊辰", "大林木");
            put("戊戌", "平地木");
            put("庚午", "路旁土");
            put("庚子", "壁上土");
            put("壬申", "剑锋金");
            put("壬寅", "金箔金");
            put("甲戌", "山头火");
            put("甲辰", "覆灯火");
            put("丙子", "涧下水");
            put("丙午", "天河水");
            put("戊寅", "城头土");
            put("戊申", "大驿土");
            put("庚辰", "白蜡金");
            put("庚戌", "钗钏金");
            put("壬午", "杨柳木");
            put("壬子", "桑柘木");
            put("甲申", "泉中水");
            put("甲寅", "大溪水");
            put("丙戌", "屋上土");
            put("丙辰", "沙中土");
            put("戊子", "霹雳火");
            put("戊午", "天上火");
            put("庚寅", "松柏木");
            put("庚申", "石榴木");
            put("壬辰", "长流水");
            put("壬戌", "大海水");
            put("乙丑", "海中金");
            put("乙未", "沙中金");
            put("丁卯", "炉中火");
            put("丁酉", "山下火");
            put("己巳", "大林木");
            put("己亥", "平地木");
            put("辛未", "路旁土");
            put("辛丑", "壁上土");
            put("癸酉", "剑锋金");
            put("癸卯", "金箔金");
            put("乙亥", "山头火");
            put("乙巳", "覆灯火");
            put("丁丑", "涧下水");
            put("丁未", "天河水");
            put("己卯", "城头土");
            put("己酉", "大驿土");
            put("辛巳", "白蜡金");
            put("辛亥", "钗钏金");
            put("癸未", "杨柳木");
            put("癸丑", "桑柘木");
            put("乙酉", "泉中水");
            put("乙卯", "大溪水");
            put("丁亥", "屋上土");
            put("丁巳", "沙中土");
            put("己丑", "霹雳火");
            put("己未", "天上火");
            put("辛卯", "松柏木");
            put("辛酉", "石榴木");
            put("癸巳", "长流水");
            put("癸亥", "大海水'");
        }
    };

    /**
     * 从左往右
     * [1位]&0x10000 闰月是30天还是29天 0x1是30天
     * [2~5位]& >>0x8000 代表哪个月是(是1的)30天的  转成十二位二进制 从左往右 位为1代表该月是30天
     * [5位]&1111 = 润哪个月
     */
    public static final Integer[] LUNAR_INFO = {
            //  0       1        2        3        4        5        6        7        8        9
            0x04bd8, 0x04ae0, 0x0a570, 0x054d5, 0x0d260, 0x0d950, 0x16554, 0x056a0, 0x09ad0, 0x055d2, //1909
            0x04ae0, 0x0a5b6, 0x0a4d0, 0x0d250, 0x1d255, 0x0b540, 0x0d6a0, 0x0ada2, 0x095b0, 0x14977, //1919
            0x04970, 0x0a4b0, 0x0b4b5, 0x06a50, 0x06d40, 0x1ab54, 0x02b60, 0x09570, 0x052f2, 0x04970, //1929
            0x06566, 0x0d4a0, 0x0ea50, 0x06e95, 0x05ad0, 0x02b60, 0x186e3, 0x092e0, 0x1c8d7, 0x0c950, //1939s
            0x0d4a0, 0x1d8a6, 0x0b550, 0x056a0, 0x1a5b4, 0x025d0, 0x092d0, 0x0d2b2, 0x0a950, 0x0b557, //1949
            0x06ca0, 0x0b550, 0x15355, 0x04da0, 0x0a5b0, 0x14573, 0x052b0, 0x0a9a8, 0x0e950, 0x06aa0, //1959
            0x0aea6, 0x0ab50, 0x04b60, 0x0aae4, 0x0a570, 0x05260, 0x0f263, 0x0d950, 0x05b57, 0x056a0, //1967
            0x096d0, 0x04dd5, 0x04ad0, 0x0a4d0, 0x0d4d4, 0x0d250, 0x0d558, 0x0b540, 0x0b6a0, 0x195a6, //1979
            0x095b0, 0x049b0, 0x0a974, 0x0a4b0, 0x0b27a, 0x06a50, 0x06d40, 0x0af46, 0x0ab60, 0x09570, //1989
            0x04af5, 0x04970, 0x064b0, 0x074a3, 0x0ea50, 0x06b58, 0x055c0, 0x0ab60, 0x096d5, 0x092e0, //1999
            0x0c960, 0x0d954, 0x0d4a0, 0x0da50, 0x07552, 0x056a0, 0x0abb7, 0x025d0, 0x092d0, 0x0cab5, //2009
            0x0a950, 0x0b4a0, 0x0baa4, 0x0ad50, 0x055d9, 0x04ba0, 0x0a5b0, 0x15176, 0x052b0, 0x0a930, //2019
            0x07954, 0x06aa0, 0x0ad50, 0x05b52, 0x04b60, 0x0a6e6, 0x0a4e0, 0x0d260, 0x0ea65, 0x0d530, //2029
            0x05aa0, 0x076a3, 0x096d0, 0x04bd7, 0x04ad0, 0x0a4d0, 0x1d0b6, 0x0d250, 0x0d520, 0x0dd45, //2039
            0x0b5a0, 0x056d0, 0x055b2, 0x049b0, 0x0a577, 0x0a4b0, 0x0aa50, 0x1b255, 0x06d20, 0x0ada0, //2049
            0x14b63, 0x09370, 0x049f8, 0x04970, 0x064b0, 0x168a6, 0x0ea50, 0x06aa0, 0x1a6c4, 0x0aae0, //2059
            0x092e0, 0x0d2e3, 0x0c960, 0x0d557, 0x0d4a0, 0x0da40, 0x05d55, 0x056a0, 0x0a6c0, 0x055d4, //2069
            0x052d0, 0x0a9b8, 0x0a950, 0x0b4a0, 0x0b6a6, 0x0ad50, 0x055a0, 0x0aba4, 0x0a5a0, 0x052b0, //2079
            0x0b273, 0x06930, 0x07337, 0x06aa0, 0x0ad50, 0x14b55, 0x04b60, 0x0a570, 0x054e4, 0x0d160, //2089
            0x0e968, 0x0d520, 0x0daa0, 0x16aa6, 0x056d0, 0x04ae0, 0x0a9d4, 0x0a2d0, 0x0d150, 0x0f252, //2099
            0x0d520
            /*   只有到2100 年的大小月排布表。。 后续待完成  LUNAR_INFO  */};

    // 月支 + 日干支

    //吉神，凶神
    public static final JSONObject JS_XS_DATA = new JSONObject() {
        @Serial
        private static final long serialVersionUID = 1L;

        {
            put("寅甲子", "{\"JSYQ\":\"天恩 母仓 时阳 生气 益后 青龙\",\"XSYJ\":\"灾煞 天火 四忌 八龙 复日\"}");
            put("寅乙丑", "{\"JSYQ\":\"天恩 续世 明堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 土符 归忌 血忌\"}");
            put("寅丙寅", "{\"JSYQ\":\"月德 天恩 月恩 四相 王日 天仓 不将 要安 五合 鸣吠对\",\"XSYJ\":\"月建 小时 土府 往亡 天刑\"}");
            put("寅丁卯", "{\"JSYQ\":\"天德 天恩 四相 官日 吉期 不将 玉宇 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 朱雀\"}");
            put("寅戊辰", "{\"JSYQ\":\"天恩 守日 天巫 福德 六仪 金堂 金匮\",\"XSYJ\":\"厌对 招摇 九空 九坎 九焦\"}");
            put("寅己巳", "{\"JSYQ\":\"相日 宝光\",\"XSYJ\":\"天罡 死神 月刑 月害 游祸 五虚 重日\"}");
            put("寅庚午", "{\"JSYQ\":\"时德 民日 三合 临日 天马 时阴 鸣吠\",\"XSYJ\":\"死气 地囊 白虎\"}");
            put("寅辛未", "{\"JSYQ\":\"月德合 敬安 玉堂 普护 解神\",\"XSYJ\":\"小耗\"}");
            put("寅壬申", "{\"JSYQ\":\"天德合 月空 驿马 天后 普护 解神 除神 鸣吠\",\"XSYJ\":\"月破 大耗 五离 天牢\"}");
            put("寅癸酉", "{\"JSYQ\":\"阴德 福生 除神 鸣吠\",\"XSYJ\":\"天吏 致死 五虚 五离 元武\"}");
            put("寅甲戌", "{\"JSYQ\":\"阳德 三合 天喜 天医 司命\",\"XSYJ\":\"月厌 地火 四击 大煞 复日 大会\"}");
            put("寅乙亥", "{\"JSYQ\":\"母仓 天愿 六合 五富 圣心\",\"XSYJ\":\"河魁 劫煞 四穷 八龙 重日 勾陈\"}");
            put("寅丙子", "{\"JSYQ\":\"月德 母仓 月恩 四相 时阳 生气 不将 益后 青龙 鸣吠对\",\"XSYJ\":\"灾煞 天火 触水龙\"}");
            put("寅丁丑", "{\"JSYQ\":\"天德 四相 不将 续世 明堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 八风 土符 归忌 血忌\"}");
            put("寅戊寅", "{\"JSYQ\":\"天赦 王日 天仓 要安 五合\",\"XSYJ\":\"月建 小时 土府 往亡 天刑\"}");
            put("寅己卯", "{\"JSYQ\":\"天恩 官日 吉期 不将 玉宇 五合\",\"XSYJ\":\"大时 大败 咸池 朱雀\"}");
            put("寅庚辰", "{\"JSYQ\":\"天恩 守日 天巫 福德 六仪 金堂 金匮\",\"XSYJ\":\"厌对 招摇 九空 九坎 九焦\"}");
            put("寅辛巳", "{\"JSYQ\":\"月德合 天恩 相日 宝光\",\"XSYJ\":\"天罡 死神 月刑 月害 游祸 五虚 重日\"}");
            put("寅壬午", "{\"JSYQ\":\"天德合 月空 天恩 时德 民日 三合 临日 天马 时阴 鸣吠\",\"XSYJ\":\"死气 白虎\"}");
            put("寅癸未", "{\"JSYQ\":\"天恩 敬安 玉堂\",\"XSYJ\":\"小耗 触水龙\"}");
            put("寅甲申", "{\"JSYQ\":\"驿马 天后 普护 解神 除神 鸣吠\",\"XSYJ\":\"月破 大耗 复日 五离 天牢\"}");
            put("寅乙酉", "{\"JSYQ\":\"天恩 阴德 福生 除神 鸣吠\",\"XSYJ\":\"天吏 致死 五虚 五离 元武\"}");
            put("寅丙戌", "{\"JSYQ\":\"月德 天恩 四相 阳德 三合 天喜 天医 司命\",\"XSYJ\":\"月厌 地火 四击 大煞\"}");
            put("寅丁亥", "{\"JSYQ\":\"天德 母仓 四相 六合 五富 不将 圣心\",\"XSYJ\":\"河魁 劫煞 重日 勾陈\"}");
            put("寅戊子", "{\"JSYQ\":\"母仓 时阳 生气 益后 青龙\",\"XSYJ\":\"灾煞 天火\"}");
            put("寅己丑", "{\"JSYQ\":\"不将 续世 明堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 土符 归忌 血忌\"}");
            put("寅庚寅", "{\"JSYQ\":\"王日 天仓 不将 要安 五合 鸣吠对\",\"XSYJ\":\"月建 小时 土府 往亡 天刑\"}");
            put("寅辛卯", "{\"JSYQ\":\"月德合 官日 吉期 不将 玉宇 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池\"}");
            put("寅壬辰", "{\"JSYQ\":\"天德合 月空 守日 天巫 福德 六仪 金堂 金匮\",\"XSYJ\":\"厌对 招摇 九空 九坎 九焦\"}");
            put("寅癸巳", "{\"JSYQ\":\"相日 宝光\",\"XSYJ\":\"天罡 死神 月刑 月害 游祸 五虚 重日\"}");
            put("寅甲午", "{\"JSYQ\":\"时德 民日 三合 临日 天马 时阴 鸣吠\",\"XSYJ\":\"死气 复日 白虎\"}");
            put("寅乙未", "{\"JSYQ\":\"敬安 玉堂\",\"XSYJ\":\"小耗 五墓\"}");
            put("寅丙申", "{\"JSYQ\":\"月德 月恩 四相 驿马 天后 普护 解神 除神 鸣吠\",\"XSYJ\":\"月破 大耗 五离\"}");
            put("寅丁酉", "{\"JSYQ\":\"天德 四相 阴德 福生 除神 鸣吠\",\"XSYJ\":\"天吏 致死 五虚 五离 元武\"}");
            put("寅戊戌", "{\"JSYQ\":\"阳德 三合 天喜 天医 司命\",\"XSYJ\":\"月厌 地火 四击 大煞\"}");
            put("寅己亥", "{\"JSYQ\":\"母仓 六合 五富 不将 圣心\",\"XSYJ\":\"河魁 劫煞 重日 勾陈\"}");
            put("寅庚子", "{\"JSYQ\":\"母仓 时阳 生气 不将 益后 青龙 鸣吠对\",\"XSYJ\":\"灾煞 天火 地囊\"}");
            put("寅辛丑", "{\"JSYQ\":\"月德合 不将 续世 明堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 土符 归忌 血忌\"}");
            put("寅壬寅", "{\"JSYQ\":\"天德合 月空 王日 天仓 要安 五合 鸣吠对\",\"XSYJ\":\"月建 小时 土府 往亡 天刑\"}");
            put("寅癸卯", "{\"JSYQ\":\"官日 吉期 玉宇 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 朱雀\"}");
            put("寅甲辰", "{\"JSYQ\":\"守日 天巫 福德 六仪 金堂 金匮\",\"XSYJ\":\"厌对 招摇 九空 九坎 九焦 复日\"}");
            put("寅乙巳", "{\"JSYQ\":\"相日 宝光\",\"XSYJ\":\"天罡 死神 月刑 月害 游祸 五虚 重日\"}");
            put("寅丙午", "{\"JSYQ\":\"月德 月恩 四相 时德 民日 三合 临日 天马 时阴 鸣吠\",\"XSYJ\":\"死气 白虎\"}");
            put("寅丁未", "{\"JSYQ\":\"天德 四相 敬安 玉堂\",\"XSYJ\":\"小耗 八专\"}");
            put("寅戊申", "{\"JSYQ\":\"驿马 天后 普护 解神 除神\",\"XSYJ\":\"月破 大耗 五离 天牢\"}");
            put("寅己酉", "{\"JSYQ\":\"天恩 阴德 福生 除神 鸣吠\",\"XSYJ\":\"天吏 致死 五虚 五离 元武\"}");
            put("寅庚戌", "{\"JSYQ\":\"天恩 阳德 三合 天喜 天医 司命\",\"XSYJ\":\"月厌 地火 四击 大煞 阴错\"}");
            put("寅辛亥", "{\"JSYQ\":\"月德合 天恩 母仓 六合 五富 不将 圣心\",\"XSYJ\":\"河魁 劫煞 重日 勾陈\"}");
            put("寅壬子", "{\"JSYQ\":\"天德合 月空 天恩 母仓 时阳 生气 益后 青龙 鸣吠对\",\"XSYJ\":\"灾煞 天火 四耗\"}");
            put("寅癸丑", "{\"JSYQ\":\"天恩 续世 明堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 土符 归忌 血忌 八专 触水龙\"}");
            put("寅甲寅", "{\"JSYQ\":\"王日 天仓 要安 五合 鸣吠对\",\"XSYJ\":\"月建 小时 土府 往亡 复日 八专 天刑 阳错\"}");
            put("寅乙卯", "{\"JSYQ\":\"官日 吉期 玉宇 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 朱雀\"}");
            put("寅丙辰", "{\"JSYQ\":\"月德 月恩 四相 守日 天巫 福德 六仪 金堂 金匮\",\"XSYJ\":\"厌对 招摇 九空 九坎 九焦\"}");
            put("寅丁巳", "{\"JSYQ\":\"天德 四相 相日 宝光\",\"XSYJ\":\"天罡 死神 月刑 月害 游祸 五虚 八风 重日\"}");
            put("寅戊午", "{\"JSYQ\":\"时德 民日 三合 临日 天马 时阴\",\"XSYJ\":\"死气 白虎\"}");
            put("寅己未", "{\"JSYQ\":\"敬安 玉堂\",\"XSYJ\":\"小耗 八专\"}");
            put("寅庚申", "{\"JSYQ\":\"驿马 天后 普护 解神 除神 鸣吠\",\"XSYJ\":\"月破 大耗 四废 五离 八专 天牢\"}");
            put("寅辛酉", "{\"JSYQ\":\"月德合 阴德 福生 除神 鸣吠\",\"XSYJ\":\"天吏 致死 四废 五虚 五离 元武 三阴\"}");
            put("寅壬戌", "{\"JSYQ\":\"天德合 月空 阳德 三合 天喜 天医 司命\",\"XSYJ\":\"月厌 地火 四击 大煞\"}");
            put("寅癸亥", "{\"JSYQ\":\"母仓 六合 五富 圣心\",\"XSYJ\":\"河魁 劫煞 重日 勾陈\"}");
            put("卯甲子", "{\"JSYQ\":\"月德 天恩 母仓 阳德 司命\",\"XSYJ\":\"天罡 月刑 大时 大败 咸池 天贼 四忌 八龙\"}");
            put("卯乙丑", "{\"JSYQ\":\"天恩 时阳 生气 天仓 不将 敬安\",\"XSYJ\":\"五虚 九空 九坎 九焦 复日 勾陈\"}");
            put("卯丙寅", "{\"JSYQ\":\"天恩 四相 王日 五富 不将 普护 五合 青龙 鸣吠对\",\"XSYJ\":\"游祸 血支 归忌\"}");
            put("卯丁卯", "{\"JSYQ\":\"天恩 月恩 四相 官日 六仪 福生 五合 明堂 鸣吠对\",\"XSYJ\":\"月建 小时 土府 厌对 招摇\"}");
            put("卯戊辰", "{\"JSYQ\":\"天恩 守日 吉期\",\"XSYJ\":\"月害 天刑\"}");
            put("卯己巳", "{\"JSYQ\":\"月德合 相日 驿马 天后 天巫 福德 圣心\",\"XSYJ\":\"五虚 土符 大煞 往亡 重日 朱雀\"}");
            put("卯庚午", "{\"JSYQ\":\"月空 时德 民日 益后 金匮 鸣吠对\",\"XSYJ\":\"河魁 死神 天吏 致死\"}");
            put("卯辛未", "{\"JSYQ\":\"阴德 三合 时阴 续世 宝光\",\"XSYJ\":\"死气 血忌\"}");
            put("卯壬申", "{\"JSYQ\":\"天马 要安 解神 鸣吠\",\"XSYJ\":\"劫煞 小耗 五离 白虎\"}");
            put("卯癸酉", "{\"JSYQ\":\"玉宇 除神 玉堂 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 五离\"}");
            put("卯甲戌", "{\"JSYQ\":\"月德 天愿 六合 金堂\",\"XSYJ\":\"月煞 月虚 四击 天牢\"}");
            put("卯乙亥", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医 不将\",\"XSYJ\":\"四穷 八龙 复日 重日 元武\"}");
            put("卯丙子", "{\"JSYQ\":\"母仓 四相 阳德 不将 司命 鸣吠对\",\"XSYJ\":\"天罡 月刑 大时 大败 咸池 天贼 触水龙\"}");
            put("卯丁丑", "{\"JSYQ\":\"月恩 四相 时阳 生气 不将 敬安\",\"XSYJ\":\"五虚 八风 九空 九坎 九焦 勾陈\"}");
            put("卯戊寅", "{\"JSYQ\":\"天赦 王日 五富 普护 五合 青龙\",\"XSYJ\":\"游祸 血支 归忌\"}");
            put("卯己卯", "{\"JSYQ\":\"月德合 天恩 官日 六仪 福生 五合 明堂\",\"XSYJ\":\"月建 小时 土府 厌对 招摇 小会\"}");
            put("卯庚辰", "{\"JSYQ\":\"月空 天恩 守日 吉期\",\"XSYJ\":\"月害 天刑\"}");
            put("卯辛巳", "{\"JSYQ\":\"天恩 相日 驿马 天后 天巫 福德 圣心\",\"XSYJ\":\"五虚 土符 大煞 往亡 重日 朱雀\"}");
            put("卯壬午", "{\"JSYQ\":\"天恩 时德 民日 益后 金匮 鸣吠\",\"XSYJ\":\"河魁 死神 天吏 致死\"}");
            put("卯癸未", "{\"JSYQ\":\"天恩 阴德 三合 时阴 续世 宝光\",\"XSYJ\":\"死气 血忌 触水龙\"}");
            put("卯甲申", "{\"JSYQ\":\"月德 天马 要安 解神 除神 鸣吠\",\"XSYJ\":\"劫煞 小耗 五离 白虎\"}");
            put("卯乙酉", "{\"JSYQ\":\"玉宇 除神 玉堂 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 复日 五离 白虎\"}");
            put("卯丙戌", "{\"JSYQ\":\"四相 六合 不将 金堂\",\"XSYJ\":\"月煞 月虚 四击 天牢\"}");
            put("卯丁亥", "{\"JSYQ\":\"母仓 月恩 四相 三合 临日 天喜 天医 不将\",\"XSYJ\":\"重日 元武\"}");
            put("卯戊子", "{\"JSYQ\":\"母仓 阳德 司命\",\"XSYJ\":\"天罡 月刑 大时 大败 咸池 天贼\"}");
            put("卯己丑", "{\"JSYQ\":\"月德合 时阳 生气 天仓 不将 敬安\",\"XSYJ\":\"五虚 九空 九坎 九焦 勾陈\"}");
            put("卯庚寅", "{\"JSYQ\":\"月空 王日 五富 不将 普护 五合 青龙 鸣吠对\",\"XSYJ\":\"游祸 血支 归忌\"}");
            put("卯辛卯", "{\"JSYQ\":\"官日 六仪 福生 五合 明堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 厌对 招摇\"}");
            put("卯壬辰", "{\"JSYQ\":\"守日 吉期\",\"XSYJ\":\"月害 天刑\"}");
            put("卯癸巳", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 圣心\",\"XSYJ\":\"五虚 土符 大煞 往亡 重日 朱雀\"}");
            put("卯甲午", "{\"JSYQ\":\"月德 时德 民日 益后 金匮 鸣吠\",\"XSYJ\":\"河魁 死神 天吏 致死\"}");
            put("卯乙未", "{\"JSYQ\":\"阴德 三合 时阴 续世 宝光\",\"XSYJ\":\"死气 五墓 地囊 血忌 复日\"}");
            put("卯丙申", "{\"JSYQ\":\"四相 天马 要安 解神 除神 鸣吠\",\"XSYJ\":\"劫煞 小耗 五离 白虎\"}");
            put("卯丁酉", "{\"JSYQ\":\"月恩 四相 玉宇 除神 玉堂 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 五离\"}");
            put("卯戊戌", "{\"JSYQ\":\"六合 金堂\",\"XSYJ\":\"月煞 月虚 四击 天牢\"}");
            put("卯己亥", "{\"JSYQ\":\"月德合 母仓 三合 临日 天喜 天医 不将\",\"XSYJ\":\"重日 元武\"}");
            put("卯庚子", "{\"JSYQ\":\"月空 母仓 阳德 不将 司命 鸣吠对\",\"XSYJ\":\"天罡 月刑 大时 大败 咸池 天贼\"}");
            put("卯辛丑", "{\"JSYQ\":\"时阳 生气 天仓 敬安\",\"XSYJ\":\"五虚 九空 九坎 九焦 勾陈\"}");
            put("卯壬寅", "{\"JSYQ\":\"王日 五富 普护 五合 青龙 鸣吠对\",\"XSYJ\":\"游祸 血支 归忌\"}");
            put("卯癸卯", "{\"JSYQ\":\"官日 六仪 福生 五合 明堂 鸣吠对\",\"XSYJ\":\"月建 小时 土府 厌对 招摇\"}");
            put("卯甲辰", "{\"JSYQ\":\"月德 守日 吉期\",\"XSYJ\":\"月害 天刑\"}");
            put("卯乙巳", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 圣心\",\"XSYJ\":\"五虚 土符 大煞 往亡 复日 重日 朱雀\"}");
            put("卯丙午", "{\"JSYQ\":\"四相 时德 民日 益后 金匮 鸣吠\",\"XSYJ\":\"河魁 死神 天吏 致死\"}");
            put("卯丁未", "{\"JSYQ\":\"月恩 四相 阴德 三合 时阴 续世 宝光\",\"XSYJ\":\"死气 血忌 八专\"}");
            put("卯戊申", "{\"JSYQ\":\"天马 要安 解神 除神\",\"XSYJ\":\"劫煞 小耗 五离 白虎\"}");
            put("卯己酉", "{\"JSYQ\":\"月德合 天恩 玉宇 除神 玉堂 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 五离 阴道冲阳\"}");
            put("卯庚戌", "{\"JSYQ\":\"月空 天恩 六合 不将 金堂\",\"XSYJ\":\"月煞 月虚 四击 天牢\"}");
            put("卯辛亥", "{\"JSYQ\":\"天恩 母仓 三合 临日 天喜 天医\",\"XSYJ\":\"重日 元武\"}");
            put("卯壬子", "{\"JSYQ\":\"天恩 母仓 阳德 司命 鸣吠对\",\"XSYJ\":\"天罡 月刑 大时 大败 咸池 天贼 四耗\"}");
            put("卯癸丑", "{\"JSYQ\":\"天恩 时阳 生气 天仓 敬安\",\"XSYJ\":\"五虚 九空 九坎 九焦 地囊 八专 触水龙 勾陈\"}");
            put("卯甲寅", "{\"JSYQ\":\"月德 王日 五富 普护 五合 青龙 鸣吠对\",\"XSYJ\":\"游祸 血支 归忌\"}");
            put("卯乙卯", "{\"JSYQ\":\"官日 六仪 福生 五合 明堂 鸣吠对\",\"XSYJ\":\"月建 小时 土府 厌对 招摇 复日 阳错\"}");
            put("卯丙辰", "{\"JSYQ\":\"四相 守日 吉期\",\"XSYJ\":\"月害 天刑\"}");
            put("卯丁巳", "{\"JSYQ\":\"月恩 四相 相日 驿马 天后 天巫 福德 圣心\",\"XSYJ\":\"五虚 八风 土符 大煞 往亡 重日 朱雀\"}");
            put("卯戊午", "{\"JSYQ\":\"时德 民日 益后 金匮\",\"XSYJ\":\"河魁 死神 天吏 致死\"}");
            put("卯己未", "{\"JSYQ\":\"月德合 阴德 三合 时阴 续世 宝光\",\"XSYJ\":\"死气 血忌 八专\"}");
            put("卯庚申", "{\"JSYQ\":\"月空 天马 要安 解神 除神 鸣吠\",\"XSYJ\":\"劫煞 小耗 四废 五离 八专 白虎\"}");
            put("卯辛酉", "{\"JSYQ\":\"玉宇 除神 玉堂 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 四废 五虚 五离 阴错\"}");
            put("卯壬戌", "{\"JSYQ\":\"六合 金堂\",\"XSYJ\":\"月煞 月虚 四击 天牢\"}");
            put("卯癸亥", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医\",\"XSYJ\":\"重日 元武\"}");
            put("辰甲子", "{\"JSYQ\":\"天恩 母仓 三合 天喜 天医 天仓 不将 圣心\",\"XSYJ\":\"四忌 八龙 地囊 归忌 天牢\"}");
            put("辰乙丑", "{\"JSYQ\":\"天恩 不将 益后\",\"XSYJ\":\"河魁 五虚 元武\"}");
            put("辰丙寅", "{\"JSYQ\":\"月空 天恩 四相 阳德 王日 驿马 天后 时阳 生气 六仪 续世 五合 司命 鸣吠对\",\"XSYJ\":\"厌对 招摇 血忌\"}");
            put("辰丁卯", "{\"JSYQ\":\"天德合 月德合 天恩 四相 官日 要安 五合 鸣吠对\",\"XSYJ\":\"月害 天吏 致死 血支 勾陈\"}");
            put("辰戊辰", "{\"JSYQ\":\"天恩 守日 玉宇 青龙\",\"XSYJ\":\"月建 小时 土府 月刑 五墓 复日 小会 单阴\"}");
            put("辰己巳", "{\"JSYQ\":\"阴德 相日 吉期 五富 金堂 明堂\",\"XSYJ\":\"劫煞 五虚 重日\"}");
            put("辰庚午", "{\"JSYQ\":\"月恩 时德 民日 天巫 福德 鸣吠\",\"XSYJ\":\"灾煞 天火 大煞 天刑\"}");
            put("辰辛未", "{\"JSYQ\":\"[无神煞]\",\"XSYJ\":\"天罡 死神 月煞 朱雀\"}");
            put("辰壬申", "{\"JSYQ\":\"天德 月德 三合 临日 时阴 敬安 除神 金匮 鸣吠\",\"XSYJ\":\"月厌 地火 死气 往亡 五离 孤辰\"}");
            put("辰癸酉", "{\"JSYQ\":\"六合 普护 除神 宝光 鸣吠\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 土符 五离\"}");
            put("辰甲戌", "{\"JSYQ\":\"天马 不将 福生 解神\",\"XSYJ\":\"月破 大耗 四击 九空 九坎 九焦 白虎\"}");
            put("辰乙亥", "{\"JSYQ\":\"母仓 不将 玉宇\",\"XSYJ\":\"游祸 天贼 四穷 八龙 重日\"}");
            put("辰丙子", "{\"JSYQ\":\"月空 母仓 四相 三合 天喜 天医 天仓 不将 圣心 鸣吠对\",\"XSYJ\":\"归忌 触水龙 天牢\"}");
            put("辰丁丑", "{\"JSYQ\":\"天德合 月德合 四相 不将 益后\",\"XSYJ\":\"河魁 五虚 八风 元武\"}");
            put("辰戊寅", "{\"JSYQ\":\"天赦 阳德 王日 驿马 天后 时阳 生气 六仪 续世 五合 司命\",\"XSYJ\":\"厌对 招摇 血忌 复日\"}");
            put("辰己卯", "{\"JSYQ\":\"天恩 官日 要安 五合\",\"XSYJ\":\"月害 天吏 致死 血支 勾陈\"}");
            put("辰庚辰", "{\"JSYQ\":\"天恩 月恩 守日 玉宇 青龙\",\"XSYJ\":\"月建 小时 土府 月刑 阴位\"}");
            put("辰辛巳", "{\"JSYQ\":\"天恩 阴德 相日 吉期 五富 金堂 明堂\",\"XSYJ\":\"劫煞 五虚 重日\"}");
            put("辰壬午", "{\"JSYQ\":\"天德 月德 天恩 时德 民日 天巫 福德 鸣吠\",\"XSYJ\":\"灾煞 天火 地囊 大煞 天刑\"}");
            put("辰癸未", "{\"JSYQ\":\"天恩\",\"XSYJ\":\"天罡 死神 月煞 月虚 触水龙 朱雀\"}");
            put("辰甲申", "{\"JSYQ\":\"三合 临日 时阴 敬安 除神 金匮 鸣吠\",\"XSYJ\":\"月厌 地火 死气 往亡 五离 行狠\"}");
            put("辰乙酉", "{\"JSYQ\":\"天愿 六合 不将 普护 除神 宝光 鸣吠\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 土符 五离\"}");
            put("辰丙戌", "{\"JSYQ\":\"月空 四相 天马 不将 福生 解神\",\"XSYJ\":\"月破 大耗 四击 九空 九坎 九焦 白虎\"}");
            put("辰丁亥", "{\"JSYQ\":\"天德合 月德合 母仓 四相 不将 玉堂\",\"XSYJ\":\"游祸 天贼 重日\"}");
            put("辰戊子", "{\"JSYQ\":\"母仓 三合 天喜 天医 天仓 圣心\",\"XSYJ\":\"归忌 复日 天牢\"}");
            put("辰己丑", "{\"JSYQ\":\"不将 益后\",\"XSYJ\":\"河魁 五虚 元武\"}");
            put("辰庚寅", "{\"JSYQ\":\"月恩 阳德 王日 驿马 天后 时阳 生气 六仪 续世 五合 司命 鸣吠对\",\"XSYJ\":\"厌对 招摇 血忌\"}");
            put("辰辛卯", "{\"JSYQ\":\"官日 要安 五合 鸣吠对\",\"XSYJ\":\"月害 天吏 致死 血支 勾陈\"}");
            put("辰壬辰", "{\"JSYQ\":\"天德 月德 守日 玉宇 青龙\",\"XSYJ\":\"月建 小时 土府 月刑\"}");
            put("辰癸巳", "{\"JSYQ\":\"阴德 相日 吉期 五富 金堂 明堂\",\"XSYJ\":\"劫煞 五虚 重日\"}");
            put("辰甲午", "{\"JSYQ\":\"时德 民日 天巫 福德 鸣吠\",\"XSYJ\":\"灾煞 天火 大煞 天刑\"}");
            put("辰乙未", "{\"JSYQ\":\"[无神煞]\",\"XSYJ\":\"天罡 死神 月煞 月虚 朱雀\"}");
            put("辰丙申", "{\"JSYQ\":\"月空 四相 三合 临日 时阴 敬安 除神 金匮 鸣吠\",\"XSYJ\":\"月厌 地火 死气 往亡 五离 了戾\"}");
            put("辰丁酉", "{\"JSYQ\":\"天德合 月德合 四相 六合 不将 普护 除神 宝光 鸣吠\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 土符 五离\"}");
            put("辰戊戌", "{\"JSYQ\":\"天马 福生 解神\",\"XSYJ\":\"月破 大耗 四击 九空 九坎 九焦 复日 白虎\"}");
            put("辰己亥", "{\"JSYQ\":\"母仓 不将 玉堂\",\"XSYJ\":\"游祸 天贼 重日\"}");
            put("辰庚子", "{\"JSYQ\":\"母仓 月恩 三合 天喜 天医 天仓 圣心 鸣吠对\",\"XSYJ\":\"归忌 天牢\"}");
            put("辰辛丑", "{\"JSYQ\":\"益后\",\"XSYJ\":\"河魁 五虚 元武\"}");
            put("辰壬寅", "{\"JSYQ\":\"阴德 月德 阳德 王日 驿马 天后 时阳 生气 六仪 续世 五合 司命 鸣吠对\",\"XSYJ\":\"厌对 招摇 血忌\"}");
            put("辰癸卯", "{\"JSYQ\":\"官日 要安 五合 鸣吠对\",\"XSYJ\":\"月害 天吏 致死 血支 勾陈\"}");
            put("辰甲辰", "{\"JSYQ\":\"守日 玉宇 青龙\",\"XSYJ\":\"月建 小时 土府 月刑 阳错\"}");
            put("辰乙巳", "{\"JSYQ\":\"阴德 相日 吉期 五富 金堂 明堂\",\"XSYJ\":\"劫煞 五虚 重日\"}");
            put("辰丙午", "{\"JSYQ\":\"月空 四相 时德 民日 天巫 福德 鸣吠\",\"XSYJ\":\"灾煞 天火 大煞 天刑\"}");
            put("辰丁未", "{\"JSYQ\":\"天德合 月德合 四相\",\"XSYJ\":\"天罡 死神 月煞 月虚 八专 朱雀\"}");
            put("辰戊申", "{\"JSYQ\":\"三合 临日 时阴 敬安 除神 金匮\",\"XSYJ\":\"月厌 地火 死气 往亡 复日 五离 孤辰\"}");
            put("辰己酉", "{\"JSYQ\":\"天恩 六合 不将 普护 除神 宝光 鸣吠\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 土符 五离\"}");
            put("辰庚戌", "{\"JSYQ\":\"天恩 月恩 天马 福生 解神\",\"XSYJ\":\"月破 大耗 四击 九空 九坎 九焦 白虎\"}");
            put("辰辛亥", "{\"JSYQ\":\"天恩 母仓 玉堂\",\"XSYJ\":\"游祸 天贼 重日\"}");
            put("辰壬子", "{\"JSYQ\":\"天德 月德 天恩 母仓 三合 天喜 天医 天仓 圣心 鸣吠对\",\"XSYJ\":\"四耗 归忌 天牢\"}");
            put("辰癸丑", "{\"JSYQ\":\"天恩 益后\",\"XSYJ\":\"河魁 五虚 八专 触水龙 元武\"}");
            put("辰甲寅", "{\"JSYQ\":\"阳德 王日 驿马 天后 时阳 生气 六仪 续世 五合 司命 鸣吠对\",\"XSYJ\":\"厌对 招摇 血忌 八专\"}");
            put("辰乙卯", "{\"JSYQ\":\"官日 要安 五合 鸣吠对\",\"XSYJ\":\"月害 天吏 致死 血支 勾陈\"}");
            put("辰丙辰", "{\"JSYQ\":\"月空 四相 守日 玉宇 青龙\",\"XSYJ\":\"月建 小时 土府 月刑\"}");
            put("辰丁巳", "{\"JSYQ\":\"天德合 月德合 四相 阴德 相日 吉期 五富 金堂 明堂\",\"XSYJ\":\"劫煞 五虚 八风 重日\"}");
            put("辰戊午", "{\"JSYQ\":\"时德 民日 天巫 福德\",\"XSYJ\":\"灾煞 天火 大煞 复日 天刑\"}");
            put("辰己未", "{\"JSYQ\":\"[无神煞]\",\"XSYJ\":\"天罡 死神 月煞 月虚 八专 朱雀\"}");
            put("辰庚申", "{\"JSYQ\":\"月恩 三合 临日 时阴 敬安 除神 金匮 鸣吠\",\"XSYJ\":\"月厌 地火 死气 四废 往亡 五离 八专 孤辰 阴错\"}");
            put("辰辛酉", "{\"JSYQ\":\"六合 普护 除神 宝光 鸣吠\",\"XSYJ\":\"大时 大败 咸池 小耗 四废 五虚 土符 五离\"}");
            put("辰壬戌", "{\"JSYQ\":\"天德 月德 天马 福生 解神\",\"XSYJ\":\"月破 大耗 四击 九空 九坎 九焦 白虎\"}");
            put("辰癸亥", "{\"JSYQ\":\"母仓 玉堂\",\"XSYJ\":\"游祸 天贼 重日\"}");
            put("巳甲子", "{\"JSYQ\":\"月空 天恩 天马 不将\",\"XSYJ\":\"天吏 致死 五虚 白虎\"}");
            put("巳乙丑", "{\"JSYQ\":\"月德合 天恩 三合 临日 天喜 天医 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 四击 归忌\"}");
            put("巳丙寅", "{\"JSYQ\":\"天德合 天恩 母仓 敬安 五合 鸣吠对\",\"XSYJ\":\"天罡 劫煞 月害 土符 复日 天牢\"}");
            put("巳丁卯", "{\"JSYQ\":\"天恩 母仓 阴德 时阳 生气 普护 五合 鸣吠对\",\"XSYJ\":\"灾煞 天火 元武\"}");
            put("巳戊辰", "{\"JSYQ\":\"天恩 四相 时德 阳德 福生 司命\",\"XSYJ\":\"月煞 月虚 血支 五虚 绝阴\"}");
            put("巳己巳", "{\"JSYQ\":\"月恩 四相 王日\",\"XSYJ\":\"月建 小时 土府 重日 勾陈 小会 纯阳 阳错\"}");
            put("巳庚午", "{\"JSYQ\":\"月德 官日 吉期 圣心 青龙 鸣吠\",\"XSYJ\":\"大时 大败 咸池\"}");
            put("巳辛未", "{\"JSYQ\":\"天德 守日 天巫 福德 益后 明堂\",\"XSYJ\":\"月厌 地火 九空 九坎 九焦 大煞 孤辰\"}");
            put("巳壬申", "{\"JSYQ\":\"相日 六合 五富 续世 除神 鸣吠\",\"XSYJ\":\"河魁 死神 月刑 游祸 五虚 血忌 五离 天刑\"}");
            put("巳癸酉", "{\"JSYQ\":\"民日 三合 时阴 要安 除神 鸣吠\",\"XSYJ\":\"死气 五离 朱雀\"}");
            put("巳甲戌", "{\"JSYQ\":\"月空 不将 玉宇 解神 金匮\",\"XSYJ\":\"小耗 天贼\"}");
            put("巳乙亥", "{\"JSYQ\":\"月德合 驿马 天后 天仓 不将 金堂 宝光\",\"XSYJ\":\"月破 大耗 往亡 重日\"}");
            put("巳丙子", "{\"JSYQ\":\"天德合 天马 不将 鸣吠对\",\"XSYJ\":\"天吏 致死 四忌 七鸟 五虚 复日 触水龙 白虎\"}");
            put("巳丁丑", "{\"JSYQ\":\"三合 临日 天喜 天医 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 四击 归忌\"}");
            put("巳戊寅", "{\"JSYQ\":\"母仓 四相 敬安 五合\",\"XSYJ\":\"天罡 劫煞 月害 土符 天牢\"}");
            put("巳己卯", "{\"JSYQ\":\"天恩 母仓 月恩 四相 阴德 时阳 生气 普护 五合\",\"XSYJ\":\"灾煞 天火 地囊 元武\"}");
            put("巳庚辰", "{\"JSYQ\":\"月德 天恩 时德 阴德 福生 司命\",\"XSYJ\":\"月煞 月虚 血支 五虚\"}");
            put("巳辛巳", "{\"JSYQ\":\"天德 天恩 王日\",\"XSYJ\":\"月建 小时 土府 重日 勾陈\"}");
            put("巳壬午", "{\"JSYQ\":\"天恩 官日 吉期 圣心 青龙 鸣吠\",\"XSYJ\":\"大时 大败 咸池\"}");
            put("巳癸未", "{\"JSYQ\":\"天恩 守日 天巫 福德 益后 明堂\",\"XSYJ\":\"月厌 地火 九空 九坎 九焦 大煞 触水龙 孤辰\"}");
            put("巳甲申", "{\"JSYQ\":\"月空 相日 六合 五富 不将 续世 除神 鸣吠\",\"XSYJ\":\"河魁 死神 月刑 游祸 五虚 八风 血忌 五离 天刑\"}");
            put("巳乙酉", "{\"JSYQ\":\"月德合 民日 三合 时阴 不将 要安 除神 鸣吠\",\"XSYJ\":\"死气 五离 朱雀\"}");
            put("巳丙戌", "{\"JSYQ\":\"天德合 不将 玉宇 解神 金匮\",\"XSYJ\":\"小耗 天贼 五墓 复日\"}");
            put("巳丁亥", "{\"JSYQ\":\"驿马 天后 天仓 不将 金堂 宝光\",\"XSYJ\":\"月破 大耗 四穷 七鸟 往亡 重日\"}");
            put("巳戊子", "{\"JSYQ\":\"四相 天马 不将\",\"XSYJ\":\"天吏 致死 五虚 白虎\"}");
            put("巳己丑", "{\"JSYQ\":\"月恩 四相 三合 临日 天喜 天医 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 四击 归忌\"}");
            put("巳庚寅", "{\"JSYQ\":\"月德 母仓 敬安 五合 鸣吠对\",\"XSYJ\":\"天罡 劫煞 月害 土符 天牢\"}");
            put("巳辛卯", "{\"JSYQ\":\"天德 母仓 阴德 时阴 生气 普护 五合 鸣吠对\",\"XSYJ\":\"灾煞 天火 元武\"}");
            put("巳壬辰", "{\"JSYQ\":\"时德 阳德 福生 司命\",\"XSYJ\":\"月煞 月虚 血支 五虚\"}");
            put("巳癸巳", "{\"JSYQ\":\"王日\",\"XSYJ\":\"月建 小时 土府 重日 勾陈\"}");
            put("巳甲午", "{\"JSYQ\":\"月空 天赦 官日 吉期 圣心 青龙 鸣吠\",\"XSYJ\":\"大时 大败 咸池\"}");
            put("巳乙未", "{\"JSYQ\":\"月德合 守日 天巫 福德 益后 明堂\",\"XSYJ\":\"月厌 地火 九空 九坎 九焦 大煞 行狠\"}");
            put("巳丙申", "{\"JSYQ\":\"天德合 天愿 相日 六合 五富 不将 续世 除神 鸣吠\",\"XSYJ\":\"河魁 死神 月刑 游祸 五虚 血忌 复日 五离 天刑\"}");
            put("巳丁酉", "{\"JSYQ\":\"民日 三合 时阴 不将 要安 除神 鸣吠\",\"XSYJ\":\"死气 五离 朱雀\"}");
            put("巳戊戌", "{\"JSYQ\":\"四相 不将 玉宇 解神 金匮\",\"XSYJ\":\"小耗 天贼\"}");
            put("巳己亥", "{\"JSYQ\":\"月恩 四相 驿马 天后 天仓 金堂 宝光\",\"XSYJ\":\"月破 大耗 往亡 重日\"}");
            put("巳庚子", "{\"JSYQ\":\"月德 天马 鸣吠对\",\"XSYJ\":\"天吏 致死 五虚 白虎\"}");
            put("巳辛丑", "{\"JSYQ\":\"天德 三合 临日 天喜 天医 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 四击 归忌\"}");
            put("巳壬寅", "{\"JSYQ\":\"母仓 敬安 五合 鸣吠对\",\"XSYJ\":\"天罡 劫煞 月害 土符 天牢\"}");
            put("巳癸卯", "{\"JSYQ\":\"母仓 阴德 时阳 生气 普护 五合 鸣吠对\",\"XSYJ\":\"灾煞 天火 元武\"}");
            put("巳甲辰", "{\"JSYQ\":\"月空 时德 阳德 福生 司命\",\"XSYJ\":\"月煞 月虚 血支 五虚 八风\"}");
            put("巳乙巳", "{\"JSYQ\":\"月德合 王日\",\"XSYJ\":\"月建 小时 土府 重日 勾陈\"}");
            put("巳丙午", "{\"JSYQ\":\"天德合 官日 吉期 圣心 青龙 鸣吠\",\"XSYJ\":\"大时 大败 咸池 复日 岁薄\"}");
            put("巳丁未", "{\"JSYQ\":\"守日 天巫 福德 益后 明堂\",\"XSYJ\":\"月厌 地火 九空 九坎 九焦 大煞 八专 了戾 阴错\"}");
            put("巳戊申", "{\"JSYQ\":\"四相 相日 六合 五富 不将 续世 除神\",\"XSYJ\":\"河魁 死神 月刑 游祸 五虚 血忌 五离 天刑\"}");
            put("巳己酉", "{\"JSYQ\":\"天恩 月恩 四相 民日 三合 时阴 要安 除神 鸣吠\",\"XSYJ\":\"死气 地囊 五离 朱雀\"}");
            put("巳庚戌", "{\"JSYQ\":\"月德 天恩 玉宇 解神 金匮\",\"XSYJ\":\"小耗 天贼\"}");
            put("巳辛亥", "{\"JSYQ\":\"天德 天恩 驿马 天后 天仓 金堂 宝光\",\"XSYJ\":\"月破 大耗 往亡 重日\"}");
            put("巳壬子", "{\"JSYQ\":\"天恩 天马 鸣吠对\",\"XSYJ\":\"天吏 致死 四废 五虚 白虎\"}");
            put("巳癸丑", "{\"JSYQ\":\"天恩 三合 临日 天喜 天医 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 四击 归忌 八专 触水龙\"}");
            put("巳甲寅", "{\"JSYQ\":\"月空 母仓 敬安 五合 鸣吠对\",\"XSYJ\":\"天罡 劫煞 月害 土符 八专 天牢\"}");
            put("巳乙卯", "{\"JSYQ\":\"月德合 母仓 阴德 时阴 生气 普护 五合 鸣吠对\",\"XSYJ\":\"灾煞 天火 四耗 元武\"}");
            put("巳丙辰", "{\"JSYQ\":\"天德合 时德 阳德 福生 司命\",\"XSYJ\":\"月煞 月虚 血支 五虚 复日\"}");
            put("巳丁巳", "{\"JSYQ\":\"王日\",\"XSYJ\":\"月建 小时 土府 重日 勾陈 阳错\"}");
            put("巳戊午", "{\"JSYQ\":\"四相 官日 吉期 圣心 青龙\",\"XSYJ\":\"大时 大败 咸池 岁薄\"}");
            put("巳己未", "{\"JSYQ\":\"月恩 四相 守日 天巫 福德 益后 明堂\",\"XSYJ\":\"月厌 地火 九空 九坎 九焦 大煞 八专 孤辰 阴错\"}");
            put("巳庚申", "{\"JSYQ\":\"月德 相日 六合 五富 续世 除神 鸣吠\",\"XSYJ\":\"河魁 死神 月刑 游祸 五虚 血忌 五离 八专 天刑\"}");
            put("巳辛酉", "{\"JSYQ\":\"天德 民日 三合 时阴 要安 除神 鸣吠\",\"XSYJ\":\"死气 五离 朱雀\"}");
            put("巳壬戌", "{\"JSYQ\":\"玉宇 解神 金匮\",\"XSYJ\":\"小耗 天贼\"}");
            put("巳癸亥", "{\"JSYQ\":\"驿马 天后 天仓 金堂 宝光\",\"XSYJ\":\"月破 大耗 四废 往亡 重日 阴阳交破\"}");
            put("午甲子", "{\"JSYQ\":\"天恩 六仪 解神 金匮\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚\"}");
            put("午乙丑", "{\"JSYQ\":\"天恩 阴德 圣心 宝光\",\"XSYJ\":\"月煞 月虚 月害 四击\"}");
            put("午丙寅", "{\"JSYQ\":\"月德 天恩 母仓 三合 天马 天喜 天医 益后 五合 鸣吠对\",\"XSYJ\":\"大煞 归忌 白虎\"}");
            put("午丁卯", "{\"JSYQ\":\"天恩 母仓 续世 五合 玉堂 鸣吠对\",\"XSYJ\":\"河魁 大时 大败 咸池 九坎 九焦 血忌 往亡 复日\"}");
            put("午戊辰", "{\"JSYQ\":\"天恩 月恩 四相 时德 时阳 生气 要安\",\"XSYJ\":\"五虚 九空 天牢\"}");
            put("午己巳", "{\"JSYQ\":\"四相 王日 玉宇\",\"XSYJ\":\"游祸 血支 重日 元武\"}");
            put("午庚午", "{\"JSYQ\":\"阳德 官日 金堂 司命 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 月厌 地火 土符\"}");
            put("午辛未", "{\"JSYQ\":\"月德合 守日 吉期 六合\",\"XSYJ\":\"勾陈\"}");
            put("午壬申", "{\"JSYQ\":\"月空 相日 驿马 天后 天巫 福德 除神 青龙 鸣吠\",\"XSYJ\":\"五虚 五离\"}");
            put("午癸酉", "{\"JSYQ\":\"民日 不将 敬安 除神 明堂 鸣吠\",\"XSYJ\":\"天罡 死神 天吏 致死 天贼 五离\"}");
            put("午甲戌", "{\"JSYQ\":\"三合 临日 时阴 天仓 不将 普护\",\"XSYJ\":\"死气 天刑\"}");
            put("午乙亥", "{\"JSYQ\":\"五富 不将 福生\",\"XSYJ\":\"劫煞 小耗 重日 朱雀\"}");
            put("午丙子", "{\"JSYQ\":\"月德 六仪 解神 金匮 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 四忌 七鸟 五虚 触水龙\"}");
            put("午丁丑", "{\"JSYQ\":\"阴德 圣心 宝光\",\"XSYJ\":\"月煞 月虚 月害 复日\"}");
            put("午戊寅", "{\"JSYQ\":\"母仓 月恩 四相 三合 天马 天喜 天医 益后 五合\",\"XSYJ\":\"大煞 归忌 白虎\"}");
            put("午己卯", "{\"JSYQ\":\"天恩 母仓 四相 续世 五合 玉堂\",\"XSYJ\":\"河魁 大时 大败 咸池 九坎 九焦 血忌 往亡\"}");
            put("午庚辰", "{\"JSYQ\":\"天恩 时德 时阳 生气 要安\",\"XSYJ\":\"五虚 九空 天牢\"}");
            put("午辛巳", "{\"JSYQ\":\"月德合 天恩 王日 玉宇\",\"XSYJ\":\"游祸 血支 重日 元武\"}");
            put("午壬午", "{\"JSYQ\":\"月空 天恩 阳德 官日 金堂 司命 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 月厌 地火 土符\"}");
            put("午癸未", "{\"JSYQ\":\"天恩 守日 吉期 六合 不将\",\"XSYJ\":\"触水龙 勾陈\"}");
            put("午甲申", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 不将 除神 青龙 鸣吠\",\"XSYJ\":\"五虚 八风 五离\"}");
            put("午乙酉", "{\"JSYQ\":\"民日 不将 敬安 除神 明堂 鸣吠\",\"XSYJ\":\"天罡 死神 天吏 致死 天贼 五离\"}");
            put("午丙戌", "{\"JSYQ\":\"月德 三合 临日 时阴 天仓 不将 普护\",\"XSYJ\":\"死气 五墓 天刑\"}");
            put("午丁亥", "{\"JSYQ\":\"五富 福生\",\"XSYJ\":\"劫煞 小耗 四穷 七鸟 复日 重日 朱雀\"}");
            put("午戊子", "{\"JSYQ\":\"月恩 四相 六仪 解神 金匮\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚\"}");
            put("午己丑", "{\"JSYQ\":\"四相 阴德 圣心 宝光\",\"XSYJ\":\"月煞 月虚 月害 四击\"}");
            put("午庚寅", "{\"JSYQ\":\"母仓 三合 天马 天喜 天医 益后 五合 鸣吠对\",\"XSYJ\":\"大煞 归忌 白虎\"}");
            put("午辛卯", "{\"JSYQ\":\"月德合 母仓 续世 五合 玉堂 鸣吠对\",\"XSYJ\":\"河魁 大时 大败 咸池 九坎 九焦 血忌 往亡\"}");
            put("午壬辰", "{\"JSYQ\":\"月空 时德 时阳 生气 要安\",\"XSYJ\":\"五虚 九空 天牢\"}");
            put("午癸巳", "{\"JSYQ\":\"王日 玉宇\",\"XSYJ\":\"游祸 血支 重日 元武\"}");
            put("午甲午", "{\"JSYQ\":\"天赦 阳德 官日 金堂 司命 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 月厌 地火 土符\"}");
            put("午乙未", "{\"JSYQ\":\"守日 吉期 六合 不将\",\"XSYJ\":\"勾陈\"}");
            put("午丙申", "{\"JSYQ\":\"月德 相日 驿马 天后 天巫 福德 不将 除神 青龙 鸣吠\",\"XSYJ\":\"五虚 五离\"}");
            put("午丁酉", "{\"JSYQ\":\"民日 敬安 除神 明堂 鸣吠\",\"XSYJ\":\"天罡 死神 天吏 致死 天贼 复日 五离\"}");
            put("午戊戌", "{\"JSYQ\":\"月恩 四相 三合 临日 时阴 天仓 不将\",\"XSYJ\":\"死气 天刑\"}");
            put("午己亥", "{\"JSYQ\":\"四相 五富 福生\",\"XSYJ\":\"劫煞 小耗 重日 朱雀\"}");
            put("午庚子", "{\"JSYQ\":\"六仪 解神 金匮 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚\"}");
            put("午辛丑", "{\"JSYQ\":\"月德合 阴德 圣心 宝光\",\"XSYJ\":\"月煞 月虚 月害 四击\"}");
            put("午壬寅", "{\"JSYQ\":\"月空 母仓 三合 天马 天喜 天医 益后 五合 鸣吠对\",\"XSYJ\":\"大煞 归忌 白虎\"}");
            put("午癸卯", "{\"JSYQ\":\"母仓 续世 五合 玉堂 鸣吠对\",\"XSYJ\":\"河魁 大时 大败 咸池 九坎 九焦 血忌 往亡\"}");
            put("午甲辰", "{\"JSYQ\":\"时德 时阳 生气 要安\",\"XSYJ\":\"五虚 八风 九空 地囊 天牢\"}");
            put("午乙巳", "{\"JSYQ\":\"王日 玉宇\",\"XSYJ\":\"游祸 血支 重日 元武\"}");
            put("午丙午", "{\"JSYQ\":\"月德 阳德 官日 金堂 司命 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 月厌 地火 土符 大会 阴阳俱错\"}");
            put("午丁未", "{\"JSYQ\":\"天愿 守日 吉期 六合\",\"XSYJ\":\"复日 八专 勾陈\"}");
            put("午戊申", "{\"JSYQ\":\"月恩 四相 相日 驿马 天后 天巫 福德 不将 除神 青龙\",\"XSYJ\":\"五虚 五离\"}");
            put("午己酉", "{\"JSYQ\":\"天恩 四相 民日 敬安 除神 明堂 鸣吠\",\"XSYJ\":\"天罡 死神 天吏 致死 天贼 五离\"}");
            put("午庚戌", "{\"JSYQ\":\"天恩 三合 临日 时阴 天仓 普护\",\"XSYJ\":\"死气 天刑\"}");
            put("午辛亥", "{\"JSYQ\":\"月德合 天恩 五富 福生\",\"XSYJ\":\"劫煞 小耗 重日 朱雀\"}");
            put("午壬子", "{\"JSYQ\":\"月空 天恩 六仪 解神 金匮 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 四废 五虚 阴阳击冲\"}");
            put("午癸丑", "{\"JSYQ\":\"天恩 阴德 圣心 宝光\",\"XSYJ\":\"月煞 月虚 月害 四击 八专 触水龙\"}");
            put("午甲寅", "{\"JSYQ\":\"母仓 三合 天马 天喜 天医 益后 五合 鸣吠对\",\"XSYJ\":\"大煞 归忌 八专 白虎\"}");
            put("午乙卯", "{\"JSYQ\":\"母仓 续世 五合 玉堂 鸣吠对\",\"XSYJ\":\"河魁 大时 大败 咸池 四耗 九坎 九焦 血忌 往亡\"}");
            put("午丙辰", "{\"JSYQ\":\"月德 时德 时阳 生气 要安\",\"XSYJ\":\"五虚 九空 天牢\"}");
            put("午丁巳", "{\"JSYQ\":\"王日 玉宇\",\"XSYJ\":\"游祸 血支 复日 重日 元武\"}");
            put("午戊午", "{\"JSYQ\":\"月德 四相 阳德 官日 金堂 司命\",\"XSYJ\":\"月建 小时 土府 月刑 月厌 地火 土符 小会\"}");
            put("午己未", "{\"JSYQ\":\"四相 守日 吉期 六合\",\"XSYJ\":\"八专 勾陈\"}");
            put("午庚申", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 除神 青龙 鸣吠\",\"XSYJ\":\"五虚 五离 八专\"}");
            put("午辛酉", "{\"JSYQ\":\"月德合 民日 敬安 除神 明堂 鸣吠\",\"XSYJ\":\"天罡 死神 天吏 致死 天贼 五离\"}");
            put("午壬戌", "{\"JSYQ\":\"月空 三合 临日 时阴 天仓 普护\",\"XSYJ\":\"死气 地囊 天刑\"}");
            put("午癸亥", "{\"JSYQ\":\"五富 不将 福生\",\"XSYJ\":\"劫煞 小耗 四废 重日 朱雀\"}");
            put("未甲子", "{\"JSYQ\":\"天德 月德 天恩 金堂 解神\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 九坎 九焦 归忌 天刑\"}");
            put("未乙丑", "{\"JSYQ\":\"天恩\",\"XSYJ\":\"月破 大耗 月刑 四击 九空 朱雀\"}");
            put("未丙寅", "{\"JSYQ\":\"天恩 母仓 五富 五合 金匮 鸣吠对\",\"XSYJ\":\"游祸\"}");
            put("未丁卯", "{\"JSYQ\":\"天恩 母仓 三合 临日 天喜 天医 敬安 五合 宝光 鸣吠对\",\"XSYJ\":\"大煞\"}");
            put("未戊辰", "{\"JSYQ\":\"天恩 四相 时德 天马 普护\",\"XSYJ\":\"天罡 五虚 五墓 白虎\"}");
            put("未己巳", "{\"JSYQ\":\"天德合 月德合 四相 王日 驿马 天后 时阳 生气 福生 玉堂\",\"XSYJ\":\"月厌 地火 复日 重日 阴错\"}");
            put("未庚午", "{\"JSYQ\":\"月空 官日 六合 鸣吠\",\"XSYJ\":\"天吏 致死 血支 往亡 天牢\"}");
            put("未辛未", "{\"JSYQ\":\"月恩 守日 圣心\",\"XSYJ\":\"月建 小时 土府 元武\"}");
            put("未壬申", "{\"JSYQ\":\"阳德 相日 吉期 不将 益后 除神 司命 鸣吠\",\"XSYJ\":\"劫煞 天贼 五虚 五离\"}");
            put("未癸酉", "{\"JSYQ\":\"民日 天巫 福德 天仓 不将 续世 除神 鸣吠\",\"XSYJ\":\"劫煞 天贼 五虚 五离\"}");
            put("未甲戌", "{\"JSYQ\":\"天德 月德 不将 要安 青龙\",\"XSYJ\":\"河魁 死神 月煞 月虚 土符\"}");
            put("未乙亥", "{\"JSYQ\":\"阴德 三合 时阴 六仪 玉宇 明堂\",\"XSYJ\":\"厌对 招摇 死气 重日\"}");
            put("未丙子", "{\"JSYQ\":\"金堂 解神 鸣吠对\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 四忌 七鸟 五虚 九坎 九焦 归忌 触水龙 天刑\"}");
            put("未丁丑", "{\"JSYQ\":\"[无神煞]\",\"XSYJ\":\"月破 大耗 月刑 四击 九空 朱雀\"}");
            put("未戊寅", "{\"JSYQ\":\"母仓 四相 五富 五合 金匮\",\"XSYJ\":\"游祸\"}");
            put("未己卯", "{\"JSYQ\":\"天德合 月德合 天恩 母仓 四相 三合 临日 天喜 天医 敬安 五合 宝光\",\"XSYJ\":\"大煞 复日\"}");
            put("未庚辰", "{\"JSYQ\":\"月空 天恩 时德 天马 普护\",\"XSYJ\":\"天罡 五虚 白虎\"}");
            put("未辛巳", "{\"JSYQ\":\"天恩 月恩 王日 驿马 天后 时阳 生气 福生 玉堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("未壬午", "{\"JSYQ\":\"天恩 官日 六合 不将 鸣吠\",\"XSYJ\":\"天吏 致死 血支 往亡 天牢\"}");
            put("未癸未", "{\"JSYQ\":\"天恩 守日 不将 圣心\",\"XSYJ\":\"月建 小时 土府 触水龙 元武\"}");
            put("未甲申", "{\"JSYQ\":\"天德 月德 阳德 相日 吉期 不将 益后 除神 司命 鸣吠\",\"XSYJ\":\"劫煞 天贼 五虚 八风 五离\"}");
            put("未乙酉", "{\"JSYQ\":\"民日 天巫 福德 天仓 不将 续世 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 血忌 五离 勾陈\"}");
            put("未丙戌", "{\"JSYQ\":\"要安 青龙\",\"XSYJ\":\"河魁 死神 月煞 月虚 土符 地囊\"}");
            put("未丁亥", "{\"JSYQ\":\"阴德 三合 时阴 六仪 玉宇 明堂\",\"XSYJ\":\"厌对 招摇 死气 四穷 七鸟 重日\"}");
            put("未戊子", "{\"JSYQ\":\"四相 金堂 解神\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 九坎 九焦 归忌 天刑\"}");
            put("未己丑", "{\"JSYQ\":\"天德合 月德合 四相\",\"XSYJ\":\"月破 大耗 月刑 四击 九空 复日 朱雀\"}");
            put("未庚寅", "{\"JSYQ\":\"月空 母仓 五富 五合 金匮 鸣吠对\",\"XSYJ\":\"游祸\"}");
            put("未辛卯", "{\"JSYQ\":\"母仓 月恩 三合 临日 天喜 天医 敬安 五合 宝光 鸣吠对\",\"XSYJ\":\"大煞\"}");
            put("未壬辰", "{\"JSYQ\":\"时德 天马 普护\",\"XSYJ\":\"天罡 五虚 白虎\"}");
            put("未癸巳", "{\"JSYQ\":\"王日 驿马 天后 时阳 生气 福生 玉堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("未甲午", "{\"JSYQ\":\"天德 月德 天赦 官日 六合 不将 鸣吠\",\"XSYJ\":\"天吏 致死 血支 往亡 天牢\"}");
            put("未乙未", "{\"JSYQ\":\"守日 不将 圣心\",\"XSYJ\":\"月建 小时 土府 元武\"}");
            put("未丙申", "{\"JSYQ\":\"阳德 相日 吉期 益后 除神 司命 鸣吠\",\"XSYJ\":\"劫煞 天贼 五虚 五离\"}");
            put("未丁酉", "{\"JSYQ\":\"民日 天巫 福德 天仓 续世 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 血忌 五离 勾陈\"}");
            put("未戊戌", "{\"JSYQ\":\"四相 不将 要安 青龙\",\"XSYJ\":\"河魁 死神 月煞 月虚 土符\"}");
            put("未己亥", "{\"JSYQ\":\"天德合 月德合 四相 阴德 三合 时阴 六仪 玉宇 明堂\",\"XSYJ\":\"厌对 招摇 死气 复日 重日\"}");
            put("未庚子", "{\"JSYQ\":\"月空 金堂 解神 鸣吠对\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 九坎 九焦 归忌 天刑\"}");
            put("未辛丑", "{\"JSYQ\":\"月恩\",\"XSYJ\":\"月破 大耗 月刑 四击 九空 朱雀\"}");
            put("未壬寅", "{\"JSYQ\":\"母仓 五富 五合 金匮 鸣吠对\",\"XSYJ\":\"游祸\"}");
            put("未癸卯", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医 敬安 五合 宝光 鸣吠对\",\"XSYJ\":\"大煞\"}");
            put("未甲辰", "{\"JSYQ\":\"天德 月德 时德 天马 普护\",\"XSYJ\":\"天罡 五虚 八风 白虎\"}");
            put("未乙巳", "{\"JSYQ\":\"王日 驿马 天后 时阳 生气 福生 玉堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("未丙午", "{\"JSYQ\":\"官日 六合 鸣吠\",\"XSYJ\":\"天吏 致死 血支 往亡 天牢 逐阵\"}");
            put("未丁未", "{\"JSYQ\":\"守日 圣心\",\"XSYJ\":\"月建 小时 土府 八专 元武 阳错\"}");
            put("未戊申", "{\"JSYQ\":\"四相 阳德 相日 吉期 不将 益后 除神 司命\",\"XSYJ\":\"劫煞 天贼 五虚 五离\"}");
            put("未己酉", "{\"JSYQ\":\"天德合 月德合 天恩 四相 民日 天巫 福德 天仓 续世 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 血忌 复日 五离 勾陈\"}");
            put("未庚戌", "{\"JSYQ\":\"月空 天恩 要安 青龙\",\"XSYJ\":\"河魁 死神 月煞 月虚 土符\"}");
            put("未辛亥", "{\"JSYQ\":\"天恩 月恩 阴德 三合 时阴 六仪 玉宇 明堂\",\"XSYJ\":\"厌对 招摇 死气 重日\"}");
            put("未壬子", "{\"JSYQ\":\"天恩 金堂 解神 鸣吠对\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 四废 五虚 九坎 九焦 归忌 天刑\"}");
            put("未癸丑", "{\"JSYQ\":\"天恩\",\"XSYJ\":\"月破 大耗 月刑 四击 九空 八专 触水龙 朱雀 阳错阴冲\"}");
            put("未甲寅", "{\"JSYQ\":\"天德 月德 母仓 五富 五合 金匮 鸣吠对\",\"XSYJ\":\"游祸 八专\"}");
            put("未乙卯", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医 敬安 五合 宝光 鸣吠对\",\"XSYJ\":\"四耗 大煞\"}");
            put("未丙辰", "{\"JSYQ\":\"时德 天马 普护\",\"XSYJ\":\"天罡 五虚 地囊 白虎\"}");
            put("未丁巳", "{\"JSYQ\":\"王日 驿马 天后 时阳 生气 福生 玉堂\",\"XSYJ\":\"月厌 地火 重日 大会 阴错\"}");
            put("未戊午", "{\"JSYQ\":\"天愿 四相 官日 六合 不将\",\"XSYJ\":\"天吏 致死 血支 往亡 天牢 逐阵\"}");
            put("未己未", "{\"JSYQ\":\"天德合 月德合 四相 守日 圣心\",\"XSYJ\":\"月建 小时 土府 复日 八专 元武 阳错\"}");
            put("未庚申", "{\"JSYQ\":\"月空 阳德 相日 吉期 益后 除神 司命 鸣吠\",\"XSYJ\":\"劫煞 天贼 五虚 五离 八专\"}");
            put("未辛酉", "{\"JSYQ\":\"月恩 民日 天巫 福德 天仓 续世 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 血忌 五离 勾陈\"}");
            put("未壬戌", "{\"JSYQ\":\"不将 要安 青龙\",\"XSYJ\":\"河魁 死神 月煞 月虚 土符\"}");
            put("未癸亥", "{\"JSYQ\":\"阴德 三合 时阴 六仪 玉宇 明堂\",\"XSYJ\":\"厌对 招摇 死气 四废 重日\"}");
            put("申甲子", "{\"JSYQ\":\"天恩 时阳 民日 三合 临日 时阴 福生 青龙\",\"XSYJ\":\"死气\"}");
            put("申乙丑", "{\"JSYQ\":\"天恩 母仓 明堂\",\"XSYJ\":\"小耗 归忌\"}");
            put("申丙寅", "{\"JSYQ\":\"月空 天恩 驿马 天后 圣心 解神 五合 鸣吠对\",\"XSYJ\":\"月破 大耗 月刑 天刑\"}");
            put("申丁卯", "{\"JSYQ\":\"月德合 天恩 益后 五合 鸣吠对\",\"XSYJ\":\"天吏 致死 朱雀 五虚 七符\"}");
            put("申戊辰", "{\"JSYQ\":\"天德合 天恩 母仓 三合 天喜 天医 续世 金匮\",\"XSYJ\":\"月厌 地火 四击 大煞 血忌\"}");
            put("申己巳", "{\"JSYQ\":\"天愿 六合 五富 要安 宝光\",\"XSYJ\":\"河魁 劫煞 重日\"}");
            put("申庚午", "{\"JSYQ\":\"天马 时阳 生气 玉宇 鸣吠\",\"XSYJ\":\"灾煞 天火 复日 白虎\"}");
            put("申辛未", "{\"JSYQ\":\"母仓 金堂 玉堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚\"}");
            put("申壬申", "{\"JSYQ\":\"月德 月恩 四相 王日\",\"XSYJ\":\"月建 小时 土符 五离 天牢\"}");
            put("申癸酉", "{\"JSYQ\":\"天德 四相 阴德 官日 吉期 不将 除神 鸣吠\",\"XSYJ\":\"大时 大败 咸池 九坎 九焦 往亡 五离 元武\"}");
            put("申甲戌", "{\"JSYQ\":\"母仓 阳德 守日 天巫 福德 六仪 敬安 司命\",\"XSYJ\":\"厌对 招摇 天狗 九空\"}");
            put("申乙亥", "{\"JSYQ\":\"相日 普护\",\"XSYJ\":\"天罡 死神 月害 游祸 重日 勾陈\"}");
            put("申丙子", "{\"JSYQ\":\"月空 时德 民日 三合 临日 时阴 福生 青龙 鸣吠对\",\"XSYJ\":\"死气 触水龙\"}");
            put("申丁丑", "{\"JSYQ\":\"月德合 母仓 明堂\",\"XSYJ\":\"小耗 归忌\"}");
            put("申戊寅", "{\"JSYQ\":\"天德合 驿马 天后 圣心 解神 五合\",\"XSYJ\":\"月破 大耗 月刑\"}");
            put("申己卯", "{\"JSYQ\":\"天恩 益后 五合\",\"XSYJ\":\"天吏 致死 五虚 土符 朱雀\"}");
            put("申庚辰", "{\"JSYQ\":\"天恩 母仓 三合 天喜 天医 续世 金匮\",\"XSYJ\":\"月厌 地火 四击 大煞 血忌 复日 大会\"}");
            put("申辛巳", "{\"JSYQ\":\"天恩 六合 五富 要安 宝光\",\"XSYJ\":\"河魁 劫煞 重日\"}");
            put("申壬午", "{\"JSYQ\":\"月德 天德 月恩 四相 天马 时阳 生气 不将 玉宇 鸣吠\",\"XSYJ\":\"灾煞 天火 白虎\"}");
            put("申癸未", "{\"JSYQ\":\"天德 天恩 母仓 四相 不将 金堂 玉堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 触水龙\"}");
            put("申甲申", "{\"JSYQ\":\"王日 天仓 不将 除神 鸣吠\",\"XSYJ\":\"月建 小时 土府 五离 天牢\"}");
            put("申乙酉", "{\"JSYQ\":\"阴德 官日 吉期 不将 除神 鸣吠\",\"XSYJ\":\"大时 大败 咸池 九坎 九焦 往亡 五离 元武\"}");
            put("申丙戌", "{\"JSYQ\":\"月空 母仓 阳德 守日 天巫 福德 六仪 敬安 司命\",\"XSYJ\":\"厌对 招摇 天狗 九空\"}");
            put("申丁亥", "{\"JSYQ\":\"月德合 相日 普护\",\"XSYJ\":\"天罡 死神 月害 游祸 五虚 八风 地囊 重日 勾陈\"}");
            put("申戊子", "{\"JSYQ\":\"天德合 时德 民日 三合 临日 时阴 福生 青龙\",\"XSYJ\":\"死气\"}");
            put("申己丑", "{\"JSYQ\":\"母仓 明堂\",\"XSYJ\":\"小耗 归忌\"}");
            put("申庚寅", "{\"JSYQ\":\"驿马 天后 圣心\",\"XSYJ\":\"五合 鸣吠对\"}");
            put("申辛卯", "{\"JSYQ\":\"益后 五合 鸣吠对\",\"XSYJ\":\"天吏 致死 五虚 土符 朱雀\"}");
            put("申壬辰", "{\"JSYQ\":\"月德 母仓 月恩 四相 三合 天喜 天医 续世 金匮\",\"XSYJ\":\"月厌 地火 四击 大煞 血忌\"}");
            put("申癸巳", "{\"JSYQ\":\"天德 四相 六合 五富 不将 要安 宝光\",\"XSYJ\":\"河魁 劫煞 重日\"}");
            put("申甲午", "{\"JSYQ\":\"天马 时阳 生气 不将 玉宇 鸣吠\",\"XSYJ\":\"灾煞 天火 白虎\"}");
            put("申乙未", "{\"JSYQ\":\"母仓 不将 金堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚\"}");
            put("申丙申", "{\"JSYQ\":\"月空 王日 天仓 除神 鸣吠\",\"XSYJ\":\"月建 小时 土府 五离 天牢\"}");
            put("申丁酉", "{\"JSYQ\":\"月德合 阴德 官日 吉期 除神 鸣吠\",\"XSYJ\":\"大时 大败 咸池 九坎 九焦 往亡 五离 元武\"}");
            put("申戊戌", "{\"JSYQ\":\"天德合 母仓 阳德 守日 天巫 福德 六仪 敬安 司命\",\"XSYJ\":\"厌对 招摇 天狗 九空\"}");
            put("申己亥", "{\"JSYQ\":\"相日 普护\",\"XSYJ\":\"天罡 死神 月害 游祸 五虚 重日 勾陈\"}");
            put("申庚子", "{\"JSYQ\":\"时德 民日 三合 临日 时阴 福生 青龙 鸣吠对\",\"XSYJ\":\"死气 四忌 九虎 复日\"}");
            put("申辛丑", "{\"JSYQ\":\"母仓 明堂\",\"XSYJ\":\"小耗 五墓 归忌\"}");
            put("申壬寅", "{\"JSYQ\":\"月德 月恩 四相 驿马 天后 圣心 解神 五合 鸣吠对\",\"XSYJ\":\"月破 大耗 月刑 天刑\"}");
            put("申癸卯", "{\"JSYQ\":\"天德 四相 益后 五合 鸣吠对\",\"XSYJ\":\"天吏 致死 五虚 土符 朱雀\"}");
            put("申甲辰", "{\"JSYQ\":\"母仓 三合 天喜 天医 续世 金匮\",\"XSYJ\":\"月厌 地火 四击 大煞 血忌 阴错\"}");
            put("申乙巳", "{\"JSYQ\":\"六合 五富 不将 要安 宝光\",\"XSYJ\":\"河魁 劫煞 重日\"}");
            put("申丙午", "{\"JSYQ\":\"月空 天马 时阳 生气 玉宇 鸣吠\",\"XSYJ\":\"灾煞 天火 白虎\"}");
            put("申丁未", "{\"JSYQ\":\"月德合 母仓 金堂 玉堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 八风 八专\"}");
            put("申戊申", "{\"JSYQ\":\"天德合 天赦 王日 天仓 不将\",\"XSYJ\":\"月建 小时 土府 五离 天牢\"}");
            put("申己酉", "{\"JSYQ\":\"天恩 阴德 官日 吉期 除神 鸣吠\",\"XSYJ\":\"大时 大败 咸池 九坎 九焦 往亡 五离 元武\"}");
            put("申庚戌", "{\"JSYQ\":\"天恩 母仓 阳德 守日 天巫 福德 六仪 敬安 司命\",\"XSYJ\":\"厌对 招摇 天狗 九空 复日\"}");
            put("申辛亥", "{\"JSYQ\":\"天恩 相日 普护\",\"XSYJ\":\"天罡 死神 月害 游祸 四穷 九虎 五虚 重日 勾陈\"}");
            put("申壬子", "{\"JSYQ\":\"月德 天恩 月恩 四相 时德 民日 三合 临日 时阴 福生 青龙 鸣吠对\",\"XSYJ\":\"死气\"}");
            put("申癸丑", "{\"JSYQ\":\"天德 天恩 母仓 四相 明堂\",\"XSYJ\":\"小耗 归忌 八专 触水龙\"}");
            put("申甲寅", "{\"JSYQ\":\"驿马 天后 圣心 解神 五合 鸣吠对\",\"XSYJ\":\"月破 大耗 月刑 四废 八专 天刑\"}");
            put("申乙卯", "{\"JSYQ\":\"益后 五合 鸣吠对\",\"XSYJ\":\"天吏 致死 四废 五虚 土符 朱雀 三阴\"}");
            put("申丙辰", "{\"JSYQ\":\"月空 母仓 三合 天喜 天医 续世 金匮\",\"XSYJ\":\"月厌 地火 四击 大煞 血忌\"}");
            put("申丁巳", "{\"JSYQ\":\"月德合 六合 五富 要安 宝光\",\"XSYJ\":\"河魁 劫煞 地囊 重日\"}");
            put("申戊午", "{\"JSYQ\":\"天德合 天马 时阳 生气 不将 玉宇\",\"XSYJ\":\"四耗 白虎\"}");
            put("申己未", "{\"JSYQ\":\"母仓 金堂 玉堂\",\"XSYJ\":\"月煞 月虚 血支 天贼 五虚 八专\"}");
            put("申庚申", "{\"JSYQ\":\"王日 天仓 除神 鸣吠\",\"XSYJ\":\"月建 小时 土府 复日 五离 八专 天牢 阳错\"}");
            put("申辛酉", "{\"JSYQ\":\"阴德 官日 吉期 除神 鸣吠\",\"XSYJ\":\"大时 大败 咸池 九坎 九焦 往亡 五离 元武\"}");
            put("申壬戌", "{\"JSYQ\":\"月德 母仓 月恩 四相 阳德 守日 天巫 福德 六仪 敬安 司命\",\"XSYJ\":\"厌对 招摇 天狗 九空\"}");
            put("申癸亥", "{\"JSYQ\":\"天德 四相 相日 普护\",\"XSYJ\":\"天罡 死神 月害 游祸 五虚 重日 勾陈\"}");
            put("酉甲子", "{\"JSYQ\":\"月空 天恩 时德 阳德 民日 玉宇 司命\",\"XSYJ\":\"河魁 死神 天吏 致死 往亡\"}");
            put("酉乙丑", "{\"JSYQ\":\"月德合 天恩 母仓 三合 时阴 金堂\",\"XSYJ\":\"死气 勾陈\"}");
            put("酉丙寅", "{\"JSYQ\":\"天恩 解神 五合 青龙 鸣吠对\",\"XSYJ\":\"劫煞 小耗 地囊 归忌\"}");
            put("酉丁卯", "{\"JSYQ\":\"天恩 五合 明堂 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚\"}");
            put("酉戊辰", "{\"JSYQ\":\"天恩 母仓 六合 不将 敬安\",\"XSYJ\":\"月煞 月虚 四击 天刑\"}");
            put("酉己巳", "{\"JSYQ\":\"三合 临日 天喜 天医 普护\",\"XSYJ\":\"成日 朱雀\"}");
            put("酉庚午", "{\"JSYQ\":\"月德 福生 金匮 鸣吠\",\"XSYJ\":\"天罡 大时 大败 咸池 天贼 九坎 九焦\"}");
            put("酉辛未", "{\"JSYQ\":\"母仓 阴德 时阳 生气 天仓 不将 宝光\",\"XSYJ\":\"五虚 九空 土符 复日\"}");
            put("酉壬申", "{\"JSYQ\":\"四相 王日 天马 五富 不将 圣心 除神 鸣吠\",\"XSYJ\":\"游祸 血支 五离 白虎\"}");
            put("酉癸酉", "{\"JSYQ\":\"月恩 四相 官日 六仪 益后 除神 除神 玉堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 厌对 招摇 五离\"}");
            put("酉甲戌", "{\"JSYQ\":\"月空 母仓 守日 吉期 续世\",\"XSYJ\":\"月害 血忌 天牢\"}");
            put("酉乙亥", "{\"JSYQ\":\"月德合 相日 驿马 天后 天巫 福德 要安\",\"XSYJ\":\"五虚 大煞 重日 元武\"}");
            put("酉丙子", "{\"JSYQ\":\"时德 阳德 民日 玉宇 司命 鸣吠对\",\"XSYJ\":\"河魁 死神 天吏 致死 往亡 触水龙\"}");
            put("酉丁丑", "{\"JSYQ\":\"母仓 三合 时阴 金堂\",\"XSYJ\":\"死气 勾陈\"}");
            put("酉戊寅", "{\"JSYQ\":\"解神 五合 青龙\",\"XSYJ\":\"劫煞 小耗 归忌\"}");
            put("酉己卯", "{\"JSYQ\":\"天恩 五合 明堂\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 阴道冲阳\"}");
            put("酉庚辰", "{\"JSYQ\":\"月德 天恩 母仓 天愿 六合 敬安\",\"XSYJ\":\"月煞 月虚 四击 天刑\"}");
            put("酉辛巳", "{\"JSYQ\":\"天恩 三合 临日 天喜 天医 不将 普护\",\"XSYJ\":\"复日 重日 朱雀\"}");
            put("酉壬午", "{\"JSYQ\":\"天恩 四相 不将 福生 金匮 鸣吠\",\"XSYJ\":\"天罡 大时 大败 咸池 天贼 九坎 九焦\"}");
            put("酉癸未", "{\"JSYQ\":\"天恩 母仓 月恩 四相 阴德 时阳 生气 天仓 不将 宝光\",\"XSYJ\":\"五虚 九空 土符 触水龙\"}");
            put("酉甲申", "{\"JSYQ\":\"月空 王日 天马 五富 不将 圣心 除神 鸣吠\",\"XSYJ\":\"游祸 血支 五离 白虎\"}");
            put("酉乙酉", "{\"JSYQ\":\"月德合 官日 六仪 益后 除神 玉堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 厌对 招摇 五离\"}");
            put("酉丙戌", "{\"JSYQ\":\"母仓 守日 吉期 续世\",\"XSYJ\":\"月害 血忌 天牢\"}");
            put("酉丁亥", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 要安\",\"XSYJ\":\"五虚 八风 大煞 重日 元武\"}");
            put("酉戊子", "{\"JSYQ\":\"时德 阳德 民日 玉宇 司命\",\"XSYJ\":\"河魁 死神 天吏 致死 往亡\"}");
            put("酉己丑", "{\"JSYQ\":\"母仓 三合 时阴 金堂\",\"XSYJ\":\"死气 勾陈\"}");
            put("酉庚寅", "{\"JSYQ\":\"月德 解神 五合 青龙 鸣吠对\",\"XSYJ\":\"劫煞 小耗 归忌\"}");
            put("酉辛卯", "{\"JSYQ\":\"五合 明堂 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚 复日 大会\"}");
            put("酉壬辰", "{\"JSYQ\":\"母仓 四相 六合 不将 敬安\",\"XSYJ\":\"月煞 月虚 四击 天刑\"}");
            put("酉癸巳", "{\"JSYQ\":\"月恩 四相 三合 临日 天喜 天医 不将 普护\",\"XSYJ\":\"重日 朱雀\"}");
            put("酉甲午", "{\"JSYQ\":\"月空 不将 福生 金匮 鸣吠\",\"XSYJ\":\"天罡 大时 大败 咸池 天贼 九坎 九焦\"}");
            put("酉乙未", "{\"JSYQ\":\"月德合 母仓 阳德 时阳 生气 天仓 宝光\",\"XSYJ\":\"五虚 九空 土符\"}");
            put("酉丙申", "{\"JSYQ\":\"王日 天马 五富 圣心 除神 鸣吠\",\"XSYJ\":\"游祸 血支 地囊 五离 白虎\"}");
            put("酉丁酉", "{\"JSYQ\":\"官日 六仪 益后 除神 玉堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 厌对 招摇 五离\"}");
            put("酉戊戌", "{\"JSYQ\":\"母仓 守日 吉期 续世\",\"XSYJ\":\"月害 血忌 天牢\"}");
            put("酉己亥", "{\"JSYQ\":\"相日 驿马 天后 天巫 福德 要安\",\"XSYJ\":\"五虚 大煞 重日 元武\"}");
            put("酉庚子", "{\"JSYQ\":\"月德 时德 阳德 民日 玉宇 司命 鸣吠对\",\"XSYJ\":\"河魁 死神 天吏 致死 四忌 九虎 往亡\"}");
            put("酉辛丑", "{\"JSYQ\":\"母仓 三合 时阴 金堂\",\"XSYJ\":\"死气 五墓 复日 勾陈\"}");
            put("酉壬寅", "{\"JSYQ\":\"四相 解神 五合 青龙 鸣吠对\",\"XSYJ\":\"劫煞 小耗 归忌\"}");
            put("酉癸卯", "{\"JSYQ\":\"月恩 四相 五合 明堂 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 五虚\"}");
            put("酉甲辰", "{\"JSYQ\":\"月空 母仓 六合 不将 敬安\",\"XSYJ\":\"月煞 月虚 四击 天刑\"}");
            put("酉乙巳", "{\"JSYQ\":\"月德合 三合 临日 天喜 天医 普护\",\"XSYJ\":\"重日 朱雀\"}");
            put("酉丙午", "{\"JSYQ\":\"福生 金匮 鸣吠\",\"XSYJ\":\"天罡 大时 大败 咸池 天贼 九坎 九焦\"}");
            put("酉丁未", "{\"JSYQ\":\"母仓 阴德 时阳 生气 天仓 宝光\",\"XSYJ\":\"五虚 八风 九空 土符 八专\"}");
            put("酉戊申", "{\"JSYQ\":\"天赦 王日 天马 五富 不将 圣心 除神\",\"XSYJ\":\"游祸 血支 五离 白虎\"}");
            put("酉己酉", "{\"JSYQ\":\"天恩 官日 六仪 益后 除神 玉堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 月厌 厌对 招摇 五离 小会\"}");
            put("酉庚戌", "{\"JSYQ\":\"月德 天恩 母仓 守日 吉期 续世\",\"XSYJ\":\"月害 血忌 天牢\"}");
            put("酉辛亥", "{\"JSYQ\":\"天恩 相日 驿马 天后 天巫 福德 要安\",\"XSYJ\":\"四穷 九虎 五虚 大煞 复日 重日 元武\"}");
            put("酉壬子", "{\"JSYQ\":\"天恩 四相 时德 阳德 民日 玉宇 司命 鸣吠对\",\"XSYJ\":\"河魁 死神 天吏 致死 往亡\"}");
            put("酉癸丑", "{\"JSYQ\":\"天恩 母仓 月恩 四相 三合 时阴 金堂\",\"XSYJ\":\"死气 八专 触水龙 勾陈\"}");
            put("酉甲寅", "{\"JSYQ\":\"月空 解神 五合 青龙 鸣吠对\",\"XSYJ\":\"劫煞 小耗 四废 归忌 八专\"}");
            put("酉乙卯", "{\"JSYQ\":\"月德合 五合 明堂 鸣吠对\",\"XSYJ\":\"月破 大耗 灾煞 天火 月厌 地火 四废 五虚 阴错\"}");
            put("酉丙辰", "{\"JSYQ\":\"母仓 六合 敬安\",\"XSYJ\":\"月煞 月虚 四击 天刑\"}");
            put("酉丁巳", "{\"JSYQ\":\"三合 临日 天喜 天医 普护\",\"XSYJ\":\"重日 朱雀\"}");
            put("酉戊午", "{\"JSYQ\":\"不将 福生 金匮\",\"XSYJ\":\"天罡 大时 大败 咸池 天贼 四耗 九坎 九焦\"}");
            put("酉己未", "{\"JSYQ\":\"母仓 阴德 时阳 生气 天仓 宝光\",\"XSYJ\":\"五虚 九空 土符 八专\"}");
            put("酉庚申", "{\"JSYQ\":\"月德 王日 天马 五富 圣心 除神 鸣吠\",\"XSYJ\":\"游祸 血支 五离 八专 白虎\"}");
            put("酉辛酉", "{\"JSYQ\":\"官日 六仪 益后 除神 玉堂 鸣吠\",\"XSYJ\":\"月建 小时 土府 月刑 厌对 招摇 复日 五离 阳错\"}");
            put("酉壬戌", "{\"JSYQ\":\"母仓 四相 守日 吉期 续世\",\"XSYJ\":\"月害 血忌 天牢\"}");
            put("酉癸亥", "{\"JSYQ\":\"月恩 四相 相日 驿马 天后 天巫 福德 要安\",\"XSYJ\":\"五虚 大煞 重日 元武\"}");
            put("戌甲子", "{\"JSYQ\":\"天恩 时德 民日 天符 福德 普护\",\"XSYJ\":\"灾煞 天火 大煞 归忌 天牢\"}");
            put("戌乙丑", "{\"JSYQ\":\"天恩 母仓 福生\",\"XSYJ\":\"天罡 死神 月煞 月虚 元武\"}");
            put("戌丙寅", "{\"JSYQ\":\"天德 月德 天恩 阳德 三合 临日 时阴 五合 司命 鸣吠对\",\"XSYJ\":\"月厌 地火 死气 九坎 九焦 孤辰\"}");
            put("戌丁卯", "{\"JSYQ\":\"天恩 六合 圣心 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 勾陈\"}");
            put("戌戊辰", "{\"JSYQ\":\"天恩 母仓 不将 益后 解神 青龙\",\"XSYJ\":\"月破 大耗 四击 五墓 九空 往亡 复日\"}");
            put("戌己巳", "{\"JSYQ\":\"阴德 续世 明堂\",\"XSYJ\":\"游祸 天贼 血忌 重日\"}");
            put("戌庚午", "{\"JSYQ\":\"月恩 三合 天喜 天医 天仓 不将 要安 鸣吠\",\"XSYJ\":\"天刑\"}");
            put("戌辛未", "{\"JSYQ\":\"天德合 月德合 母仓 不将 玉宇\",\"XSYJ\":\"河魁 月刑 五虚 地囊 朱雀\"}");
            put("戌壬申", "{\"JSYQ\":\"月空 四相 王日 驿马 天后 时阳 生气 六仪 金堂 除神 金匮 鸣吠\",\"XSYJ\":\"厌对 招摇 五离\"}");
            put("戌癸酉", "{\"JSYQ\":\"四相 官日 除神 宝光 鸣吠\",\"XSYJ\":\"月害 天吏 致死 血支 五离\"}");
            put("戌甲戌", "{\"JSYQ\":\"母仓 守日 天马\",\"XSYJ\":\"月建 小时 土府 白虎 阴位\"}");
            put("戌乙亥", "{\"JSYQ\":\"相日 吉期 五富 敬安 玉堂\",\"XSYJ\":\"劫煞 五虚 土符 重日\"}");
            put("戌丙子", "{\"JSYQ\":\"天德 月德 时德 民日 天巫 福德 普护 鸣吠对\",\"XSYJ\":\"灾煞 天火 大煞 归忌 触水龙 天牢\"}");
            put("戌丁丑", "{\"JSYQ\":\"母仓 福生\",\"XSYJ\":\"天罡 死神 月煞 月虚 元武\"}");
            put("戌戊寅", "{\"JSYQ\":\"阳德 三合 临日 时阴 五合 司命\",\"XSYJ\":\"月厌 地火 死气 九坎 九焦 复日 孤辰\"}");
            put("戌己卯", "{\"JSYQ\":\"天恩 六合 圣心 五合\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 勾陈\"}");
            put("戌庚辰", "{\"JSYQ\":\"天恩 母仓 月恩 不将 益后 解神 青龙\",\"XSYJ\":\"月破 大耗 四击 九空 往亡\"}");
            put("戌辛巳", "{\"JSYQ\":\"天德合 月德合 天恩 阴德 不将 续世 明堂\",\"XSYJ\":\"游祸 天贼 血忌 重日\"}");
            put("戌壬午", "{\"JSYQ\":\"月空 天恩 四相 三合 天喜 天医 天仓 不将 要安 鸣吠\",\"XSYJ\":\"天刑\"}");
            put("戌癸未", "{\"JSYQ\":\"天恩 母仓 四相 不将 玉宇\",\"XSYJ\":\"河魁 月刑 五虚 触水龙 朱雀\"}");
            put("戌甲申", "{\"JSYQ\":\"王日 驿马 天后 时阳 生气 六仪 金堂 除神 金匮 鸣吠\",\"XSYJ\":\"厌对 招摇 五离\"}");
            put("戌乙酉", "{\"JSYQ\":\"官日 除神 宝光 鸣吠\",\"XSYJ\":\"月害 天吏 致死 血支 五离\"}");
            put("戌丙戌", "{\"JSYQ\":\"天德 月德 母仓 守日 天马\",\"XSYJ\":\"月建 小时 土府 白虎\"}");
            put("戌丁亥", "{\"JSYQ\":\"相日 吉期 五富 敬安 玉堂\",\"XSYJ\":\"劫煞 五虚 八风 土符 重日\"}");
            put("戌戊子", "{\"JSYQ\":\"时德 民日 天巫 福德 普护\",\"XSYJ\":\"灾煞 天火 大煞 归忌 复日 天牢\"}");
            put("戌己丑", "{\"JSYQ\":\"母仓 福生\",\"XSYJ\":\"天罡 死神 月煞 月虚 元武\"}");
            put("戌庚寅", "{\"JSYQ\":\"月恩 阳德 三合 临日 时阴 五合 司命 鸣吠对\",\"XSYJ\":\"月厌 地火 死气 九坎 九焦 行狠\"}");
            put("戌辛卯", "{\"JSYQ\":\"天德合 月德合 天愿 六合 不将 圣心 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 勾陈\"}");
            put("戌壬辰", "{\"JSYQ\":\"月空 母仓 四相 不将 益后 解神 青龙\",\"XSYJ\":\"月破 大耗 四击 九空 往亡\"}");
            put("戌癸巳", "{\"JSYQ\":\"四相 阴德 不将 续世 明堂\",\"XSYJ\":\"游祸 天贼 血忌 重日\"}");
            put("戌甲午", "{\"JSYQ\":\"三合 天喜 天医 天仓 要安 鸣吠\",\"XSYJ\":\"天刑\"}");
            put("戌乙未", "{\"JSYQ\":\"母仓 玉宇\",\"XSYJ\":\"河魁 月刑 五虚 朱雀\"}");
            put("戌丙申", "{\"JSYQ\":\"天德 月德 王日 驿马 天后 时阳 生气 六仪 金堂 除神 金匮\",\"XSYJ\":\"厌对 招摇 五离\"}");
            put("戌丁酉", "{\"JSYQ\":\"官日 除神 宝光 鸣吠\",\"XSYJ\":\"月害 天吏 致死 血支 五离\"}");
            put("戌戊戌", "{\"JSYQ\":\"母仓 守日 天马\",\"XSYJ\":\"月建 小时 土府 复日 白虎 小会 孤阳\"}");
            put("戌己亥", "{\"JSYQ\":\"相日 吉期 五富 敬安 玉堂\",\"XSYJ\":\"劫煞 五虚 土符 重日\"}");
            put("戌庚子", "{\"JSYQ\":\"月恩 时德 民日 天巫 福德 普护 鸣吠对\",\"XSYJ\":\"灾煞 天火 四忌 九虎 大煞 归忌 天牢\"}");
            put("戌辛丑", "{\"JSYQ\":\"天德合 月德合 母仓 福德\",\"XSYJ\":\"天罡 死神 月煞 月虚 地囊 元武\"}");
            put("戌壬寅", "{\"JSYQ\":\"月空 四相 阳德 三合 临日 时阴 五合 司命 鸣吠对\",\"XSYJ\":\"月厌 地火 死气 九坎 九焦 了戾\"}");
            put("戌癸卯", "{\"JSYQ\":\"四相 六合 不将 圣心 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 小耗 五虚 勾陈\"}");
            put("戌甲辰", "{\"JSYQ\":\"母仓 益后 解神 青龙\",\"XSYJ\":\"月破 大耗 四击 九空 往亡\"}");
            put("戌乙巳", "{\"JSYQ\":\"阴德 续世 明堂\",\"XSYJ\":\"游祸 天贼 血忌 重日\"}");
            put("戌丙午", "{\"JSYQ\":\"天德 月德 三合 天喜 天医 天仓 要安 鸣吠\",\"XSYJ\":\"天刑\"}");
            put("戌丁未", "{\"JSYQ\":\"母仓 玉宇\",\"XSYJ\":\"河魁 月刑 五虚 八风 八专 朱雀\"}");
            put("戌戊申", "{\"JSYQ\":\"天赦 王日 驿马 天后 时阳 生气 六仪 金堂 除神 金匮\",\"XSYJ\":\"厌对 招摇 复日 五离\"}");
            put("戌己酉", "{\"JSYQ\":\"天恩 官日 除神 宝光 鸣吠\",\"XSYJ\":\"月害 天吏 致死 血支 五离\"}");
            put("戌庚戌", "{\"JSYQ\":\"天恩 母仓 月德 守日 天马\",\"XSYJ\":\"月建 小时 土府 白虎 阳错\"}");
            put("戌辛亥", "{\"JSYQ\":\"天德合 月德合 天恩 相日 吉期 五富 敬安 玉堂\",\"XSYJ\":\"劫煞 四穷 九虎 五虚 土符 重日\"}");
            put("戌壬子", "{\"JSYQ\":\"月空 天恩 四相 时德 民日 天巫 福德 普护 鸣吠对\",\"XSYJ\":\"灾煞 天火 大煞 归忌 天牢\"}");
            put("戌癸丑", "{\"JSYQ\":\"天恩 母仓 四相 福生\",\"XSYJ\":\"天罡 死神 月煞 月虚 八专 触水龙 元武\"}");
            put("戌甲寅", "{\"JSYQ\":\"阳德 三合 临日 时阴 五合 司命 鸣吠对\",\"XSYJ\":\"月厌 地火 死气 四废 九坎 九焦 八专 孤辰 阴错\"}");
            put("戌乙卯", "{\"JSYQ\":\"六合 圣心 五合 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 小耗 四废 五虚 勾陈\"}");
            put("戌丙辰", "{\"JSYQ\":\"天德 月德 母仓 益后 解神 青龙\",\"XSYJ\":\"月破 大耗 四击 九空 往亡\"}");
            put("戌丁巳", "{\"JSYQ\":\"阴德 续世 明堂\",\"XSYJ\":\"游祸 天贼 血忌 重日\"}");
            put("戌戊午", "{\"JSYQ\":\"三合 天喜 天医 天仓 不将 要安\",\"XSYJ\":\"四耗 复日 天刑\"}");
            put("戌己未", "{\"JSYQ\":\"母仓 玉宇\",\"XSYJ\":\"河魁 月刑 五虚 八专 朱雀\"}");
            put("戌庚申", "{\"JSYQ\":\"月恩 王日 驿马 天后 时阳 生气 六仪 金堂 除神 金匮 鸣吠\",\"XSYJ\":\"厌对 招摇 五离 八专\"}");
            put("戌辛酉", "{\"JSYQ\":\"天德合 月德合 官日 除神 宝光 鸣吠\",\"XSYJ\":\"月害 天吏 致死 血支 五离\"}");
            put("戌壬戌", "{\"JSYQ\":\"月空 母仓 四相 守日 天马\",\"XSYJ\":\"月建 小时 土府 白虎\"}");
            put("戌癸亥", "{\"JSYQ\":\"四相 相日 吉期 五富 敬安 玉堂\",\"XSYJ\":\"劫煞 五虚 土符 重日\"}");
            put("亥甲子", "{\"JSYQ\":\"月德 天恩 天赦 四相 官日 天马 吉期 要安\",\"XSYJ\":\"大时 大败 咸池 白虎\"}");
            put("亥乙丑", "{\"JSYQ\":\"天德 天恩 月恩 四相 守日 天巫 福德 玉宇 玉堂\",\"XSYJ\":\"月厌 地火 九空 大煞 归忌 孤辰\"}");
            put("亥丙寅", "{\"JSYQ\":\"天恩 时德 相日 六合 五富 金堂 五合 鸣吠对\",\"XSYJ\":\"河魁 死神 游祸 五虚 天牢\"}");
            put("亥丁卯", "{\"JSYQ\":\"天恩 阴德 民日 三合 时阴 五合 鸣吠对\",\"XSYJ\":\"死气 元武\"}");
            put("亥戊辰", "{\"JSYQ\":\"天恩 阳德 解神 司命\",\"XSYJ\":\"小耗 天贼 土符\"}");
            put("亥己巳", "{\"JSYQ\":\"月德合 驿马 天后 天仓 不将 敬安\",\"XSYJ\":\"月破 大耗 重日 勾陈\"}");
            put("亥庚午", "{\"JSYQ\":\"天德合 月空 不将 普护 青龙 鸣吠\",\"XSYJ\":\"天吏 致死 五虚\"}");
            put("亥辛未", "{\"JSYQ\":\"三合 临日 天喜 天医 六仪 福生 明堂\",\"XSYJ\":\"厌对 招摇 四击 往亡\"}");
            put("亥壬申", "{\"JSYQ\":\"母仓 除神 鸣吠\",\"XSYJ\":\"天罡 劫煞 月害 复日 五离 天刑\"}");
            put("亥癸酉", "{\"JSYQ\":\"母仓 时阳 生气 圣心 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 五离 朱雀\"}");
            put("亥甲戌", "{\"JSYQ\":\"月德 四相 益后 金匮\",\"XSYJ\":\"月煞 月虚 血支 五虚 八风\"}");
            put("亥乙亥", "{\"JSYQ\":\"天德 月德 四相 王日 续世 宝光\",\"XSYJ\":\"月建 小时 土府 月刑 九坎 九焦 血支 重日\"}");
            put("亥丙子", "{\"JSYQ\":\"官日 天马 吉期 要安 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 触水龙 白虎\"}");
            put("亥丁丑", "{\"JSYQ\":\"守日 天巫 福德 玉宇 玉堂\",\"XSYJ\":\"月厌 地火 九空 大煞 归忌 孤辰\"}");
            put("亥戊寅", "{\"JSYQ\":\"时德 相日 六合 五富 金堂 五合\",\"XSYJ\":\"河魁 死神 游祸 五虚 地囊 天牢\"}");
            put("亥己卯", "{\"JSYQ\":\"月德合 天德 阴德 民日 三合 时阴 不将 五合\",\"XSYJ\":\"死气 元武\"}");
            put("亥庚辰", "{\"JSYQ\":\"天德合 月空 天恩 阳德 不将 解神 司命\",\"XSYJ\":\"小耗 天贼 土符\"}");
            put("亥辛巳", "{\"JSYQ\":\"天恩 驿马 天后 天仓 不将 敬安\",\"XSYJ\":\"月破 大耗 重日 勾陈\"}");
            put("亥壬午", "{\"JSYQ\":\"天恩 不将 普护 青龙 鸣吠\",\"XSYJ\":\"天吏 致死 五虚 复日\"}");
            put("亥癸未", "{\"JSYQ\":\"天恩 三合 临日 天喜 天医 六仪 福生 明堂\",\"XSYJ\":\"厌对 招摇 四击 往亡 触水龙\"}");
            put("亥甲申", "{\"JSYQ\":\"月德 母仓 四相 除神 鸣吠\",\"XSYJ\":\"天罡 劫煞 月害 五离 天刑\"}");
            put("亥乙酉", "{\"JSYQ\":\"天德 母仓 月恩 四相 时阳 生气 圣心 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 五离 朱雀\"}");
            put("亥丙戌", "{\"JSYQ\":\"益后 金匮\",\"XSYJ\":\"月煞 月虚 血支 五虚\"}");
            put("亥丁亥", "{\"JSYQ\":\"王日 续世 宝光\",\"XSYJ\":\"月建 小时 土府 月刑 九坎 九焦 血忌 重日\"}");
            put("亥戊子", "{\"JSYQ\":\"官日 天马 吉期 要安\",\"XSYJ\":\"大时 大败 咸池 白虎 岁薄\"}");
            put("亥己丑", "{\"JSYQ\":\"月德合 月空 时德 相日 六合 五富 不将 金堂 五合 鸣吠对\",\"XSYJ\":\"河魁 死神 游祸 五虚 天牢\"}");
            put("亥庚寅", "{\"JSYQ\":\"天德合 月空 时德 相日 六合 五富 不将 金堂 五合 鸣吠对\",\"XSYJ\":\"河魁 死神 游祸 五虚 天牢\"}");
            put("亥辛卯", "{\"JSYQ\":\"阴德 民日 三合 时阴 不将 五合 鸣吠对\",\"XSYJ\":\"死气 元武\"}");
            put("亥壬辰", "{\"JSYQ\":\"阳德 不将 解神 司命\",\"XSYJ\":\"小耗 天贼 五墓 土符 复日\"}");
            put("亥癸巳", "{\"JSYQ\":\"驿马 天后 天仓 不将 敬安\",\"XSYJ\":\"月破 大耗 重日 勾陈\"}");
            put("亥甲午", "{\"JSYQ\":\"月德 四相 普护 青龙 鸣吠\",\"XSYJ\":\"天吏 致死 五虚\"}");
            put("亥乙未", "{\"JSYQ\":\"天德 月恩 四相 三合 临日 天喜 天医 六仪 福生 明堂\",\"XSYJ\":\"厌对 招摇 四击 往亡\"}");
            put("亥丙申", "{\"JSYQ\":\"母仓 除神 鸣吠\",\"XSYJ\":\"天罡 劫煞 月害 五离 天刑\"}");
            put("亥丁酉", "{\"JSYQ\":\"母仓 时阳 生气 圣心 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 五离 朱雀\"}");
            put("亥戊戌", "{\"JSYQ\":\"益后 金匮\",\"XSYJ\":\"月煞 月虚 血支 五虚 绝阳\"}");
            put("亥己亥", "{\"JSYQ\":\"月德合 王日 续世 宝光\",\"XSYJ\":\"月建 小时 土府 月刑 九坎 九焦 血忌 重日 小会 纯阴\"}");
            put("亥庚子", "{\"JSYQ\":\"天德合 月空 官日 天马 吉期 要安 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 白虎\"}");
            put("亥辛丑", "{\"JSYQ\":\"守日 天巫 福德 玉宇 玉堂\",\"XSYJ\":\"月厌 地火 九空 大煞 归忌 行狠\"}");
            put("亥壬寅", "{\"JSYQ\":\"天愿 时德 相日 六合 五富 不将 金堂 五合 鸣吠对\",\"XSYJ\":\"河魁 死神 游祸 五虚 复日 天牢\"}");
            put("亥癸卯", "{\"JSYQ\":\"阴德 民日 三合 时阴 不将 五合 鸣吠对\",\"XSYJ\":\"死气 元武\"}");
            put("亥甲辰", "{\"JSYQ\":\"月德 四相 阳德 解神 司命\",\"XSYJ\":\"小耗 天贼 土符\"}");
            put("亥乙巳", "{\"JSYQ\":\"天德 月恩 四相 驿马 天后 天仓 敬安\",\"XSYJ\":\"月破 大耗 重日 勾陈\"}");
            put("亥丙午", "{\"JSYQ\":\"普护 青龙 鸣吠\",\"XSYJ\":\"天吏 致死 四废 五虚\"}");
            put("亥丁未", "{\"JSYQ\":\"三合 临日 天喜 天医 六仪 福生 明堂\",\"XSYJ\":\"厌对 招摇 四击 往亡 八专\"}");
            put("亥戊申", "{\"JSYQ\":\"母仓 除神\",\"XSYJ\":\"天罡 劫煞 月害 地囊 五离 天刑\"}");
            put("亥己酉", "{\"JSYQ\":\"月德 天恩 母仓 时阳 生气 圣心 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 五离 朱雀\"}");
            put("亥庚戌", "{\"JSYQ\":\"天德合 月空 天恩 益后 金匮\",\"XSYJ\":\"月煞 月虚 血支 五虚\"}");
            put("亥辛亥", "{\"JSYQ\":\"天恩 王日 续世 宝光\",\"XSYJ\":\"月建 小时 土府 月刑 九坎 九焦 血忌 重日\"}");
            put("亥壬子", "{\"JSYQ\":\"天恩 官日 天马 吉期 要安 鸣吠对\",\"XSYJ\":\"大时 大败 咸池 四忌 六蛇 复日 白虎 岁薄\"}");
            put("亥癸丑", "{\"JSYQ\":\"天恩 守日 天巫 福德 玉宇 玉堂\",\"XSYJ\":\"月厌 地火 九空 大煞 归忌 八专 触水龙 了戾 阴错\"}");
            put("亥甲寅", "{\"JSYQ\":\"月德 四相 时德 相日 六合 五富 金堂 五合 鸣吠对\",\"XSYJ\":\"河魁 死神 游祸 五虚 八风 八专 天牢\"}");
            put("亥乙卯", "{\"JSYQ\":\"天德 月恩 四相 阳德 民日 三合 时阴 五合 鸣吠对\",\"XSYJ\":\"死气 元武\"}");
            put("亥丙辰", "{\"JSYQ\":\"阳德 解神 司命\",\"XSYJ\":\"小耗 天贼 土符\"}");
            put("亥丁巳", "{\"JSYQ\":\"驿马 天后 天仓 敬安\",\"XSYJ\":\"月破 大耗 四废 重日 勾陈 阴阳交破\"}");
            put("亥戊午", "{\"JSYQ\":\"普护 青龙\",\"XSYJ\":\"天吏 致死 五虚\"}");
            put("亥己未", "{\"JSYQ\":\"月德合 三合 临日 天喜 天医 六仪 福生 明堂\",\"XSYJ\":\"厌对 招摇 四击 往亡 八专\"}");
            put("亥庚申", "{\"JSYQ\":\"天德合 月空 母仓 阴神 鸣吠\",\"XSYJ\":\"天罡 劫煞 月害 五离 八专 天刑\"}");
            put("亥辛酉", "{\"JSYQ\":\"母仓 时阳 生气 圣心 除神 鸣吠\",\"XSYJ\":\"灾煞 天火 四耗 五离 朱雀\"}");
            put("亥壬戌", "{\"JSYQ\":\"益后 金匮\",\"XSYJ\":\"月煞 月虚 血支 五虚 复日\"}");
            put("亥癸亥", "{\"JSYQ\":\"王日 续世 宝光\",\"XSYJ\":\"月建 小时 土府 月刑 四穷 六蛇 九坎 九焦 血忌 重日 阳错\"}");
            put("子甲子", "{\"JSYQ\":\"天恩 天赦 月恩 四相 官日 敬安 金匮\",\"XSYJ\":\"月建 小时 土府 月厌 地火\"}");
            put("子乙丑", "{\"JSYQ\":\"天恩 四相 阴德 守日 吉期\",\"XSYJ\":\"六合 普护 宝光\"}");
            put("子丙寅", "{\"JSYQ\":\"月空 天恩 时德 相日 驿马 天后 天马 天巫 福德 福生 五合 鸣吠对\",\"XSYJ\":\"五虚 归忌 白虎\"}");
            put("子丁卯", "{\"JSYQ\":\"月德合 天恩 民日 不将 五合 玉堂 鸣吠对\",\"XSYJ\":\"天罡 死神 致死 天贼\"}");
            put("子戊辰", "{\"JSYQ\":\"天恩 三合 临日 时阴 天仓 圣心\",\"XSYJ\":\"死气 天牢\"}");
            put("子己巳", "{\"JSYQ\":\"五富 不将 益后\",\"XSYJ\":\"劫煞 小耗 重日 元武\"}");
            put("子庚午", "{\"JSYQ\":\"五富 六仪 续世 解神 司命 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚 血忌\"}");
            put("子辛未", "{\"JSYQ\":\"要安\",\"XSYJ\":\"月煞 月虚 月害 四击 勾陈\"}");
            put("子壬申", "{\"JSYQ\":\"月德 母仓 三合 天喜 天医 玉宇 除神 青龙 鸣吠\",\"XSYJ\":\"九坎 九焦 土符 大煞 五离\"}");
            put("子癸酉", "{\"JSYQ\":\"母仓 金堂 除神 明堂 鸣吠\",\"XSYJ\":\"河魁 大时 大败 咸池 复日 五离\"}");
            put("子甲戌", "{\"JSYQ\":\"月恩 四相 时阳 生气\",\"XSYJ\":\"五虚 八风 九空 往亡 天刑\"}");
            put("子乙亥", "{\"JSYQ\":\"四相 王日\",\"XSYJ\":\"游祸 血支 重日 朱雀\"}");
            put("子丙子", "{\"JSYQ\":\"月空 官日 敬安 金匮 鸣吠对\",\"XSYJ\":\"月建 小时 土府 月厌 地火 触水龙\"}");
            put("子丁丑", "{\"JSYQ\":\"月德合 阴德 守日 吉期\",\"XSYJ\":\"六合 不将 普护 宝光\"}");
            put("子戊寅", "{\"JSYQ\":\"时德 相日 驿马 天后 天马 天巫 福德 福生 五合\",\"XSYJ\":\"五虚 归忌 白虎\"}");
            put("子己卯", "{\"JSYQ\":\"天恩 民日 不将 五合 玉堂\",\"XSYJ\":\"天罡 死神 月刑 天吏 致死 天贼\"}");
            put("子庚辰", "{\"JSYQ\":\"天恩 三合 临日 时阴 天仓 不将 圣心\",\"XSYJ\":\"死气 天牢\"}");
            put("子辛巳", "{\"JSYQ\":\"天恩 五富 不将 益后\",\"XSYJ\":\"劫煞 小耗 重日 元武\"}");
            put("子壬午", "{\"JSYQ\":\"月德 天恩 阳德 六仪 续世 解神 司命 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚 血忌\"}");
            put("子癸未", "{\"JSYQ\":\"天恩 要安\",\"XSYJ\":\"月煞 月虚 月害 四击 复日 触水龙 勾陈\"}");
            put("子甲申", "{\"JSYQ\":\"母仓 月恩 四相 三合 天喜 天医 玉宇 除神 青龙 鸣吠\",\"XSYJ\":\"九坎 九焦 土符 大煞 五离\"}");
            put("子乙酉", "{\"JSYQ\":\"母仓 四相 金堂 除神 明堂 鸣吠\",\"XSYJ\":\"河魁 大时 大败 咸池 五离\"}");
            put("子丙戌", "{\"JSYQ\":\"月空 时阳 生气\",\"XSYJ\":\"五虚 九空 往亡 天刑\"}");
            put("子丁亥", "{\"JSYQ\":\"月德合 王日\",\"XSYJ\":\"游祸 血支 重日 朱雀\"}");
            put("子戊子", "{\"JSYQ\":\"官日 敬安 金匮\",\"XSYJ\":\"月建 小耗 土府 月厌 地火 小会\"}");
            put("子己丑", "{\"JSYQ\":\"阴德 守日 吉期\",\"XSYJ\":\"六合 不将 普护 宝光\"}");
            put("子庚寅", "{\"JSYQ\":\"时德 相日 驿马 天后 天马 天巫 福德 不将 福生 五合 鸣吠对\",\"XSYJ\":\"五虚 归忌 白虎\"}");
            put("子辛卯", "{\"JSYQ\":\"民日 不将 五合 玉堂 鸣吠对\",\"XSYJ\":\"天罡 死神 月刑 天吏 致死 天贼 地囊\"}");
            put("子壬辰", "{\"JSYQ\":\"月德 三合 临日 时阴 天仓 不将 圣心\",\"XSYJ\":\"死气 五墓 天牢\"}");
            put("子癸巳", "{\"JSYQ\":\"五富 益后\",\"XSYJ\":\"劫煞 小耗 复日 重日 元武\"}");
            put("子甲午", "{\"JSYQ\":\"月恩 四相 阳德 六仪 续世 解除 司命 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚 血忌\"}");
            put("子乙未", "{\"JSYQ\":\"四相 要安\",\"XSYJ\":\"月煞 月虚 月害 四击 勾陈\"}");
            put("子丙申", "{\"JSYQ\":\"月空 母仓 三合 天喜 天医 玉宇 除神 青龙 鸣吠\",\"XSYJ\":\"九坎 九焦 土符 大煞 五离\"}");
            put("子丁酉", "{\"JSYQ\":\"月德合 母仓 金堂 除神 明堂 鸣吠\",\"XSYJ\":\"河魁 大时 大败 咸池 五离\"}");
            put("子戊戌", "{\"JSYQ\":\"时阳 生气\",\"XSYJ\":\"五虚 九空 往亡 天刑\"}");
            put("子己亥", "{\"JSYQ\":\"王日\",\"XSYJ\":\"游祸 血支 重日 朱雀\"}");
            put("子庚子", "{\"JSYQ\":\"官日 敬安 金匮 鸣吠对\",\"XSYJ\":\"月建 小时 土符 月厌 地火\"}");
            put("子辛丑", "{\"JSYQ\":\"阴德 守日 吉期 六合 不将 普护 宝光\",\"XSYJ\":\"\"}");
            put("子壬寅", "{\"JSYQ\":\"月德 时德 相日 驿马 天后 天马 天巫 福德 不将 福生 五合 鸣吠对\",\"XSYJ\":\"五虚 归忌 白虎\"}");
            put("子癸卯", "{\"JSYQ\":\"民日 五合 玉堂 鸣吠对\",\"XSYJ\":\"天罡 死神 月刑 天吏 致死 天贼 复日\"}");
            put("子甲辰", "{\"JSYQ\":\"月恩 四相 三合 临日 时阴 天仓 圣心\",\"XSYJ\":\"死气 天牢\"}");
            put("子乙巳", "{\"JSYQ\":\"四相 五富 益后\",\"XSYJ\":\"劫煞 小耗 重日 元武\"}");
            put("子丙午", "{\"JSYQ\":\"月空 阳德 六仪 续世 解神 司命 鸣吠\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 四废 五虚 血忌 阴阳击冲\"}");
            put("子丁未", "{\"JSYQ\":\"月德合 要安\",\"XSYJ\":\"月煞 月虚 月害 四击 八专 勾陈\"}");
            put("子戊申", "{\"JSYQ\":\"母仓 三合 天喜 天医 玉宇 除神 青龙\",\"XSYJ\":\"九坎 九焦 土符 大煞 五离\"}");
            put("子己酉", "{\"JSYQ\":\"天恩 母仓 金堂 除神 明堂 鸣吠\",\"XSYJ\":\"河魁 大时 大败 咸池 五离\"}");
            put("子庚戌", "{\"JSYQ\":\"天恩 时阳 生气\",\"XSYJ\":\"五虚 九空 往亡 天刑\"}");
            put("子辛亥", "{\"JSYQ\":\"天恩 王日\",\"XSYJ\":\"游祸 血支 重日 朱雀\"}");
            put("子壬子", "{\"JSYQ\":\"月德 天恩 官日 敬安 金匮 鸣吠对\",\"XSYJ\":\"月建 小时 土府 月厌 地火 四忌 六蛇 大会 阴阳俱错\"}");
            put("子癸丑", "{\"JSYQ\":\"天恩 天愿 阴德 守日 吉期 六合 普护 宝光\",\"XSYJ\":\"复日 八专 触水龙\"}");
            put("子甲寅", "{\"JSYQ\":\"月恩 四相 时德 相日 驿马 天后 天马 天巫 福德 福生 五合 鸣吠对\",\"XSYJ\":\"五虚 八风 归忌 八专 白虎\"}");
            put("子乙卯", "{\"JSYQ\":\"四相 民日 五合 玉堂 鸣吠对\",\"XSYJ\":\"天罡 死神 月刑 天吏 致死 天贼\"}");
            put("子丙辰", "{\"JSYQ\":\"月空 三合 临日 时阴 天仓 圣心\",\"XSYJ\":\"死气 天牢\"}");
            put("子丁巳", "{\"JSYQ\":\"月德合 五富 不将 益后\",\"XSYJ\":\"劫煞 小耗 四废 重日 元武\"}");
            put("子戊午", "{\"JSYQ\":\"阳德 六仪 续世 解神 司命\",\"XSYJ\":\"月破 大耗 灾煞 天火 厌对 招摇 五虚 血忌\"}");
            put("子己未", "{\"JSYQ\":\"要安\",\"XSYJ\":\"月煞 月虚 月害 四击 八专 勾陈\"}");
            put("子庚申", "{\"JSYQ\":\"母仓 三合 天喜 天医 玉宇 除神 青龙 鸣吠\",\"XSYJ\":\"九坎 九焦 土符 大煞 五离 八专\"}");
            put("子辛酉", "{\"JSYQ\":\"母仓 金堂 除神 明堂 鸣吠\",\"XSYJ\":\"河魁 大时 大败 咸池 四耗 地囊 五离\"}");
            put("子壬戌", "{\"JSYQ\":\"月德 时阳 生气\",\"XSYJ\":\"五虚 九空 往亡 天刑\"}");
            put("子癸亥", "{\"JSYQ\":\"王日\",\"XSYJ\":\"游祸 血支 四穷 六蛇 复日 重日 朱雀\"}");
            put("丑甲子", "{\"JSYQ\":\"月空 天恩 天赦 天愿 四相 官日 六合 续世\",\"XSYJ\":\"天吏 致死 血支 土符 归忌 血忌 天刑\"}");
            put("丑乙丑", "{\"JSYQ\":\"天德合 月德合 天恩 四相 守日 要安\",\"XSYJ\":\"月建 小时 土府 往亡 朱雀\"}");
            put("丑丙寅", "{\"JSYQ\":\"天恩 月德 相日 吉期 不将 玉宇 五合 金匮 鸣吠对\",\"XSYJ\":\"劫煞 天贼 五虚\"}");
            put("丑丁卯", "{\"JSYQ\":\"天恩 民日 天巫 福德 天仓 不将 金匮 五合 宝光 鸣吠对\",\"XSYJ\":\"灾煞 天火\"}");
            put("丑戊辰", "{\"JSYQ\":\"天恩 天马\",\"XSYJ\":\"河魁 死神 月煞 月虚 五墓 白虎\"}");
            put("丑己巳", "{\"JSYQ\":\"三合 时阴 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 死气 九坎 九焦 复日 重日\"}");
            put("丑庚午", "{\"JSYQ\":\"天德 月德 敬安 解神 鸣吠\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 天牢\"}");
            put("丑辛未", "{\"JSYQ\":\"月恩 普护\",\"XSYJ\":\"月破 大耗 四击 九空 元武\"}");
            put("丑壬申", "{\"JSYQ\":\"母仓 阳德 五富 福生 除神 司命 鸣吠\",\"XSYJ\":\"游祸 五离\"}");
            put("丑癸酉", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医 除神 鸣吠\",\"XSYJ\":\"地囊 大煞 五离 勾陈\"}");
            put("丑甲戌", "{\"JSYQ\":\"月空 四相 圣心 青龙\",\"XSYJ\":\"天罡 月刑 五虚 八风\"}");
            put("丑乙亥", "{\"JSYQ\":\"天德合 月德合 四相 阴德 王日 驿马 天后 时阳 生气 益后 明堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("丑丙子", "{\"JSYQ\":\"官日 六合 不将 续世 鸣吠对\",\"XSYJ\":\"天吏 致死 血支 土符 归忌 血忌 触水龙 天刑\"}");
            put("丑丁丑", "{\"JSYQ\":\"守日 不将 要安\",\"XSYJ\":\"月建 小时 土府 往亡 朱雀\"}");
            put("丑戊寅", "{\"JSYQ\":\"时德 相日 吉期 玉堂 五合 金匮\",\"XSYJ\":\"劫煞 天贼 五虚\"}");
            put("丑己卯", "{\"JSYQ\":\"天恩 民日 天巫 福德 天仓 不将 金堂 五合 宝光\",\"XSYJ\":\"灾煞 天火 复日\"}");
            put("丑庚辰", "{\"JSYQ\":\"天德 月德 天恩 天马 不将\",\"XSYJ\":\"河魁 死神 月煞 月虚 白虎\"}");
            put("丑辛巳", "{\"JSYQ\":\"天恩 月恩 三合 时阴 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 死气 九坎 九焦 重日\"}");
            put("丑壬午", "{\"JSYQ\":\"天恩 敬安 解神 鸣吠\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 天牢\"}");
            put("丑癸未", "{\"JSYQ\":\"天恩 普护\",\"XSYJ\":\"月破 大耗 四击 九空 触水龙 元武\"}");
            put("丑甲申", "{\"JSYQ\":\"月空 母仓 四相 阳德 五富 生气 除神 司命 鸣吠\",\"XSYJ\":\"游祸 五离\"}");
            put("丑乙酉", "{\"JSYQ\":\"天德合 月德合 母仓 四相 三合 临日 天喜 天医 除神 鸣吠\",\"XSYJ\":\"大煞 五离 勾陈\"}");
            put("丑丙戌", "{\"JSYQ\":\"圣心 青龙\",\"XSYJ\":\"天罡 月刑 五虚\"}");
            put("丑丁亥", "{\"JSYQ\":\"阴德 王日 驿马 天后 时阴 生气 益后 明堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("丑戊子", "{\"JSYQ\":\"官日 六合 续世\",\"XSYJ\":\"天吏 致死 血支 土符 归忌 血忌 天刑 逐阵\"}");
            put("丑己丑", "{\"JSYQ\":\"守日 不将 要安\",\"XSYJ\":\"月建 小时 土府 往亡 复日 朱雀\"}");
            put("丑庚寅", "{\"JSYQ\":\"天德 月德 时德 相日 吉期 不将 玉宇 五合 金匮\",\"XSYJ\":\"劫煞 天贼 五虚\"}");
            put("丑辛卯", "{\"JSYQ\":\"月恩 民日 天巫 福德 天仓 不将 金堂 五合 宝光 鸣吠对\",\"XSYJ\":\"灾煞 天火\"}");
            put("丑壬辰", "{\"JSYQ\":\"天马\",\"XSYJ\":\"河魁 死神 月煞 月虚 白虎\"}");
            put("丑癸巳", "{\"JSYQ\":\"三合 阴德 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 死气 九坎 九焦 重日\"}");
            put("丑甲午", "{\"JSYQ\":\"月空 四相 敬安 解神 鸣吠\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 天牢\"}");
            put("丑乙未", "{\"JSYQ\":\"天德合 月德合 四相 普护\",\"XSYJ\":\"月破 大耗 四击 九空 元武\"}");
            put("丑丙申", "{\"JSYQ\":\"母仓 阳德 五富 福生 除神 司命 鸣吠\",\"XSYJ\":\"游祸 五离\"}");
            put("丑丁酉", "{\"JSYQ\":\"母仓 三合 临日 天喜 天医 除神 鸣吠\",\"XSYJ\":\"大煞 五离 勾陈\"}");
            put("丑戊戌", "{\"JSYQ\":\"圣心 青龙\",\"XSYJ\":\"天罡 月刑 五虚\"}");
            put("丑己亥", "{\"JSYQ\":\"阴德 王日 驿马 天后 时阳 生气 益后 明堂\",\"XSYJ\":\"月厌 地火 复日 重日\"}");
            put("丑庚子", "{\"JSYQ\":\"天德 月德 官日 六合 不将 续世 鸣吠对\",\"XSYJ\":\"天吏 致死 血支 土符 归忌 血忌 天刑\"}");
            put("丑辛丑", "{\"JSYQ\":\"月恩 守日 不将 要安\",\"XSYJ\":\"月建 小时 土府 往亡 朱雀\"}");
            put("丑壬寅", "{\"JSYQ\":\"时德 相日 吉期 玉宇 五合 金匮 鸣吠对\",\"XSYJ\":\"劫煞 天贼 五虚\"}");
            put("丑癸卯", "{\"JSYQ\":\"民日 天巫 福德 天仓 金堂 五合 宝光 鸣吠对\",\"XSYJ\":\"灾煞 天火\"}");
            put("丑甲辰", "{\"JSYQ\":\"月空 四相 天马\",\"XSYJ\":\"河魁 致死 月煞 月虚 白虎\"}");
            put("丑乙巳", "{\"JSYQ\":\"天德合 月德合 四相 三合 时阴 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 死气 九坎 九焦 重日\"}");
            put("丑丙午", "{\"JSYQ\":\"敬安 解神 鸣吠\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 四废 五虚 天牢\"}");
            put("丑丁未", "{\"JSYQ\":\"普护\",\"XSYJ\":\"月破 大耗 四击 九空 八专 元武 阳破阴冲\"}");
            put("丑戊申", "{\"JSYQ\":\"母仓 阳德 五富 福生 除神 司命\",\"XSYJ\":\"游祸 五离\"}");
            put("丑己酉", "{\"JSYQ\":\"天恩 母仓 三合 临日 天喜 天医 除神 鸣吠\",\"XSYJ\":\"大煞 复日 五离 勾陈\"}");
            put("丑庚戌", "{\"JSYQ\":\"天德 月德 天恩 圣心 青龙\",\"XSYJ\":\"天罡 月刑 五虚\"}");
            put("丑辛亥", "{\"JSYQ\":\"天恩 月恩 阴德 王日 驿马 天后 时阳 生气 益后 明堂\",\"XSYJ\":\"月厌 地火 重日\"}");
            put("丑壬子", "{\"JSYQ\":\"天恩 官日 六合 续世\",\"XSYJ\":\"天吏 致死 血支 四忌 六蛇 土符 归忌 血忌 天刑 逐阵\"}");
            put("丑癸丑", "{\"JSYQ\":\"天恩 守日 要安\",\"XSYJ\":\"月建 小时 土府 往亡 八专 触水龙 朱雀 阳错\"}");
            put("丑甲寅", "{\"JSYQ\":\"月空 四相 时德 相日 吉期 玉宇 五合 金匮 鸣吠对\",\"XSYJ\":\"劫煞 天贼 五虚 八风 八专\"}");
            put("丑乙卯", "{\"JSYQ\":\"天德合 月德合 四相 民日 天巫 福德 天仓 金堂 五合 宝光 鸣吠对\",\"XSYJ\":\"灾煞 天火 地囊\"}");
            put("丑丙辰", "{\"JSYQ\":\"天马 不将\",\"XSYJ\":\"河魁 死神 月煞 月虚 白虎\"}");
            put("丑丁巳", "{\"JSYQ\":\"三合 时阴 六仪 玉堂\",\"XSYJ\":\"厌对 招摇 死气 四废 九坎 九焦 重日\"}");
            put("丑戊午", "{\"JSYQ\":\"敬安 解神\",\"XSYJ\":\"月害 大时 大败 咸池 小耗 五虚 天牢\"}");
            put("丑己未", "{\"JSYQ\":\"普护\",\"XSYJ\":\"月破 大耗 四击 九空 复日 八专 元武\"}");
            put("丑庚申", "{\"JSYQ\":\"天德 月德 母仓 阳德 五富 福生 除神 司命 鸣吠\",\"XSYJ\":\"游祸 五离 八专\"}");
            put("丑辛酉", "{\"JSYQ\":\"母仓 月恩 三合 临日 天喜 天医 除神 鸣吠\",\"XSYJ\":\"四耗 大煞 五离 勾陈\"}");
            put("丑壬戌", "{\"JSYQ\":\"圣心 青龙\",\"XSYJ\":\"天罡 月刑 五虚\"}");
            put("丑癸亥", "{\"JSYQ\":\"阴德 王日 驿马 天后 时阳 生气 益后 明堂\",\"XSYJ\":\"月厌 地火 四穷 六蛇 重日 大会 阴错\"}");
        }
    };
    public static final JSONObject YJ_DATA = new JSONObject() {
        @Serial
        private static final long serialVersionUID = 1L;

        {
            put("0-0", "{\"y\":\"嫁娶 会亲友 出行 立券 交易 纳财 开市 动土 祈福 祭祀 掘井 开光 求嗣\",\"j\":\"入宅 纳畜 安葬 造畜稠 作灶 伐木 作梁\"}");
            put("0-1", "{\"y\":\"嫁娶 解除 移徙 纳采 入宅 裁衣 订盟 动土 祈福 纳畜 盖屋 安门 祭祀 牧养 修造 拆卸 起基 安香 酬神 出火 伐木 开光 求嗣 上梁 竖柱 塑绘 斋醮 定磉\",\"j\":\"栽种 安葬\"}");
            put("0-2", "{\"y\":\"嫁娶 出行 解除 纳采 立券 交易 置产 开市 订盟 动土 栽种 安床 挂匾 修造 拆卸 安香 出火 开光\",\"j\":\"安葬 祭祀 作灶 入殓\"}");
            put("0-3", "{\"y\":\"纳采 立券 交易 订盟 动土 祭祀 破土\",\"j\":\"嫁娶 安葬\"}");
            put("0-4", "{\"y\":\"嫁娶 出行 解除 纳采 订盟 动土 祈福 栽种 安床 造车器 祭祀 修造 拆卸 冠笄 出火 伐木 开光 破土 求嗣 上梁\",\"j\":\"置产 入宅 安葬 行丧\"}");
            put("0-5", "{\"y\":\"嫁娶 移徙 立券 入宅 开市 动土 祈福 祭祀\",\"j\":\"安葬 造庙\"}");
            put("0-6", "{\"y\":\"嫁娶 出行 理发 纳采 订盟 动土 栽种 安床 祭祀 放水 进人口 开光 开渠\",\"j\":\"入宅 纳畜 盖屋 安葬 安门 作灶 入殓 探病 伐木 上梁\"}");
            put("0-7", "{\"y\":\"诸事不宜\",\"j\":\"交易 开市 安葬 入殓\"}");
            put("0-8", "{\"y\":\"嫁娶 出行 扫舍 入学 置产 出货财 动土 祈福 栽种 开仓 祭祀 牧养 求医 治病 开生坟 起基 开光 立碑 破土 求嗣 上梁 竖柱 谢土 斋醮\",\"j\":\"入宅 裁衣 安床 安葬 安门\"}");
            put("0-9", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("0-10", "{\"y\":\"解除 纳采 置产 订盟 动土 祈福 栽种 安床 纳畜 安门 祭祀 修造 造畜稠 拆卸 移柩 掘井 开池 立碑 破土 求嗣 上梁 竖柱 塑绘\",\"j\":\"嫁娶 出行 移徙 入宅 开市 赴任 安葬 入殓 出火 进人口\"}");
            put("0-11", "{\"y\":\"出行 纳采 立券 开市 裁衣 订盟 祈福 安机械 沐浴 纳畜 祭祀 安碓磑 斋醮\",\"j\":\"嫁娶 栽种 安葬 入殓\"}");
            put("0-12", "{\"y\":\"嫁娶 会亲友 出行 纳采 开市 动土 祈福 祭祀 破土 启鑽\",\"j\":\"移徙 入宅 安葬 安门 出火\"}");
            put("0-13", "{\"y\":\"出行 解除 入学 纳采 入宅 习艺 订盟 动土 祈福 沐浴 祭祀 修造 拆卸 起基 移柩 安香 成服 除服 伐木 掘井 求嗣 上梁 竖柱 塑绘 谢土 造庙 斋醮\",\"j\":\"开市 盖屋 安葬 作灶\"}");
            put("0-14", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 入宅 开市 纳畜 牧养 出火\",\"j\":\"动土 祈福 安葬 入殓 破土\"}");
            put("0-15", "{\"y\":\"嫁娶 出行 立券 交易 开市 祈福 安床 祭祀 拆卸 开光 求嗣\",\"j\":\"移徙 入宅 动土 纳畜 安葬 安门 入殓 探病 伐木 上梁\"}");
            put("0-16", "{\"y\":\"会亲友 解除 移徙 入宅 动土 祈福 祭祀 求医 治病 合寿木 开生坟 安香 破土 求嗣 斋醮\",\"j\":\"经络 安葬 入殓 上梁 合帐\"}");
            put("0-17", "{\"y\":\"理发 开市 祈福 祭祀 牧养 开光 求嗣\",\"j\":\"嫁娶 出行 入宅 安葬 作灶 入殓 冠笄 上梁\"}");
            put("0-18", "{\"y\":\"嫁娶 会亲友 出行 解除 纳采 纳财 开市 出货财 订盟 动土 开仓 纳畜 祭祀 牧养 修造 开池 开光 破土 普渡 启鑽 上梁 竖柱 斋醮\",\"j\":\"入宅 盖屋 安葬 安门 出火\"}");
            put("0-19", "{\"y\":\"祭祀 修坟 成服 除服 立碑 启鑽\",\"j\":\"馀事勿取\"}");
            put("0-20", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 祈福 祭祀 求医 治病 出火\",\"j\":\"开市 出货财 安床 开仓 安葬 安门\"}");
            put("0-21", "{\"y\":\"解除\",\"j\":\"馀事勿取\"}");
            put("0-22", "{\"y\":\"解除 纳采 订盟 动土 祈福 栽种 盖屋 归岫 架马 修造 起基 成服 除服 合嵴 掘井 开柱眼 破土 上梁 斋醮\",\"j\":\"移徙 入宅 开市 安葬\"}");
            put("0-23", "{\"y\":\"移徙 立券 交易 入宅 纳财 开市 动土 祈福 安床 纳畜 造畜稠 开光 求嗣\",\"j\":\"嫁娶 理发 栽种 安葬 作灶 入殓 行丧 造庙 造桥\"}");
            put("0-24", "{\"y\":\"嫁娶 出行 纳采 立券 交易 开市 裁衣 订盟 动土 祈福 沐浴 祭祀 放水 移柩 冠笄 安碓磑 成服 除服 开光 破土 启鑽 求嗣 塑绘\",\"j\":\"入宅 安葬 作灶 上梁\"}");
            put("0-25", "{\"y\":\"嫁娶 移徙 入宅 动土 祈福 安床 祭祀 拆卸 出火 开光 破土 求嗣 谢土\",\"j\":\"开市 安葬 入殓 合帐\"}");
            put("0-26", "{\"y\":\"嫁娶 会亲友 出行 纳采 立券 交易 纳财 开市 赴任 订盟 动土 栽种 移柩 除服 进人口 破土 启鑽 谢土\",\"j\":\"入宅 安床 安葬 入殓\"}");
            put("0-27", "{\"y\":\"出行 立券 交易 置产 开市 动土 祈福 栽种 安床 纳畜 祭祀 造仓 起基 修坟 开光 破土 启鑽 求嗣 定磉\",\"j\":\"移徙 入宅 盖屋 安葬 安门 修造 入殓 伐木\"}");
            put("0-28", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 动土 祈福 祭祀 求医 治病\",\"j\":\"开市 安门\"}");
            put("0-29", "{\"y\":\"嫁娶 纳采 裁衣 订盟 动土 祈福 安床 纳畜 盖屋 祭祀 牧养 修造 作灶 起基 冠笄 开光 求嗣 上梁 作梁\",\"j\":\"出行 移徙 词讼 栽种 安葬 行丧 破土\"}");
            put("0-30", "{\"y\":\"嫁娶 出行 纳采 立券 交易 开市 裁衣 订盟 动土 祈福 栽种 安床 放水 移柩 成服 除服 掘井 开渠 破土\",\"j\":\"\"}");
            put("0-31", "{\"y\":\"祭祀 修坟 移柩 馀事勿取 成服 除服 启鑽\",\"j\":\"嫁娶 入宅 开市 动土 安葬 破土\"}");
            put("0-32", "{\"y\":\"嫁娶 纳采 入宅 赴任 订盟 祈福 沐浴 纳畜 祭祀 拆卸 移柩 出火 启鑽 竖柱 谢土 斋醮\",\"j\":\"安床 安葬 作灶 入殓\"}");
            put("0-33", "{\"y\":\"嫁娶 出行 解除 立券 交易 开市 动土 祈福 挂匾 祭祀 拆卸 冠笄 开光 破土 求嗣 斋醮\",\"j\":\"会亲友 理发 入宅 安葬 安门 修造 作灶 入殓 伐木 上梁\"}");
            put("0-34", "{\"y\":\"纳采 订盟 动土 祈福 祭祀 修造 破土 上梁\",\"j\":\"嫁娶 作灶\"}");
            put("0-35", "{\"y\":\"会亲友 入学 纳采 订盟 祈福 沐浴 纳畜 祭祀 牧养 造畜稠 治病 安碓磑 进人口 掘井 开池 求嗣 斋醮\",\"j\":\"嫁娶 入宅 安葬 行丧 合帐\"}");
            put("0-36", "{\"y\":\"出行 纳采 立券 交易 纳财 开市 裁衣 订盟 祈福 沐浴 祭祀 移柩 冠笄 除服 求嗣 谢土 斋醮\",\"j\":\"入宅 安葬 作灶 入殓\"}");
            put("0-37", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 动土 祈福 安床 安门 祭祀 修造 移柩 出火 立碑 破土 上梁\",\"j\":\"交易 开市 安葬 合帐\"}");
            put("0-38", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 栽种 安床 挂匾 拆卸 出火 进人口 开光\",\"j\":\"祈福 安葬 祭祀 作灶 入殓 探病\"}");
            put("0-39", "{\"y\":\"嫁娶 会亲友 出行 纳采 立券 交易 开市 习艺 订盟 动土 祈福 栽种 祭祀 造仓 拆卸 放水 起基 修坟 安碓磑 开池 开光 开渠 立碑 破土 启鑽 求嗣 谢土\",\"j\":\"入宅 安葬 安门\"}");
            put("0-40", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 祈福 栽种 安床 祭祀 修造 拆卸 移柩 出火 伐木 开光 求嗣 上梁\",\"j\":\"立券 交易 开市 安葬\"}");
            put("0-41", "{\"y\":\"嫁娶 纳采 习艺 订盟 安床 沐浴 纳畜 盖屋 挂匾 祭祀 治病 作灶 安碓磑 出火 伐木 掘井 开光 上梁 竖柱 塑绘\",\"j\":\"出行 安葬 造桥\"}");
            put("0-42", "{\"y\":\"嫁娶 出行 动土 祈福 安床 祭祀 掘井 破土 启鑽 求嗣\",\"j\":\"入宅 盖屋 安门 修造 入殓 伐木 上梁 作梁\"}");
            put("0-43", "{\"y\":\"会亲友 解除 入学 祭祀 取渔 移柩 成服 除服 结网 启鑽 畋猎\",\"j\":\"开市 动土 祈福 安葬 入殓 破土 造船\"}");
            put("0-44", "{\"y\":\"出行 解除 置产 开市 动土 祈福 栽种 祭祀 起基 开光 求嗣\",\"j\":\"嫁娶 入宅 安床 安葬 安门 作灶 修坟 立碑\"}");
            put("0-45", "{\"y\":\"出行 入学 置产 纳财 开市 动土 祈福 栽种 纳畜 祭祀 牧养 拆卸 起基 问名 掘井 开渠 破土 启鑽 求嗣 斋醮 定磉\",\"j\":\"移徙 入宅 安葬 入殓 出火\"}");
            put("0-46", "{\"y\":\"解除 动土 祈福 栽种 安床 纳畜 祭祀 移柩 掘井 开光 破土 作梁\",\"j\":\"嫁娶 出行 移徙 入宅 赴任 盖屋 安葬 入殓 出火 进人口\"}");
            put("0-47", "{\"y\":\"会亲友 纳采 立券 交易 开市 订盟 安床 沐浴 架马 安门 祭祀 牧养 造畜稠 拆卸 出火 伐木 掘井 开光 开柱眼 上梁 竖柱 塑绘 斋醮 作梁\",\"j\":\"嫁娶 出行 动土 安葬 行丧 造庙\"}");
            put("0-48", "{\"y\":\"嫁娶 解除 动土 祈福 栽种 安床 祭祀 掘井 开池 开光 破土 启鑽 求嗣\",\"j\":\"出行 入宅 纳畜 安葬 作灶 出火 伐木\"}");
            put("0-49", "{\"y\":\"出行 解除 移徙 入宅 祈福 纳畜 盖屋 架马 牧养 修造 起基 移柩 成服 除服 伐木 开光 求嗣 谢土 造庙\",\"j\":\"纳采 交易 开市 动土 安门\"}");
            put("0-50", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 开市 动土 祈福 安床 拆卸 出火 开光 破土 求嗣 谢土\",\"j\":\"安葬 祭祀 入殓 探病\"}");
            put("0-51", "{\"y\":\"嫁娶 会亲友 出行 解除 理发 纳采 习艺 订盟 动土 祈福 安床 纳畜 祭祀 牧养 修造 拆卸 放水 起基 修坟 成服 除服 立碑 破土 求嗣 竖柱 斋醮 针灸 定磉\",\"j\":\"入宅 开市 盖屋 探病 出火\"}");
            put("0-52", "{\"y\":\"解除 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("0-53", "{\"y\":\"嫁娶 会亲友 纳畜 祭祀 牧养 求医 治病 放水 安碓磑 掘井 开光 开渠 塑绘\",\"j\":\"入学 入宅 盖屋 安葬 作灶 行丧\"}");
            put("0-54", "{\"y\":\"嫁娶 会亲友 出行 解除 祈福 栽种 安床 祭祀 移柩 成服 除服 进人口 开光 求嗣\",\"j\":\"移徙 置产 入宅 纳畜 盖屋 安葬 入殓 伐木\"}");
            put("0-55", "{\"y\":\"会亲友 解除 祭祀 移柩 捕捉 成服 除服 普渡 启鑽 畋猎\",\"j\":\"嫁娶 开市 动土 安葬 掘井 开池\"}");
            put("0-56", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 纳财 开市 祈福 栽种 挂匾 祭祀 出火 进人口 开光 破土 求嗣 谢土\",\"j\":\"安床 安葬\"}");
            put("0-57", "{\"y\":\"出行 解除 扫舍 理发 动土 祈福 沐浴 祭祀 拆卸 起基 移柩 冠笄 安碓磑 成服 除服 掘井 开池 立碑 启鑽 求嗣 谢土 斋醮 定磉\",\"j\":\"移徙 入宅 安葬 安门 作梁\"}");
            put("0-58", "{\"y\":\"置产 动土 祈福 栽种 安床 祭祀 修造 拆卸 开光 破土 求嗣 上梁\",\"j\":\"嫁娶 出行 移徙 入宅 赴任 安葬 入殓 进人口 开渠\"}");
            put("0-59", "{\"y\":\"会亲友 沐浴 造畜稠 作灶 放水 冠笄 开光 塑绘\",\"j\":\"嫁娶 出行 安葬 入殓\"}");
            put("1-0", "{\"y\":\"出行 纳采 裁衣 订盟 祈福 安床 沐浴 挂匾 祭祀 造畜稠 拆卸 起基 入殓 移柩 成服 除服 启鑽 求嗣 上梁 竖柱 斋醮 合帐\",\"j\":\"嫁娶 移徙 入宅 开仓\"}");
            put("1-1", "{\"y\":\"祈福 纳畜 祭祀 入殓 成服 除服 启鑽 求嗣 谢土\",\"j\":\"嫁娶 出行 入宅 动土 栽种 开光 破土 针灸\"}");
            put("1-2", "{\"y\":\"纳采 订盟 动土 安床 安葬 修造 造仓 拆卸 入殓 移柩 冠笄 成服 除服 破土 启鑽\",\"j\":\"嫁娶 入宅 开市 作灶 开光\"}");
            put("1-3", "{\"y\":\"出行 动土 安床 安葬 祭祀 修造 造畜稠 合寿木 开生坟 入殓 移柩 补垣 破土 启鑽 塞穴 合帐\",\"j\":\"移徙 理发 入宅 安门 作灶 开光\"}");
            put("1-4", "{\"y\":\"嫁娶 出行 移徙 入宅 裁衣 安床 安葬 祭祀 作灶 破土\",\"j\":\"赴任 捕捉\"}");
            put("1-5", "{\"y\":\"嫁娶 移徙 纳财 裁衣 动土 栽种 安门 修造 拆卸 冠笄 出火 伐木 塞穴 上梁 筑堤 合帐\",\"j\":\"出行 祈福 安床 安葬 行丧 开光\"}");
            put("1-6", "{\"y\":\"安葬 入殓 移柩 馀事勿取 补垣 成服 除服 结网 启鑽 塞穴\",\"j\":\"诸事不宜\"}");
            put("1-7", "{\"y\":\"出行 动土 安床 安葬 祭祀 修造 造畜稠 拆卸 起基 入殓 移柩 补垣 出火 破土 塞穴 作梁\",\"j\":\"嫁娶 入宅 掘井 开光 斋醮 针灸\"}");
            put("1-8", "{\"y\":\"嫁娶 移徙 入宅 裁衣 动土 经络 安机械 安葬 祭祀 造仓 拆卸 起基 入殓 冠笄 启鑽\",\"j\":\"交易 开市 安床 开光\"}");
            put("1-9", "{\"y\":\"嫁娶 移徙 裁衣 安床 安葬 祭祀 入殓 移柩 冠笄 破土 塞穴 合帐\",\"j\":\"出行 置产 开市 词讼 栽种 安门 掘井 开光\"}");
            put("1-10", "{\"y\":\"出行 纳采 订盟 祈福 安葬 入殓 移柩 结网 立碑 破土 斋醮\",\"j\":\"入宅 作灶\"}");
            put("1-11", "{\"y\":\"出行 移徙 入宅 动土 安门 修造 造仓 造畜稠 起基 补垣 进人口 塞穴 上梁\",\"j\":\"嫁娶 开市 祈福 栽种 安床 安葬 掘井 开光\"}");
            put("1-12", "{\"y\":\"交易 经络 祈福 安床 安机械 沐浴 造车器 安葬 祭祀 入殓 移柩 立碑 启鑽 斋醮 合帐\",\"j\":\"嫁娶 入宅 作灶 掘井\"}");
            put("1-13", "{\"y\":\"祈福 安葬 祭祀 入殓 移柩 成服 除服 启鑽 求嗣 斋醮\",\"j\":\"嫁娶 动土 盖屋 开光 破土\"}");
            put("1-14", "{\"y\":\"纳采 立券 交易 纳财 裁衣 订盟 经络 安床 安机械 纳畜 架马 安葬 造仓 拆卸 入殓 修坟 移柩 冠笄 补垣 成服 除服 伐木 立碑 破土 启鑽 塞穴 筑堤 合帐\",\"j\":\"嫁娶 入宅 祭祀 开光\"}");
            put("1-15", "{\"y\":\"交易 纳财 祈福 祭祀 作灶 冠笄 求嗣 斋醮\",\"j\":\"嫁娶 安葬 安门 探病 掘井 开光\"}");
            put("1-16", "{\"y\":\"嫁娶 出行 移徙 入宅 动土 祈福 栽种 安床 安葬 祭祀 修造 作灶 拆卸 出火 破土 求嗣 塞穴\",\"j\":\"开仓 掘井 开光\"}");
            put("1-17", "{\"y\":\"嫁娶 移徙 入宅 动土 纳畜 架马 牧养 修造 作灶 起基 冠笄 补垣 开池 塞穴 造船 定磉\",\"j\":\"开市 祈福 安葬 掘井 开光\"}");
            put("1-18", "{\"y\":\"安葬 祭祀 入殓 移柩 成服 除服 破土 启鑽 谢土\",\"j\":\"馀事勿取\"}");
            put("1-19", "{\"y\":\"嫁娶 祈福 安葬 祭祀 入殓 补垣 成服 除服 断蚁 普渡 塞穴 筑堤\",\"j\":\"动土 词讼 掘井 开光 破土 上梁\"}");
            put("1-20", "{\"y\":\"嫁娶 出行 移徙 动土 安葬 修造 拆卸 修坟 伐木 立碑 破土\",\"j\":\"入宅 开市 祈福 安床 挂匾 掘井 开光\"}");
            put("1-21", "{\"y\":\"扫舍 整手足甲 理发 沐浴 祭祀 作灶 入殓 冠笄 补垣 破土 启鑽 塞穴\",\"j\":\"嫁娶 会亲友 栽种 安葬 开光 针灸\"}");
            put("1-22", "{\"y\":\"安床 祭祀 入殓 移柩 补垣 开池 破土 启鑽\",\"j\":\"嫁娶 移徙 入宅 开市 作灶 出火 进人口 掘井 开光\"}");
            put("1-23", "{\"y\":\"移徙 纳采 入宅 裁衣 订盟 动土 栽种 开仓 沐浴 纳畜 开厕 安门 祭祀 修造 拆卸 冠笄 补垣 塞穴 筑堤 合帐\",\"j\":\"嫁娶 祈福 安葬 行丧 掘井 开光\"}");
            put("1-24", "{\"y\":\"立券 交易 裁衣 安床 安葬 入殓 移柩 成服 除服\",\"j\":\"嫁娶 出行 置产 入宅 动土 栽种 治病 开光 破土\"}");
            put("1-25", "{\"y\":\"立券 交易 裁衣 祈福 安床 祭祀 入殓 移柩 成服 酬神 除服 启鑽 求嗣 谢土\",\"j\":\"嫁娶 出行 入宅 动土\"}");
            put("1-26", "{\"y\":\"立券 交易 动土 栽种 安床 纳畜 安葬 牧养 修造 拆卸 入殓 伐木 上梁\",\"j\":\"嫁娶 出行 移徙 入宅 安门 祭祀 出火 开光\"}");
            put("1-27", "{\"y\":\"裁衣 祈福 安床 安葬 祭祀 造畜稠 入殓 移柩 成服 除服 立碑 破土 启鑽 谢土 合帐\",\"j\":\"嫁娶 纳采 安门 掘井\"}");
            put("1-28", "{\"y\":\"嫁娶 立券 交易 开厕 取渔 开生坟 补垣 塞穴 畋猎\",\"j\":\"移徙 入宅 开市 安床 修造 开光 开渠 上梁\"}");
            put("1-29", "{\"y\":\"移徙 入宅 裁衣 纳畜 作灶\",\"j\":\"嫁娶 安葬\"}");
            put("1-30", "{\"y\":\"经络 沐浴 祭祀 入殓 移柩 补垣 成服 除服 立碑 启鑽 塞穴\",\"j\":\"嫁娶 安葬 治病 掘井 开光 破土\"}");
            put("1-31", "{\"y\":\"嫁娶 移徙 入宅 祈福 祭祀 作灶 斋醮\",\"j\":\"动土 破土\"}");
            put("1-32", "{\"y\":\"嫁娶 解除 扫舍 安机械 沐浴 纳畜 架马 安葬 安门 牧养 合寿木 修坟 冠笄 伐木 立碑 启鑽 作梁\",\"j\":\"入宅 开市 动土 祈福 开光\"}");
            put("1-33", "{\"y\":\"嫁娶 安机械 安葬 祭祀 入殓 破土\",\"j\":\"动土 上梁\"}");
            put("1-34", "{\"y\":\"嫁娶 裁衣 安床 造畜稠 入殓 移柩 破土 合帐\",\"j\":\"置产 作灶 掘井 开光 造船\"}");
            put("1-35", "{\"y\":\"出行 理发 沐浴 补垣 塞穴\",\"j\":\"入宅 安葬\"}");
            put("1-36", "{\"y\":\"交易 纳财 祈福 沐浴 安葬 祭祀 造畜稠 入殓 修坟 移柩 问名 教牛马 立碑 求嗣 谢土\",\"j\":\"嫁娶 置产 入宅 开市 动土 栽种 开光 破土\"}");
            put("1-37", "{\"y\":\"祈福 安葬 祭祀 入殓 移柩 启鑽 求嗣\",\"j\":\"嫁娶 出行 移徙 入宅 动土 作灶 掘井 开光 针灸\"}");
            put("1-38", "{\"y\":\"立券 交易 动土 安机械 安葬 修造 入殓 冠笄 破土\",\"j\":\"嫁娶 入宅 祈福 出火\"}");
            put("1-39", "{\"y\":\"嫁娶 出行 立券 交易 安床 安葬 作灶 入殓 移柩 冠笄 成服 除服 破土 合帐\",\"j\":\"开市 词讼 开光\"}");
            put("1-40", "{\"y\":\"嫁娶 出行 移徙 造车器 开厕 祭祀 作灶 入殓 冠笄 补垣 成服 除服 破土 启鑽 塞穴\",\"j\":\"入宅 盖屋 安葬 安门 上梁 造桥\"}");
            put("1-41", "{\"y\":\"嫁娶 纳采 裁衣 动土 安门 修造 造畜稠 作灶 起基 冠笄 伐木 求嗣 上梁 竖柱 筑堤 作梁 合帐\",\"j\":\"出行 祈福 栽种 安葬\"}");
            put("1-42", "{\"y\":\"安葬 祭祀 入殓 移柩 成服 除服 断蚁 结网 破土 启鑽 塞穴\",\"j\":\"嫁娶 入宅 开市 盖屋 开光\"}");
            put("1-43", "{\"y\":\"嫁娶 出行 移徙 动土 祈福 安床 安葬 祭祀 修造 拆卸 入殓 出火 破土 启鑽 求嗣\",\"j\":\"理发 盖屋 作灶 掘井 开光 造船\"}");
            put("1-44", "{\"y\":\"出行 移徙 入宅 动土 沐浴 安葬 修造 冠笄 破土\",\"j\":\"嫁娶 纳采 开市 祈福 祭祀 修坟 斋醮\"}");
            put("1-45", "{\"y\":\"解除 扫舍 整手足甲 理发 裁衣 安床 祭祀 造畜稠 作灶 放水 补垣 塞穴 筑堤\",\"j\":\"嫁娶 会亲友 栽种 安门 掘井 开光\"}");
            put("1-46", "{\"y\":\"理发 置产 安葬 祭祀 入殓 移柩 成服 除服 破土 塞穴\",\"j\":\"嫁娶 入宅 安床 掘井 开光\"}");
            put("1-47", "{\"y\":\"动土 栽种 开厕 安门 修造 作灶 补垣 开池 塞穴 筑堤 作梁\",\"j\":\"嫁娶 祈福 安床 安葬 行丧 掘井\"}");
            put("1-48", "{\"y\":\"立券 交易 纳财 裁衣 安床 安葬 造畜稠 入殓 修坟 移柩 成服 除服 立碑 启鑽 谢土\",\"j\":\"嫁娶 开市 动土 开光 破土\"}");
            put("1-49", "{\"y\":\"裁衣 经络 安床 安葬 祭祀 作灶 入殓 移柩 伐木 启鑽 作梁 合帐\",\"j\":\"入宅 词讼 出火\"}");
            put("1-50", "{\"y\":\"裁衣 动土 经络 安葬 修造 拆卸 合寿木 入殓 修坟 移柩 成服 除服 伐木 合嵴 开柱眼 立碑 破土 启鑽\",\"j\":\"嫁娶 出行 祭祀 掘井 上梁\"}");
            put("1-51", "{\"y\":\"立券 交易 裁衣 安床 安葬 祭祀 入殓 冠笄 补垣 成服 除服 开池 破土 启鑽 塞穴 谢土\",\"j\":\"嫁娶 开市 栽种 探病 掘井 开光\"}");
            put("1-52", "{\"y\":\"\",\"j\":\"馀事勿取\"}");
            put("1-53", "{\"y\":\"动土 栽种 安床 安门 修造 造畜稠 起基 补垣 筑堤\",\"j\":\"嫁娶 出行 移徙 理发 入宅 安葬 行丧 出火 进人口 掘井 开光\"}");
            put("1-54", "{\"y\":\"祭祀 馀事勿取 结网 塞穴 畋猎\",\"j\":\"嫁娶 移徙 入宅 开市 安门 开光\"}");
            put("1-55", "{\"y\":\"会亲友 动土 安葬 祭祀 入殓 移柩 开池 破土 塞穴 筑堤\",\"j\":\"出行 入宅 裁衣 安门 修造 作灶 开光 上梁\"}");
            put("1-56", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 动土 架马 安葬 修造 合寿木 开生坟 入殓 修坟 移柩 冠笄 伐木 开柱眼 破土\",\"j\":\"开市 祈福 安床 祭祀 开光\"}");
            put("1-57", "{\"y\":\"嫁娶 扫舍 整手足甲 动土 祈福 安床 安葬 祭祀 作灶 入殓 移柩 补垣 成服 除服 破土 启鑽 求嗣\",\"j\":\"栽种 开光\"}");
            put("1-58", "{\"y\":\"嫁娶 会亲友 纳采 置产 安床 造畜稠 冠笄 捕捉 塞穴\",\"j\":\"安葬 修坟 掘井 开光 谢土\"}");
            put("1-59", "{\"y\":\"裁衣 沐浴 开厕 修造 冠笄 安碓磑 补垣 断蚁 开柱眼 塞穴 筑堤 作梁\",\"j\":\"嫁娶 移徙 入宅 祈福 掘井 开光\"}");
            put("2-0", "{\"y\":\"交易 沐浴 安葬 祭祀 入殓 修坟 捕捉 成服 除服 进人口 启鑽 谢土\",\"j\":\"入宅 动土 修造 破土 斋醮\"}");
            put("2-1", "{\"y\":\"解除 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("2-2", "{\"y\":\"解除 立券 交易 纳畜 安葬 入殓 移柩 伐木 开光 上梁 竖柱\",\"j\":\"嫁娶 出行 移徙 入宅 动土 祭祀 作灶 破土\"}");
            put("2-3", "{\"y\":\"会亲友 出行 纳采 立券 交易 开市 赴任 裁衣 订盟 祈福 安床 安葬 入殓 移柩 成服 酬神 除服 开光 立碑 启鑽 竖柱 塑绘\",\"j\":\"动土 栽种 作灶 掘井\"}");
            put("2-4", "{\"y\":\"修饰垣墙 祭祀 馀事勿取\",\"j\":\"动土 修造 开光 破土\"}");
            put("2-5", "{\"y\":\"馀事勿取 结网 塞穴\",\"j\":\"诸事不宜\"}");
            put("2-6", "{\"y\":\"出行 馀事勿取 割蜜 教牛马\",\"j\":\"动土 盖屋 破土 斋醮\"}");
            put("2-7", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 祈福 祭祀\",\"j\":\"动土 安葬\"}");
            put("2-8", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 纳财 订盟 祈福 纳畜 安葬 祭祀 入殓 启鑽 求嗣 上梁 竖柱\",\"j\":\"置产 动土 栽种 安床 掘井 破土\"}");
            put("2-9", "{\"y\":\"出行 沐浴 祭祀 入殓 成服 除服\",\"j\":\"移徙 入宅 开市 动土 冠笄 上梁 竖柱\"}");
            put("2-10", "{\"y\":\"出行 安床 造车器 盖屋 安门 祭祀 修造 造畜稠 教牛马 上梁\",\"j\":\"出货财 动土 栽种 开仓 安葬 行丧 伐木 开渠 破土\"}");
            put("2-11", "{\"y\":\"出行 沐浴 祭祀 冠笄 馀事勿取 进人口\",\"j\":\"嫁娶 动土 安葬 作灶\"}");
            put("2-12", "{\"y\":\"造畜稠 教牛马\",\"j\":\"嫁娶 扫舍 移徙 入宅 动土 分居 作灶 安香 出火 掘井 造桥\"}");
            put("2-13", "{\"y\":\"解除 扫舍 祭祀 教牛马\",\"j\":\"馀事勿取\"}");
            put("2-14", "{\"y\":\"会亲友 纳采 立券 安葬 入殓 移柩 启鑽 上梁 竖柱\",\"j\":\"移徙 入宅 动土 祭祀 破土\"}");
            put("2-15", "{\"y\":\"嫁娶 出行 安床 安葬 祭祀 入殓 移柩 冠笄\",\"j\":\"动土 栽种 作灶 掘井\"}");
            put("2-16", "{\"y\":\"出行 解除 祭祀 馀事勿取 教牛马\",\"j\":\"动土 安葬 行丧 探病 开光 破土 作梁\"}");
            put("2-17", "{\"y\":\"解除 扫舍 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("2-18", "{\"y\":\"交易 纳财 祭祀\",\"j\":\"动土 开渠 破土 上梁 斋醮\"}");
            put("2-19", "{\"y\":\"出行 交易 祭祀 造畜稠 割蜜\",\"j\":\"嫁娶 移徙 动土 词讼 安葬 作灶 伐木 掘井 破土 作梁\"}");
            put("2-20", "{\"y\":\"嫁娶 出行 扫舍 纳财 赴任 沐浴 纳畜 祭祀 冠笄 普渡\",\"j\":\"开市 动土 安床 开仓 破土 上梁\"}");
            put("2-21", "{\"y\":\"出行 扫舍 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("2-22", "{\"y\":\"嫁娶 会亲友 移徙 纳采 立券 交易 置产 开市 订盟 祈福 纳畜 盖屋 安门 祭祀 求医 治病 放水 捕捉 合嵴 求嗣 上梁 竖柱\",\"j\":\"动土 安葬 破土 造船 造庙\"}");
            put("2-23", "{\"y\":\"沐浴 祭祀\",\"j\":\"馀事勿取\"}");
            put("2-24", "{\"y\":\"裁衣 馀事勿取 教牛马 合帐\",\"j\":\"嫁娶 入宅 动土 作灶 破土 造船\"}");
            put("2-25", "{\"y\":\"解除 祭祀 造畜稠 馀事勿取 教牛马 针灸\",\"j\":\"嫁娶 动土 安葬 开池\"}");
            put("2-26", "{\"y\":\"会亲友 纳财 裁衣 入殓 成服 除服 合帐\",\"j\":\"嫁娶 移徙 入宅 祈福 祭祀\"}");
            put("2-27", "{\"y\":\"嫁娶 会亲友 出行 交易 开市 安葬 祭祀 移柩 冠笄 成服 除服 教牛马 启鑽 求嗣 斋醮\",\"j\":\"移徙 入宅 动土 祈福\"}");
            put("2-28", "{\"y\":\"嫁娶 出行 解除 扫舍 裁衣 安床 祭祀 冠笄 进人口\",\"j\":\"动土 安葬 掘井 开光 破土\"}");
            put("2-29", "{\"y\":\"馀事勿取 断蚁 结网 塞穴 畋猎\",\"j\":\"嫁娶 出行 入宅 动土 词讼 安葬\"}");
            put("2-30", "{\"y\":\"安葬 祭祀 入殓 移柩 启鑽\",\"j\":\"动土 破土 上梁\"}");
            put("2-31", "{\"y\":\"嫁娶 出行 交易 纳财 裁衣 造车器 祭祀 造畜稠 冠笄 雕刻 教牛马\",\"j\":\"移徙 入宅 动土 栽种 安葬 作灶 行丧 伐木 破土 上梁\"}");
            put("2-32", "{\"y\":\"嫁娶 出行 纳畜 安葬 祭祀 入殓 启鑽\",\"j\":\"动土 作灶 破土\"}");
            put("2-33", "{\"y\":\"出行 扫舍 沐浴 安葬 祭祀 馀事勿取\",\"j\":\"置产 动土 掘井 破土\"}");
            put("2-34", "{\"y\":\"造畜稠 作灶\",\"j\":\"安葬 行丧\"}");
            put("2-35", "{\"y\":\"出行 解除 修饰垣墙 冠笄 馀事勿取\",\"j\":\"嫁娶 开市 动土 安葬 破土\"}");
            put("2-36", "{\"y\":\"教牛马\",\"j\":\"入宅 动土 馀事勿取 破土\"}");
            put("2-37", "{\"y\":\"会亲友 解除 祭祀 造畜稠 馀事勿取 教牛马\",\"j\":\"嫁娶 出行 入宅 动土 安葬 行丧 破土\"}");
            put("2-38", "{\"y\":\"解除 立券 交易 纳财 裁衣 安床 纳畜 安葬 牧养 入殓 移柩 启鑽 上梁 竖柱\",\"j\":\"嫁娶 出行 入宅 动土 祭祀 掘井 开渠\"}");
            put("2-39", "{\"y\":\"会亲友 出行 立券 交易 纳财 祭祀 冠笄\",\"j\":\"嫁娶 动土 起基 掘井 破土 定磉\"}");
            put("2-40", "{\"y\":\"出行 修饰垣墙 造畜稠 馀事勿取 教牛马\",\"j\":\"诸事不宜\"}");
            put("2-41", "{\"y\":\"会亲友 解除 祭祀 馀事勿取 断蚁\",\"j\":\"嫁娶 安葬\"}");
            put("2-42", "{\"y\":\"解除 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("2-43", "{\"y\":\"出行 造车器 盖屋 祭祀 修造 造畜稠 割蜜 教牛马 竖柱\",\"j\":\"动土 安葬 掘井 破土\"}");
            put("2-44", "{\"y\":\"出行 解除 移徙 纳财 祈福 纳畜 盖屋 安葬 安门 祭祀 牧养 入殓 开光 启鑽 求嗣 上梁\",\"j\":\"置产 动土 安床 掘井 破土\"}");
            put("2-45", "{\"y\":\"出行 祭祀\",\"j\":\"嫁娶 会亲友 入宅 动土 修造 破土\"}");
            put("2-46", "{\"y\":\"嫁娶 会亲友 出行 移徙 纳财 裁衣 纳畜 祭祀 造畜稠 冠笄 上梁 竖柱\",\"j\":\"动土 安葬 开生坟 行丧 伐木 作梁\"}");
            put("2-47", "{\"y\":\"出行 沐浴 祭祀 馀事勿取\",\"j\":\"开市 动土 安葬 行丧 破土\"}");
            put("2-48", "{\"y\":\"安葬 入殓 移柩 成服 除服 启鑽\",\"j\":\"馀事勿取\"}");
            put("2-49", "{\"y\":\"会亲友 解除 祭祀 馀事勿取 教牛马\",\"j\":\"动土 安葬 破土\"}");
            put("2-50", "{\"y\":\"立券 交易 纳财 裁衣 伐木 作梁\",\"j\":\"诸事不宜\"}");
            put("2-51", "{\"y\":\"嫁娶 会亲友 立券 交易 裁衣 祭祀 冠笄 进人口 合帐\",\"j\":\"动土 栽种 安葬 修坟 探病 掘井\"}");
            put("2-52", "{\"y\":\"出行 扫舍 祭祀 馀事勿取 教牛马\",\"j\":\"安葬 伐木 开光 破土\"}");
            put("2-53", "{\"y\":\"馀事勿取 断蚁 结网 塞穴\",\"j\":\"安葬 破土\"}");
            put("2-54", "{\"y\":\"祭祀 馀事勿取 断蚁 教牛马\",\"j\":\"移徙 入宅 动土 斋醮\"}");
            put("2-55", "{\"y\":\"会亲友 纳财 开市 裁衣 经络 开仓 安机械 纳畜 祭祀 牧养 造畜稠 冠笄 教牛马 塑绘\",\"j\":\"动土 安葬 治病 破土\"}");
            put("2-56", "{\"y\":\"出行 扫舍 纳财 裁衣 纳畜 安门 祭祀 造畜稠 作灶 进人口\",\"j\":\"动土 安床 安葬 合寿木 开生坟\"}");
            put("2-57", "{\"y\":\"出行 扫舍 交易 祈福 沐浴 祭祀 教牛马 求嗣\",\"j\":\"动土 安葬 作灶 修坟 行丧\"}");
            put("2-58", "{\"y\":\"出行 解除 移徙 入宅 纳财 祈福 安床 纳畜 安门 祭祀 造畜稠 开光 求嗣 上梁\",\"j\":\"嫁娶 安葬 行丧 伐木 开渠 破土\"}");
            put("2-59", "{\"y\":\"沐浴 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("3-0", "{\"y\":\"嫁娶 会亲友 出行 扫舍 纳采 纳财 赴任 裁衣 订盟 动土 祈福 栽种 沐浴 纳畜 祭祀 修造 入殓 移柩 成服 除服 伐木 开光 启鑽 上梁 竖柱 塑绘\",\"j\":\"入宅 安床 开仓 作灶\"}");
            put("3-1", "{\"y\":\"嫁娶 出行 入学 纳采 立券 交易 入宅 订盟 动土 祈福 造车器 盖屋 归宁 安门 祭祀 求医 修造 治病 起基 安香 出火 上梁 竖柱 造庙\",\"j\":\"安葬 行丧 伐木 斋醮 作梁\"}");
            put("3-2", "{\"y\":\"解除 扫舍 移徙 纳采 立券 交易 入宅 纳财 裁衣 订盟 动土 沐浴 安葬 修造 拆卸 修坟 移柩 冠笄 成服 除服 伐木 破土 启鑽\",\"j\":\"出行 祭祀 作灶 上梁\"}");
            put("3-3", "{\"y\":\"嫁娶 出行 解除 动土 祈福 栽种 安床 纳畜 安葬 祭祀 拆卸 起基 伐木 进人口 开光 破土 启鑽 求嗣 上梁 谢土\",\"j\":\"移徙 入宅 作灶 出火 掘井\"}");
            put("3-4", "{\"y\":\"扫舍 祭祀 塞穴\",\"j\":\"嫁娶 栽种 安葬 作灶\"}");
            put("3-5", "{\"y\":\"嫁娶 会亲友 移徙 入宅 祈福 造车器 盖屋 安门 祭祀 治病 起基 出火 掘井 开池 开光 求嗣 上梁 竖柱 斋醮\",\"j\":\"出行 纳采 立券 开市 安葬 作灶 修坟\"}");
            put("3-6", "{\"y\":\"嫁娶 出行 纳采 订盟 动土 祈福 安葬 祭祀 破土 上梁 斋醮\",\"j\":\"移徙 入宅\"}");
            put("3-7", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 纳财 动土 祈福 栽种 安床 纳畜 挂匾 祭祀 修造 造畜稠 拆卸 出火 进人口 开光 求嗣\",\"j\":\"安葬 开生坟 行丧\"}");
            put("3-8", "{\"y\":\"嫁娶 祈福 安葬 祭祀 治病 破土 斋醮\",\"j\":\"入宅 开市\"}");
            put("3-9", "{\"y\":\"解除 动土 祈福 安床 纳畜 盖屋 安葬 祭祀 修造 起基 入殓 合嵴 破土 求嗣 上梁 竖柱\",\"j\":\"嫁娶 出行 移徙 入宅 开市 赴任 词讼 出火 进人口 开光\"}");
            put("3-10", "{\"y\":\"出行 赴任 沐浴 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("3-11", "{\"y\":\"出行 解除 扫舍 移徙 入宅 安床 祭祀 修造 造畜稠 拆卸 出火 伐木 开光 作梁\",\"j\":\"嫁娶 动土 栽种 作灶 掘井 造庙 造桥\"}");
            put("3-12", "{\"y\":\"嫁娶 移徙 整手足甲 理发 入学 纳采 入宅 赴任 裁衣 订盟 祈福 沐浴 安葬 祭祀 治病 拆卸 入殓 修坟 移柩 冠笄 安香 开光 破土 启鑽 塑绘 谢土 斋醮 作梁\",\"j\":\"开市\"}");
            put("3-13", "{\"y\":\"会亲友 出行 移徙 纳采 立券 交易 入宅 开市 订盟 动土 祈福 栽种 安床 安机械 纳畜 造车器 盖屋 祭祀 修造 造畜稠 起基 安香 上梁\",\"j\":\"安葬 开生坟 行丧 破土\"}");
            put("3-14", "{\"y\":\"解除 移徙 立券 交易 入宅 开市 动土 栽种 安床 纳畜 安葬 挂匾 拆卸 出火 伐木 开光 上梁 作梁\",\"j\":\"嫁娶 出行 置产 祭祀\"}");
            put("3-15", "{\"y\":\"出行 移徙 立券 入宅 开市 动土 祈福 安葬 祭祀 破土 斋醮\",\"j\":\"嫁娶 纳畜 作灶 掘井 开光\"}");
            put("3-16", "{\"y\":\"塞穴\",\"j\":\"嫁娶 安葬 安门 作灶\"}");
            put("3-17", "{\"y\":\"会亲友 解除 扫舍 理发 栽种 沐浴 求医 造畜稠 治病 斋醮\",\"j\":\"嫁娶 移徙 入宅 开市 安葬 掘井\"}");
            put("3-18", "{\"y\":\"出行 立券 交易 入宅 开市 动土 栽种 安葬 安门 挂匾 拆卸 修坟 移柩 进人口 开光 破土 上梁\",\"j\":\"嫁娶 安床 作灶 探病\"}");
            put("3-19", "{\"y\":\"嫁娶 会亲友 出行 入学 纳采 入宅 纳财 订盟 动土 栽种 安机械 造车器 开厕 安门 祭祀 牧养 修造 拆卸 起基 冠笄 安香 出火 开光 塑绘\",\"j\":\"作灶 行丧 伐木 作梁\"}");
            put("3-20", "{\"y\":\"嫁娶 移徙 立券 交易 入宅 开市 动土 祈福 栽种 纳畜 挂匾 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 启鑽 求嗣\",\"j\":\"\"}");
            put("3-21", "{\"y\":\"解除 整手足甲 理发 沐浴 安葬 祭祀 入殓 移柩 冠笄 破土 启鑽\",\"j\":\"嫁娶 出行 入宅 开市 安门\"}");
            put("3-22", "{\"y\":\"嫁娶 出行 解除 扫舍 整手足甲 理发 动土 安床 祭祀 放水 开池 开光 塑绘\",\"j\":\"安葬 作灶 行丧 伐木 作梁\"}");
            put("3-23", "{\"y\":\"会亲友 出行 解除 扫舍 移徙 入宅 开市 裁衣 安机械 造车器 造畜稠 冠笄 雕刻 作梁\",\"j\":\"嫁娶 动土 修坟 破土\"}");
            put("3-24", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 动土 栽种 纳畜 安葬 修造 拆卸 成服 出火 除服 进人口 掘井 开光\",\"j\":\"置产 安床\"}");
            put("3-25", "{\"y\":\"嫁娶 会亲友 出行 解除 扫舍 纳采 订盟 动土 经络 祈福 栽种 祭祀 牧养 求医 修造 造畜稠 治病 拆卸 起基 安香 出火 定磉\",\"j\":\"安葬 行丧 掘井 斋醮 作梁\"}");
            put("3-26", "{\"y\":\"纳采 立券 交易 纳财 开市 订盟 动土 沐浴 安葬 放水 起基 修坟 移柩 开光 立碑 破土 启鑽 塑绘 定磉\",\"j\":\"入宅 安门 祭祀 谢土\"}");
            put("3-27", "{\"y\":\"嫁娶 会亲友 出行 纳采 入宅 裁衣 订盟 祈福 祭祀 放水 入殓 移柩 冠笄 安香 立碑 破土 求嗣 上梁 谢土 斋醮 合帐\",\"j\":\"掘井\"}");
            put("3-28", "{\"y\":\"解除 整手足甲 馀事勿取 捕捉 结网 塞穴 畋猎\",\"j\":\"嫁娶 安葬 作灶 掘井\"}");
            put("3-29", "{\"y\":\"移徙 纳采 入宅 动土 求医 治病 开光 上梁\",\"j\":\"嫁娶 开市 安葬\"}");
            put("3-30", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 订盟 祈福 栽种 纳畜 祭祀 牧养 入殓 出火 开光 破土 求嗣\",\"j\":\"动土 安床 开仓 盖屋 安葬 作灶\"}");
            put("3-31", "{\"y\":\"会亲友 出行 纳采 订盟 祈福 安床 斋醮\",\"j\":\"移徙 入宅 安葬\"}");
            put("3-32", "{\"y\":\"解除 扫舍 动土 安机械 沐浴 盖屋 安葬 祭祀 修造 造畜稠 治病 拆卸 合寿木 开生坟 起基 入殓 移柩 开池 立碑 破土 启鑽\",\"j\":\"出行 入宅 开市 安床 作灶\"}");
            put("3-33", "{\"y\":\"纳采 订盟 动土 祈福 安葬 祭祀 修造 破土 上梁\",\"j\":\"嫁娶 开市\"}");
            put("3-34", "{\"y\":\"嫁娶 出行 解除 扫舍 整手足甲 纳采 开市 动土 安床 盖屋 祭祀 求医 修造 治病 起基 合嵴 上梁 定磉\",\"j\":\"安葬 作灶 行丧 伐木 造船 造庙\"}");
            put("3-35", "{\"y\":\"理发 入学 习艺 沐浴 进人口\",\"j\":\"嫁娶 入宅\"}");
            put("3-36", "{\"y\":\"嫁娶 会亲友 出行 解除 移徙 纳采 立券 入宅 开市 订盟 动土 祈福 栽种 盖屋 安葬 安门 挂匾 祭祀 求医 修造 治病 起基 进人口 开光 求嗣\",\"j\":\"经络 安床 作灶\"}");
            put("3-37", "{\"y\":\"嫁娶 出行 祈福 纳畜 祭祀 求医 治病 上梁\",\"j\":\"开市 安葬\"}");
            put("3-38", "{\"y\":\"嫁娶 解除 移徙 入宅 动土 栽种 安床 修造 拆卸 入殓 修坟 成服 出火 除服 进人口 开光\",\"j\":\"出行 纳采 开市 订盟 纳畜 安葬 祭祀 作灶 探病 谢土\"}");
            put("3-39", "{\"y\":\"嫁娶 会亲友 出行 解除 移徙 立券 交易 入宅 开市 动土 安床 安葬 挂匾 祭祀 拆卸 出火 开光 破土 启鑽\",\"j\":\"词讼 掘井\"}");
            put("3-40", "{\"y\":\"解除 扫舍 沐浴 祭祀 牧养 塞穴\",\"j\":\"嫁娶 安葬 安门 行丧\"}");
            put("3-41", "{\"y\":\"解除 移徙 入宅 动土 祈福 安床 祭祀 修造 造畜稠 拆卸 出火 伐木 开光 求嗣\",\"j\":\"嫁娶 出行 立券 纳财 开市 栽种 安葬 作灶\"}");
            put("3-42", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 造车器 祭祀 修造 治病\",\"j\":\"出行 开市 安床 安葬 作灶\"}");
            put("3-43", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 挂匾 祭祀 拆卸 出火 开光 求嗣\",\"j\":\"安葬 行丧 伐木 作梁\"}");
            put("3-44", "{\"y\":\"解除 扫舍 入学 沐浴 祭祀 牧养 治病 开池 开光 塑绘\",\"j\":\"嫁娶 出行 纳采 入宅 作灶\"}");
            put("3-45", "{\"y\":\"解除 扫舍 整手足甲 理发 沐浴 安葬 祭祀 入殓 移柩 破土\",\"j\":\"嫁娶 会亲友 出行 移徙 入宅 赴任 作灶 进人口\"}");
            put("3-46", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 动土 祈福 祭祀 修造\",\"j\":\"安葬 行丧 伐木 造庙 针灸 作梁\"}");
            put("3-47", "{\"y\":\"出行 解除 移徙 祈福 安床 纳畜 祭祀 拆卸 出火 伐木 开光 求嗣\",\"j\":\"嫁娶 纳采 动土 安葬 作灶 修坟 破土 造庙\"}");
            put("3-48", "{\"y\":\"嫁娶 会亲友 出行 扫舍 移徙 理发 入宅 动土 栽种 造车器 盖屋 归岫 安门 修造 造畜稠 拆卸 起基 安香 出火 雕刻 合嵴 开光\",\"j\":\"纳采 开市 安床 安葬 开渠 造庙\"}");
            put("3-49", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 祈福 栽种 安床 挂匾 祭祀 拆卸 出火 求嗣\",\"j\":\"词讼 安葬 作灶 行丧 伐木 塑绘\"}");
            put("3-50", "{\"y\":\"会亲友 解除 扫舍 移徙 入学 纳采 立券 交易 入宅 纳财 开市 订盟 安床 安门 挂匾 求医 治病 拆卸 合寿木 开生坟 入殓 修坟 安香 出火 破土 启鑽\",\"j\":\"出行 盖屋 安葬 祭祀 探病 上梁 谢土\"}");
            put("3-51", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 安床 安葬 挂匾 祭祀 拆卸 入殓 成服 出火 除服 进人口 开光 破土 启鑽 求嗣 上梁\",\"j\":\"\"}");
            put("3-52", "{\"y\":\"扫舍 馀事勿取 塞穴\",\"j\":\"诸事不宜\"}");
            put("3-53", "{\"y\":\"解除 扫舍 纳采 订盟 祈福 栽种 纳畜 祭祀 牧养 进人口 开光 求嗣\",\"j\":\"出行 入宅 盖屋 安葬 作灶 修坟 造桥\"}");
            put("3-54", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 架马 安葬 造畜稠 拆卸 入殓 移柩 成服 出火 除服 伐木 开光 造船 造庙 造桥\",\"j\":\"\"}");
            put("3-55", "{\"y\":\"嫁娶 出行 扫舍 移徙 纳采 立券 纳财 开市 订盟 动土 祈福 栽种 安床 祭祀 修造 造畜稠 拆卸 放水 起基 安香 掘井 开池 竖柱 造船 定磉\",\"j\":\"安葬 作灶 行丧 伐木 破土 斋醮\"}");
            put("3-56", "{\"y\":\"嫁娶 会亲友 移徙 入宅 祈福 盖屋 祭祀 治病 起基 安香\",\"j\":\"出行 开市 经络 安床 斋醮\"}");
            put("3-57", "{\"y\":\"解除 动土 安床 安门 祭祀 修造 拆卸 起基 入殓 开池 开渠 破土 启鑽 上梁\",\"j\":\"嫁娶 出行 移徙 入宅 赴任 栽种 作灶 进人口\"}");
            put("3-58", "{\"y\":\"出行 解除 移徙 纳采 入宅 开市 动土 栽种 安床 开厕 修造 起基 冠笄 雕刻 合嵴 上梁\",\"j\":\"安葬 安门 行丧 造庙\"}");
            put("3-59", "{\"y\":\"出行 解除 理发 安床 祭祀 造畜稠 拆卸 出火 伐木 合嵴 开光 上梁\",\"j\":\"嫁娶 动土 词讼 安葬 作灶 行丧 破土 造桥\"}");
            put("4-0", "{\"y\":\"会亲友 理发 纳采 裁衣 订盟 安床 沐浴 安葬 开生坟 移柩 冠笄 成服 除服 启鑽\",\"j\":\"嫁娶 出行 入宅 开市 动土 祈福 安门 修坟 上梁 谢土\"}");
            put("4-1", "{\"y\":\"会亲友 理发 补垣 结网 塞穴\",\"j\":\"嫁娶 移徙 入宅 安门\"}");
            put("4-2", "{\"y\":\"会亲友 出行 解除 纳采 立券 交易 开市 订盟 安床 安机械 盖屋 安葬 安门 拆卸 起基 入殓 修坟 移柩 成服 除服 伐木 立碑 平治道涂 启鑽 上梁 竖柱\",\"j\":\"嫁娶 入宅 动土 祈福 出火 破土\"}");
            put("4-3", "{\"y\":\"嫁娶 会亲友 出行 纳采 裁衣 订盟 安床 安葬 祭祀 入殓 进人口 启鑽\",\"j\":\"\"}");
            put("4-4", "{\"y\":\"会亲友 经络 祈福 安床 安机械 祭祀 冠笄 求嗣\",\"j\":\"嫁娶 开市 动土 安葬 作灶\"}");
            put("4-5", "{\"y\":\"会亲友 解除 立券 交易 纳财 开市 裁衣 开仓 安机械 盖屋 造仓 拆卸 冠笄 伐木 开光 上梁 竖柱 塑绘\",\"j\":\"嫁娶 出行 入宅 安葬\"}");
            put("4-6", "{\"y\":\"嫁娶 会亲友 出行 纳采 开市 安床 安葬 祭祀 移柩 成服 除服 结网 开光 启鑽 塑绘\",\"j\":\"入宅 动土 祈福 盖屋 探病 破土\"}");
            put("4-7", "{\"y\":\"会亲友 纳采 订盟 安床 造畜稠 作灶\",\"j\":\"开市 安葬\"}");
            put("4-8", "{\"y\":\"解除 扫舍 纳采 开市 祈福 安机械 沐浴 归岫 安葬 祭祀 修造 拆卸 放水 合寿木 开生坟 安碓磑 补垣 成服 出火 除服 开柱眼 启鑽 求嗣 塞穴 上梁 竖柱 谢土\",\"j\":\"嫁娶 动土 安床 作灶 破土 造船\"}");
            put("4-9", "{\"y\":\"嫁娶 出行 开市 安床 安葬 入殓 启鑽\",\"j\":\"动土 祈福 破土\"}");
            put("4-10", "{\"y\":\"嫁娶 会亲友 理发 经络 栽种 沐浴 牧养 补垣 开光 塞穴 塑绘\",\"j\":\"入宅 开市 动土 祈福 安床 开仓 安葬 作灶 破土 上梁\"}");
            put("4-11", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("4-12", "{\"y\":\"会亲友 解除 移徙 入学 纳采 立券 交易 开市 出货财 订盟 安床 开仓 纳畜 开厕 安葬 牧养 起基 入殓 问名 成服 除服 启鑽\",\"j\":\"入宅 出火 上梁 谢土 斋醮\"}");
            put("4-13", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("4-14", "{\"y\":\"会亲友 纳采 订盟 栽种 安机械 纳畜 盖屋 安葬 修造 造畜稠 起基 入殓 修坟 移柩 开光 立碑 启鑽 上梁 竖柱 造桥\",\"j\":\"嫁娶 入宅 开市 动土 祈福 出火 破土\"}");
            put("4-15", "{\"y\":\"嫁娶 纳采 立券 交易 纳财 开市 安床 纳畜 取渔 补垣 开池\",\"j\":\"入宅 动土 祈福 安葬 安门 修造 作灶 探病 掘井 上梁\"}");
            put("4-16", "{\"y\":\"会亲友 理发 冠笄 捕捉 结网 开光 求嗣\",\"j\":\"开市 动土 安葬 破土\"}");
            put("4-17", "{\"y\":\"会亲友 理发 入学 纳采 立券 交易 纳财 开市 裁衣 经络 祈福 安床 安机械 架马 安门 祭祀 造仓 冠笄 开光 开柱眼 求嗣 塑绘 作梁 合帐\",\"j\":\"嫁娶 出行 安葬 斋醮\"}");
            put("4-18", "{\"y\":\"嫁娶 会亲友 出行 解除 纳采 交易 订盟 安床 纳畜 安葬 牧养 入殓 移柩 成服 除服 进人口 启鑽 求嗣\",\"j\":\"开市 动土 祈福 修造 破土 谢土\"}");
            put("4-19", "{\"y\":\"会亲友 进人口\",\"j\":\"动土 词讼 安葬 伐木 塞穴 上梁\"}");
            put("4-20", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 架马 安葬 挂匾 修造 合寿木 开生坟 起基 入殓 移柩 冠笄 安香 成服 出火 除服 伐木 开光 开柱眼 求嗣\",\"j\":\"出货财 动土 安床 作灶 破土\"}");
            put("4-21", "{\"y\":\"嫁娶 解除 扫舍 理发 开市 安床 安葬 牧养 入殓 移柩 开光 启鑽\",\"j\":\"移徙 入宅 动土 祈福 栽种 修造 作灶 上梁\"}");
            put("4-22", "{\"y\":\"嫁娶 会亲友 裁衣 经络 栽种 纳畜 牧养 冠笄 补垣 捕捉 进人口 塞穴 塑绘\",\"j\":\"开市 动土 祈福 安葬 行丧\"}");
            put("4-23", "{\"y\":\"出行 移徙 立券 交易 入宅 开市 安床 挂匾 出火 开光 上梁\",\"j\":\"嫁娶 理发 乘船 安葬 作灶 行丧\"}");
            put("4-24", "{\"y\":\"会亲友 理发 立券 交易 纳财 开市 安床 沐浴 冠笄 教牛马 结网\",\"j\":\"嫁娶 出行 移徙 入宅 祈福\"}");
            put("4-25", "{\"y\":\"会亲友 理发 裁衣 安床 安门 结网 开光\",\"j\":\"嫁娶 出行 移徙 入宅 动土 祈福 栽种 安葬 冠笄 出火 伐木 上梁\"}");
            put("4-26", "{\"y\":\"会亲友 扫舍 立券 交易 纳财 开市 动土 经络 栽种 安床 安葬 祭祀 牧养 求医 修造 治病 拆卸 合寿木 开生坟 入殓 安香 进人口 启鑽\",\"j\":\"嫁娶 移徙 入宅 祈福 出火\"}");
            put("4-27", "{\"y\":\"嫁娶 出行 理发 立券 交易 纳财 开市 安床 安葬 牧养 修坟 开池 启鑽\",\"j\":\"入宅 动土 祈福 修造 作灶 掘井 上梁 谢土\"}");
            put("4-28", "{\"y\":\"纳采 入宅 开仓 祭祀 问名 求嗣 合帐\",\"j\":\"安床 安葬 作灶 斋醮\"}");
            put("4-29", "{\"y\":\"立券 交易 纳财 开市 安床 盖屋 修造 起基 开光 上梁\",\"j\":\"嫁娶 出行 移徙 入宅 赴任 动土 词讼 安葬 行丧 破土 谢土\"}");
            put("4-30", "{\"y\":\"会亲友 开市 安床 安葬 祭祀 启鑽\",\"j\":\"嫁娶 动土 破土\"}");
            put("4-31", "{\"y\":\"纳采 裁衣 安床 造仓 作灶 冠笄 进人口 开光 塞穴\",\"j\":\"嫁娶 出行 动土 栽种 安葬 修造 伐木 谢土 作梁\"}");
            put("4-32", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 安葬 求医 治病 启鑽\",\"j\":\"动土 破土\"}");
            put("4-33", "{\"y\":\"嫁娶 出行 纳采 立券 交易 开市 订盟 栽种 安床 造车器 牧养 拆卸 起基 入殓 移柩 成服 除服 开光 启鑽\",\"j\":\"入宅 动土 祈福 祭祀 修造 破土 上梁 斋醮\"}");
            put("4-34", "{\"y\":\"会亲友 出行 移徙 纳采 入宅 订盟 修造 上梁\",\"j\":\"开市 安葬\"}");
            put("4-35", "{\"y\":\"移徙 纳采 立券 交易 入宅 纳财 开市 订盟 栽种 安床 安门 挂匾 修造 拆卸 出火 进人口 开光\",\"j\":\"嫁娶 动土 安葬 作灶 行丧 破土 斋醮\"}");
            put("4-36", "{\"y\":\"会亲友 安葬 开光 启鑽 针灸\",\"j\":\"开市 动土 破土\"}");
            put("4-37", "{\"y\":\"会亲友 理发 祭祀 牧养 造畜稠 结网 开池 塑绘 畋猎\",\"j\":\"嫁娶 出行 入宅 开市 动土 祈福 安葬 作灶 上梁 谢土\"}");
            put("4-38", "{\"y\":\"解除 立券 开市 安机械 安葬 开光 启鑽 上梁\",\"j\":\"嫁娶 祈福\"}");
            put("4-39", "{\"y\":\"嫁娶 出行 立券 交易 纳财 栽种 安床 安葬 起基 入殓 移柩\",\"j\":\"入宅 动土 词讼 祈福 安门 挂匾 作灶 掘井 开池 破土 上梁 作梁\"}");
            put("4-40", "{\"y\":\"嫁娶 会亲友 安床 牧养 开光 求嗣 塑绘 针灸\",\"j\":\"移徙 立券 交易 入宅 开市 动土 安葬 分居 作灶 安香 出火 伐木\"}");
            put("4-41", "{\"y\":\"会亲友 理发 立券 交易 纳财 开市 安床 造仓 结网 开光 针灸\",\"j\":\"移徙 入宅 栽种\"}");
            put("4-42", "{\"y\":\"嫁娶 会亲友 出行 理发 纳采 开市 栽种 安床 牧养 入殓 移柩 开光 启鑽\",\"j\":\"入宅 祈福 安门 修造 作灶 上梁 谢土 斋醮\"}");
            put("4-43", "{\"y\":\"嫁娶 会亲友 纳采 订盟 经络 安机械 祭祀 冠笄 结网 进人口 求嗣\",\"j\":\"开市 动土 安葬 作灶 行丧\"}");
            put("4-44", "{\"y\":\"出行 解除 移徙 立券 交易 入宅 开市 栽种 安葬 牧养 修造 拆卸 起基 入殓 成服 出火 除服 伐木 开光 求嗣 上梁\",\"j\":\"置产 安床\"}");
            put("4-45", "{\"y\":\"出行 解除 扫舍 移徙 立券 交易 纳财 开市 出货财 祈福 栽种 安床 开仓 纳畜 祭祀 牧养 起基 补垣 开光 求嗣 塞穴 竖柱\",\"j\":\"入宅 安葬 安门 行丧 破土 斋醮\"}");
            put("4-46", "{\"y\":\"栽种 纳畜 牧养 补垣 进人口 开光 塞穴 塑绘\",\"j\":\"嫁娶 立券 交易 纳财 开市 动土 祈福 安葬 修造 上梁\"}");
            put("4-47", "{\"y\":\"出行 移徙 立券 交易 开市 安机械 出火 上梁\",\"j\":\"嫁娶 动土 安葬 造桥\"}");
            put("4-48", "{\"y\":\"会亲友 理发 立券 交易 纳财 开市 安葬 入殓 移柩 开光 启鑽\",\"j\":\"嫁娶 出行 移徙 入宅 祈福 安床 作灶 出火 上梁\"}");
            put("4-49", "{\"y\":\"会亲友 裁衣 经络 安机械 结网 塞穴 塑绘\",\"j\":\"嫁娶 开市 祈福 安葬 斋醮\"}");
            put("4-50", "{\"y\":\"解除 理发 立券 交易 开市 栽种 安床 安葬 挂匾 修造 拆卸 开光\",\"j\":\"嫁娶 移徙 入宅 祈福 盖屋 祭祀 作灶 探病 掘井 谢土\"}");
            put("4-51", "{\"y\":\"嫁娶 会亲友 出行 解除 入学 纳采 立券 交易 纳财 习艺 出货财 订盟 经络 祈福 安床 开仓 纳畜 安葬 祭祀 入殓 修坟 启鑽 求嗣\",\"j\":\"入宅 开市 动土 开光\"}");
            put("4-52", "{\"y\":\"嫁娶 会亲友 出行 纳采 祈福 安床 安机械 盖屋 安门 祭祀 牧养 修造 起基 冠笄 开光 上梁 畋猎\",\"j\":\"移徙 入宅 安葬 治病 作灶\"}");
            put("4-53", "{\"y\":\"会亲友 解除 纳采 立券 交易 纳财 开市 裁衣 订盟 经络 栽种 安床 安机械 冠笄 结网 开光 上梁 竖柱 塑绘 合帐\",\"j\":\"出行 入宅 安葬 作灶\"}");
            put("4-54", "{\"y\":\"嫁娶 出行 理发 交易 开市 安床 开光 塞穴\",\"j\":\"置产 入宅 动土 祈福 安葬 修造 出火 破土 上梁\"}");
            put("4-55", "{\"y\":\"置产 牧养 馀事勿取 结网 进人口 塞穴\",\"j\":\"诸事不宜\"}");
            put("4-56", "{\"y\":\"嫁娶 出行 解除 扫舍 移徙 入宅 纳财 开市 祈福 栽种 盖屋 安葬 祭祀 修造 造仓 作灶 拆卸 放水 起基 安香 补垣 出火 开光 塞穴 上梁 竖柱 造船\",\"j\":\"纳采 订盟 动土 安床 破土 谢土\"}");
            put("4-57", "{\"y\":\"嫁娶 出行 立券 交易 裁衣 安葬 牧养 造畜稠 开生坟 入殓 移柩 冠笄 成服 除服 进人口 纳婿 启鑽 塑绘\",\"j\":\"\"}");
            put("4-58", "{\"y\":\"会亲友 出行 解除 移徙 纳采 入宅 订盟 经络 栽种 安床 安机械 纳畜 修造 拆卸 安香 出火 开光 上梁\",\"j\":\"动土 祈福 安葬 祭祀 作灶 行丧 伐木 破土 谢土\"}");
            put("4-59", "{\"y\":\"出行 解除 开市 裁衣 开厕 挂匾 作灶 冠笄 补垣 开池 开光 塞穴 塑绘\",\"j\":\"\"}");
            put("5-0", "{\"y\":\"修饰垣墙 祈福 祭祀 入殓 移柩 平治道涂\",\"j\":\"嫁娶 入宅 安门 上梁\"}");
            put("5-1", "{\"y\":\"解除 修饰垣墙 祭祀 造畜稠 馀事勿取 平治道涂\",\"j\":\"嫁娶 入学 交易 入宅 开市 安葬\"}");
            put("5-2", "{\"y\":\"会亲友 出行 移徙 纳采 立券 交易 入宅 纳财 开市 赴任 裁衣 订盟 动土 经络 祈福 安床 开仓 安葬 祭祀 修造 拆卸 起基 入殓 移柩 安香 成服 除服 进人口 上梁 竖柱 谢土\",\"j\":\"治病 作灶 伐木 作梁\"}");
            put("5-3", "{\"y\":\"安葬 祭祀 馀事勿取 成服 除服 平治道涂\",\"j\":\"嫁娶 纳采 入宅 订盟 掘井\"}");
            put("5-4", "{\"y\":\"修饰垣墙 入殓 移柩 馀事勿取 平治道涂\",\"j\":\"嫁娶 移徙 入宅 开光\"}");
            put("5-5", "{\"y\":\"解除 作灶 馀事勿取 平治道涂\",\"j\":\"祈福 安葬 安门 祭祀\"}");
            put("5-6", "{\"y\":\"修饰垣墙 入殓 移柩 冠笄 成服 除服 平治道涂\",\"j\":\"盖屋 治病 作灶 探病\"}");
            put("5-7", "{\"y\":\"祭祀 作灶 馀事勿取 平治道涂\",\"j\":\"入宅 栽种 安床 安碓磑\"}");
            put("5-8", "{\"y\":\"扫舍 沐浴 安葬 入殓 移柩 馀事勿取 平治道涂 破土 启鑽\",\"j\":\"诸事不宜\"}");
            put("5-9", "{\"y\":\"整手足甲 理发 修饰垣墙 沐浴 祭祀 馀事勿取 平治道涂\",\"j\":\"出行 入宅 开市 词讼 修造\"}");
            put("5-10", "{\"y\":\"嫁娶 裁衣 沐浴 祭祀 冠笄 结网\",\"j\":\"置产 出货财 动土 栽种 开仓 安葬 掘井 破土\"}");
            put("5-11", "{\"y\":\"理发 修饰垣墙 沐浴 祭祀 作灶 平治道涂\",\"j\":\"嫁娶 祈福 栽种 安葬 安门 伐木 造桥 作梁\"}");
            put("5-12", "{\"y\":\"沐浴 入殓 移柩 成服 除服 平治道涂 破土\",\"j\":\"嫁娶 移徙 入宅 开市\"}");
            put("5-13", "{\"y\":\"祭祀 馀事勿取 平治道涂\",\"j\":\"嫁娶 开市\"}");
            put("5-14", "{\"y\":\"出行 移徙 立券 交易 入宅 纳财 开市 安床 纳畜 安葬 挂匾 入殓 移柩 开光\",\"j\":\"嫁娶 置产 动土 祈福 栽种 祭祀 作灶 破土\"}");
            put("5-15", "{\"y\":\"祭祀 修坟 馀事勿取 成服 除服 平治道涂\",\"j\":\"嫁娶 移徙 入宅 安葬 掘井\"}");
            put("5-16", "{\"y\":\"解除 修饰垣墙 祭祀 平治道涂\",\"j\":\"馀事勿取\"}");
            put("5-17", "{\"y\":\"祭祀 馀事勿取 平治道涂\",\"j\":\"嫁娶 祈福 安葬 掘井\"}");
            put("5-18", "{\"y\":\"嫁娶 安葬 祭祀 纳婿\",\"j\":\"入宅 栽种 盖屋 作灶\"}");
            put("5-19", "{\"y\":\"祭祀 作灶 馀事勿取 平治道涂\",\"j\":\"嫁娶 动土 安床 安葬 治病\"}");
            put("5-20", "{\"y\":\"扫舍 沐浴 安葬 入殓 成服 除服 平治道涂 破土\",\"j\":\"嫁娶 移徙 祈福 安床 盖屋 祭祀 伐木 作梁\"}");
            put("5-21", "{\"y\":\"嫁娶 扫舍 整手足甲 理发 修饰垣墙 沐浴 祭祀 作灶 平治道涂\",\"j\":\"出行 治病 合寿木 斋醮\"}");
            put("5-22", "{\"y\":\"解除 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("5-23", "{\"y\":\"出行 移徙 纳采 裁衣 订盟 沐浴 纳畜 牧养 上梁 竖柱\",\"j\":\"嫁娶 动土 安葬 安门\"}");
            put("5-24", "{\"y\":\"修饰垣墙 沐浴 祭祀 馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-25", "{\"y\":\"修饰垣墙 祭祀 造畜稠 馀事勿取 平治道涂\",\"j\":\"嫁娶 开市 安床 掘井\"}");
            put("5-26", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 栽种 安床 修造 拆卸 出火 开光 上梁\",\"j\":\"祈福 祭祀 作灶 伐木 掘井 谢土\"}");
            put("5-27", "{\"y\":\"祭祀 入殓 移柩 馀事勿取\",\"j\":\"入宅 动土 安门 修造 破土 上梁\"}");
            put("5-28", "{\"y\":\"解除 馀事勿取 平治道涂\",\"j\":\"移徙 入宅 栽种 治病 掘井 开池 造庙 针灸\"}");
            put("5-29", "{\"y\":\"作灶 平治道涂\",\"j\":\"祈福 安葬 安门 祭祀 馀事勿取\"}");
            put("5-30", "{\"y\":\"嫁娶 置产 修饰垣墙 祈福 祭祀 冠笄 平治道涂\",\"j\":\"立券 交易 开市 出货财 栽种 开仓 盖屋 作灶\"}");
            put("5-31", "{\"y\":\"祭祀 作灶 掘井 平治道涂\",\"j\":\"嫁娶 安葬\"}");
            put("5-32", "{\"y\":\"嫁娶 出行 移徙 理发 纳采 立券 交易 开市 裁衣 动土 栽种 纳畜 挂匾 修造 进人口 上梁\",\"j\":\"祈福 安床 安葬 祭祀 伐木\"}");
            put("5-33", "{\"y\":\"嫁娶 扫舍 修饰垣墙 沐浴 祭祀\",\"j\":\"安葬 行丧\"}");
            put("5-34", "{\"y\":\"嫁娶 祭祀 结网 畋猎\",\"j\":\"动土 治病 开渠 破土\"}");
            put("5-35", "{\"y\":\"修饰垣墙 沐浴 平治道涂\",\"j\":\"嫁娶 祈福 馀事勿取\"}");
            put("5-36", "{\"y\":\"修饰垣墙 沐浴 祭祀 馀事勿取 平治道涂\",\"j\":\"嫁娶 出行 入宅 安床\"}");
            put("5-37", "{\"y\":\"祭祀 造畜稠 结网\",\"j\":\"馀事勿取\"}");
            put("5-38", "{\"y\":\"会亲友 出行 移徙 立券 交易 修饰垣墙 入宅 纳财 开市 出货财 裁衣 动土 经络 拆卸 安香 进人口 平治道涂\",\"j\":\"安葬 作灶 修坟 行丧 探病 伐木 谢土 造庙 作梁\"}");
            put("5-39", "{\"y\":\"馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-40", "{\"y\":\"馀事勿取 平治道涂\",\"j\":\"嫁娶 出货财 开仓 安葬 探病 开光 造船\"}");
            put("5-41", "{\"y\":\"解除 作灶 平治道涂\",\"j\":\"出行 祈福 栽种 纳畜 安葬 安门 牧养 行丧 伐木 作梁\"}");
            put("5-42", "{\"y\":\"嫁娶 会亲友 立券 交易 置产 纳财 安机械 冠笄\",\"j\":\"开市 盖屋 治病 作灶\"}");
            put("5-43", "{\"y\":\"解除 修饰垣墙 祭祀 馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-44", "{\"y\":\"扫舍 移徙 沐浴 安葬 祭祀 平治道涂 破土\",\"j\":\"嫁娶 入宅 祈福 安床 作灶\"}");
            put("5-45", "{\"y\":\"扫舍 整手足甲 理发 修饰垣墙 沐浴 祭祀 平治道涂\",\"j\":\"嫁娶 出行 入宅 安门 修造 上梁\"}");
            put("5-46", "{\"y\":\"修饰垣墙 祭祀 平治道涂\",\"j\":\"嫁娶 开市 动土 安葬 修造 破土\"}");
            put("5-47", "{\"y\":\"修饰垣墙 沐浴 作灶 馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-48", "{\"y\":\"修饰垣墙 沐浴 祭祀 馀事勿取 平治道涂\",\"j\":\"嫁娶 出行 移徙 入宅 上梁 斋醮\"}");
            put("5-49", "{\"y\":\"造畜稠 馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-50", "{\"y\":\"会亲友 出行 移徙 纳采 立券 交易 修饰垣墙 入宅 纳财 开市 动土 开厕 修造 起基 安香 出火 开池 平治道涂 竖柱 造庙 定磉\",\"j\":\"开仓 盖屋 祭祀 造桥\"}");
            put("5-51", "{\"y\":\"修饰垣墙 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("5-52", "{\"y\":\"嫁娶 会亲友 裁衣 祭祀 冠笄 结网 进人口 平治道涂\",\"j\":\"移徙 入宅 安葬 治病 作灶 造庙\"}");
            put("5-53", "{\"y\":\"修饰垣墙 祭祀 馀事勿取 平治道涂\",\"j\":\"诸事不宜\"}");
            put("5-54", "{\"y\":\"嫁娶 祭祀 入殓 移柩 成服 除服 纳婿\",\"j\":\"入宅 动土 安床 作灶 开光\"}");
            put("5-55", "{\"y\":\"修饰垣墙 祭祀 作灶 馀事勿取 结网 平治道涂 畋猎\",\"j\":\"嫁娶 安床 治病\"}");
            put("5-56", "{\"y\":\"嫁娶 出行 开光\",\"j\":\"会亲友 移徙 开市 动土 纳畜 安葬 修造 起基 入殓 修坟 移柩 成服 除服 进人口 立碑 破土\"}");
            put("5-57", "{\"y\":\"嫁娶 整手足甲 理发 修饰垣墙 沐浴 祭祀 作灶 冠笄 平治道涂\",\"j\":\"出行 栽种 破土\"}");
            put("5-58", "{\"y\":\"嫁娶 祭祀 取渔 冠笄 捕捉 结网 畋猎\",\"j\":\"馀事勿取\"}");
            put("5-59", "{\"y\":\"修饰垣墙 沐浴 祭祀 作灶 平治道涂\",\"j\":\"嫁娶 置产 词讼 祈福 栽种 安葬 安门 治病 伐木 作梁\"}");
            put("6-0", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 动土 祈福 安床 安葬 祭祀 修造 拆卸 入殓 安香 成服 出火 除服 进人口 开光 破土 求嗣 谢土\",\"j\":\"开市 开仓 作灶 造船 斋醮\"}");
            put("6-1", "{\"y\":\"嫁娶 会亲友 出行 纳采 立券 交易 开市 赴任 裁衣 动土 经络 安葬 祭祀 修造 入殓 移柩 安香 成服 除服 进人口 开光 上梁 塑绘 斋醮\",\"j\":\"入宅 伐木\"}");
            put("6-2", "{\"y\":\"安葬 入殓 馀事勿取 成服 除服 破土 启鑽\",\"j\":\"置产 入宅 开市 祭祀 补垣 塞穴\"}");
            put("6-3", "{\"y\":\"会亲友 移徙 纳采 入宅 赴任 裁衣 订盟 动土 祈福 安床 安葬 祭祀 修造 拆卸 起基 入殓 移柩 安香 进人口 谢土\",\"j\":\"治病 作灶\"}");
            put("6-4", "{\"y\":\"会亲友 出行 移徙 纳采 订盟 动土 祈福 安床 安机械 盖屋 安葬 安门 祭祀 修造 拆卸 起基 入殓 安香 出火 开光 破土 上梁 竖柱 造船 造桥 定磉\",\"j\":\"置产 开市 掘井 造庙\"}");
            put("6-5", "{\"y\":\"嫁娶 会亲友 移徙 纳采 入宅 动土 祈福 安床 纳畜 祭祀 修造 安香 进人口 开光 上梁 竖柱 塑绘 斋醮\",\"j\":\"出行 开市 安葬 治病\"}");
            put("6-6", "{\"y\":\"嫁娶 置产 修饰垣墙 祭祀 冠笄\",\"j\":\"动土 经络 盖屋 作灶 探病\"}");
            put("6-7", "{\"y\":\"嫁娶 会亲友 纳采 立券 交易 入宅 纳财 裁衣 祈福 安床 安葬 挂匾 祭祀 修造 造仓 放水 入殓 移柩 安碓磑 安香 求嗣 谢土 合帐\",\"j\":\"栽种 伐木\"}");
            put("6-8", "{\"y\":\"祈福 沐浴 纳畜 安葬 祭祀 入殓 破土 求嗣 斋醮\",\"j\":\"嫁娶 出行 移徙 入宅 安床\"}");
            put("6-9", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 安葬 安门 挂匾 祭祀 拆卸 出火 进人口 开光 破土 求嗣 上梁\",\"j\":\"\"}");
            put("6-10", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 入宅 动土 祈福 安葬 祭祀 破土\",\"j\":\"开仓 盖屋 架马 作灶 开光\"}");
            put("6-11", "{\"y\":\"移徙 立券 交易 入宅 开市 动土 祈福 安床 修造 拆卸 出火 进人口 开光 求嗣\",\"j\":\"嫁娶 置产 栽种 安葬 修坟 行丧 破土\"}");
            put("6-12", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 动土 祈福 安机械 盖屋 安葬 安门 祭祀 修造 起基 开光 破土 普渡 上梁 竖柱 斋醮 定磉\",\"j\":\"立券 置产 开市 作灶 造桥\"}");
            put("6-13", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 沐浴 纳畜 安葬 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 启鑽 求嗣\",\"j\":\"\"}");
            put("6-14", "{\"y\":\"馀事勿取 捕捉 畋猎\",\"j\":\"交易 入宅 开市 安葬 祭祀\"}");
            put("6-15", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 动土 祈福 栽种 安床 纳畜 安葬 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 立碑 求嗣\",\"j\":\"\"}");
            put("6-16", "{\"y\":\"嫁娶 出行 移徙 入学 入宅 动土 祈福 盖屋 安葬 安门 祭祀 修造 造畜稠 起基 冠笄 安香 成服 出火 除服 雕刻 掘井 开光 破土 求嗣 上梁 竖柱\",\"j\":\"纳采 开市 订盟 经络 作灶 造船 造庙\"}");
            put("6-17", "{\"y\":\"嫁娶 会亲友 动土 祈福 纳畜 开厕 祭祀 牧养 造仓 起基 进人口 求嗣\",\"j\":\"出行 入宅 开市 栽种 安葬 安门 作灶 掘井\"}");
            put("6-18", "{\"y\":\"嫁娶 移徙 纳采 入宅 开市 动土 祈福 安机械 安葬 修造 入殓 移柩 成服 除服 伐木 破土 求嗣 谢土 造庙 斋醮\",\"j\":\"置产 盖屋 安门 作灶 探病 合嵴 开光\"}");
            put("6-19", "{\"y\":\"会亲友 出行 移徙 入学 立券 入宅 裁衣 订盟 经络 安机械 安葬 安门 祭祀 拆卸 放水 起基 入殓 移柩 成服 除服 开光 立碑 启鑽 上梁 竖柱 塑绘 定磉 合帐\",\"j\":\"伐木 作梁\"}");
            put("6-20", "{\"y\":\"交易 开市 祈福 安机械 纳畜 造车器 盖屋 安葬 安门 祭祀 开生坟 起基 雕刻 合嵴 开光 立碑 求嗣 谢土 斋醮 定磉\",\"j\":\"入宅 出货财 动土 开仓\"}");
            put("6-21", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 开市 动土 祈福 安床 安葬 安门 挂匾 祭祀 拆卸 出火 进人口 开光 破土 求嗣 上梁 谢土\",\"j\":\"\"}");
            put("6-22", "{\"y\":\"会亲友 出行 解除 移徙 纳采 入宅 订盟 动土 祈福 安床 安机械 盖屋 安葬 祭祀 修造 拆卸 起基 入殓 安香 出火 立碑 破土 斋醮 定磉\",\"j\":\"开市 作灶 伐木 作梁\"}");
            put("6-23", "{\"y\":\"入宅 动土 祈福 安床 纳畜 挂匾 祭祀 修造 拆卸 出火 伐木 开光 求嗣 上梁\",\"j\":\"嫁娶 理发 栽种 作灶 修坟 行丧\"}");
            put("6-24", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 盖屋 安葬 安门 祭祀 修造 起基 安香 出火 开光 破土 普渡 启鑽 上梁 竖柱 造庙 造桥\",\"j\":\"立券 纳财 开市 作灶\"}");
            put("6-25", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 纳畜 安葬 挂匾 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 求嗣\",\"j\":\"\"}");
            put("6-26", "{\"y\":\"安葬 入殓 移柩 捕捉 成服 除服 结网 立碑 破土 启鑽\",\"j\":\"嫁娶 移徙 入宅 盖屋 祭祀\"}");
            put("6-27", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 祈福 安床 安葬 挂匾 祭祀 拆卸 出火 伐木 开光 求嗣\",\"j\":\"置产 栽种 掘井\"}");
            put("6-28", "{\"y\":\"纳采 入宅 赴任 裁衣 订盟 安床 安葬 修造 拆卸 冠笄 出火 开光 塑绘 谢土\",\"j\":\"作灶 伐木 掘井 斋醮\"}");
            put("6-29", "{\"y\":\"嫁娶 移徙 入宅 动土 安床 纳畜 祭祀 修造 拆卸 出火 伐木 开光 上梁\",\"j\":\"出行 置产 开市 出货财 词讼 栽种 安葬 治病 行丧\"}");
            put("6-30", "{\"y\":\"会亲友 出行 纳采 纳财 裁衣 订盟 动土 安床 沐浴 纳畜 安门 挂匾 修造 拆卸 放水 安香 酬神 出火 伐木 进人口 开光 上梁 塑绘 造庙 斋醮 合帐\",\"j\":\"栽种 盖屋 安葬 作灶\"}");
            put("6-31", "{\"y\":\"嫁娶 出行 扫舍 移徙 入宅 纳财 祈福 安床 安门 挂匾 祭祀 修造 拆卸 出火 进人口 开光 求嗣\",\"j\":\"动土 安葬 行丧 伐木\"}");
            put("6-32", "{\"y\":\"开市 动土 安葬 祭祀 入殓 破土 斋醮\",\"j\":\"嫁娶 移徙 入宅\"}");
            put("6-33", "{\"y\":\"出行 立券 交易 开市 动土 祈福 安床 安机械 盖屋 安葬 挂匾 祭祀 修造 起基 成服 除服 立碑 破土 启鑽 斋醮 定磉\",\"j\":\"嫁娶 移徙 理发 入宅 作灶\"}");
            put("6-34", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 订盟 动土 祈福 安葬 祭祀 破土\",\"j\":\"作灶\"}");
            put("6-35", "{\"y\":\"会亲友 出行 解除 理发 入学 纳采 立券 交易 纳财 开市 订盟 动土 祈福 栽种 纳畜 祭祀 牧养 造仓 起基 开光 求嗣\",\"j\":\"嫁娶 置产 入宅 安葬 作灶 出火\"}");
            put("6-36", "{\"y\":\"嫁娶 移徙 入宅 动土 祈福 祭祀 斋醮\",\"j\":\"开市 安葬\"}");
            put("6-37", "{\"y\":\"会亲友 纳财 动土 祈福 栽种 开厕 牧养 修造 造仓 开光 求嗣 斋醮\",\"j\":\"移徙 入宅 祭祀 作灶 出火 进人口 开渠\"}");
            put("6-38", "{\"y\":\"安葬 入殓 移柩 成服 除服 破土 启鑽\",\"j\":\"移徙 入宅\"}");
            put("6-39", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 交易 纳财 订盟 动土 祈福 安床 安葬 祭祀 修造 拆卸 安香 成服 出火 除服 进人口 开光 斋醮\",\"j\":\"置产 词讼 栽种 掘井\"}");
            put("6-40", "{\"y\":\"纳采 订盟 动土 栽种 安机械 纳畜 安葬 牧养 修造 拆卸 入殓 移柩 成服 出火 除服 破土 求嗣 塑绘 造桥 斋醮\",\"j\":\"嫁娶 开市\"}");
            put("6-41", "{\"y\":\"嫁娶 会亲友 移徙 纳采 置产 入宅 订盟 安床 安机械 盖屋 挂匾 祭祀 拆卸 起基 安香 出火 定磉\",\"j\":\"出行 开市 安葬 行丧\"}");
            put("6-42", "{\"y\":\"解除 沐浴\",\"j\":\"诸事不宜\"}");
            put("6-43", "{\"y\":\"嫁娶 移徙 纳采 立券 入宅 开市 订盟 祈福 安机械 造车器 安葬 祭祀 破土\",\"j\":\"理发 纳畜 合寿木\"}");
            put("6-44", "{\"y\":\"解除 扫舍 交易 纳财 动土 祈福 纳畜 祭祀 开光\",\"j\":\"嫁娶 出行 置产 赴任 安床 安葬 作灶 进人口\"}");
            put("6-45", "{\"y\":\"移徙 入宅 祈福 安机械 纳畜 盖屋 安葬 安门 祭祀 作灶 起基 安香 出火 开光 启鑽 求嗣 上梁 竖柱 塑绘 斋醮\",\"j\":\"嫁娶 动土 破土\"}");
            put("6-46", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 动土 祈福 栽种 安床 纳畜 安葬 挂匾 祭祀 修造 拆卸 入殓 出火 进人口 开光 破土 启鑽 求嗣\",\"j\":\"\"}");
            put("6-47", "{\"y\":\"会亲友 移徙 纳采 立券 入宅 订盟 祈福 安床 安机械 挂匾 祭祀 牧养 拆卸 安香 出火 教牛马 开光 上梁 竖柱\",\"j\":\"嫁娶 安葬 修坟 行丧 破土\"}");
            put("6-48", "{\"y\":\"出行 解除 动土 栽种 安床 纳畜 安葬 祭祀 修造 拆卸 起基 入殓 成服 出火 除服 伐木 进人口 开光 破土 求嗣 作梁\",\"j\":\"嫁娶 移徙\"}");
            put("6-49", "{\"y\":\"嫁娶 出行 移徙 立券 入宅 开市 动土 祈福 安机械 造车器 安葬 祭祀 修造 安香 出火 开光 破土\",\"j\":\"纳采 订盟 词讼 架马 开渠\"}");
            put("6-50", "{\"y\":\"安葬 入殓 成服 除服 破土 启鑽\",\"j\":\"馀事勿取\"}");
            put("6-51", "{\"y\":\"会亲友 出行 移徙 纳采 立券 入宅 纳财 开市 订盟 动土 祈福 盖屋 安门 祭祀 修造 起基 安香 出火 教牛马 破土 上梁 竖柱\",\"j\":\"嫁娶 置产 安葬 掘井 造船\"}");
            put("6-52", "{\"y\":\"入宅 动土 安床 纳畜 安葬 挂匾 祭祀 拆卸 入殓 出火 开光 破土\",\"j\":\"嫁娶 置产 开市 作灶 伐木 作梁\"}");
            put("6-53", "{\"y\":\"祭祀 馀事勿取 安碓磑 结网\",\"j\":\"嫁娶 安葬\"}");
            put("6-54", "{\"y\":\"出行 移徙 纳采 立券 交易 入宅 开市 订盟 祈福 安床 造车器 安葬 安门 祭祀 出火 求嗣 谢土\",\"j\":\"动土 栽种 盖屋 作灶 开光\"}");
            put("6-55", "{\"y\":\"嫁娶 解除 移徙 纳采 入宅 裁衣 订盟 动土 祈福 栽种 安床 安葬 修造 拆卸 放水 修坟 移柩 冠笄 安香 开光 立碑 启鑽 求嗣 竖柱 塑绘 谢土 斋醮\",\"j\":\"赴任\"}");
            put("6-56", "{\"y\":\"解除 沐浴 安葬 祭祀 移柩 馀事勿取 破土 谢土\",\"j\":\"嫁娶 入宅 开光 上梁 斋醮\"}");
            put("6-57", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 动土 祈福 安葬 祭祀 破土\",\"j\":\"安门\"}");
            put("6-58", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 交易 入宅 纳财 订盟 祈福 安床 安葬 挂匾 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 启鑽 求嗣\",\"j\":\"动土 掘井 破土\"}");
            put("6-59", "{\"y\":\"扫舍 沐浴 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("7-0", "{\"y\":\"解除 纳采 动土 祈福 安葬 祭祀 破土\",\"j\":\"嫁娶 移徙 入宅\"}");
            put("7-1", "{\"y\":\"安葬 祭祀 入殓 移柩 馀事勿取 捕捉 成服 除服 破土\",\"j\":\"嫁娶 交易 入宅 开市\"}");
            put("7-2", "{\"y\":\"会亲友 沐浴 安葬 拆卸 起基 移柩 冠笄 捕捉 成服 除服 开光 启鑽 塑绘\",\"j\":\"嫁娶 入宅 祭祀 作灶\"}");
            put("7-3", "{\"y\":\"嫁娶 出行 动土 祈福 安床 纳畜 祭祀 修造 拆卸 入殓 开光 破土 求嗣 上梁\",\"j\":\"移徙 理发 交易 入宅 开市 作灶 伐木 掘井\"}");
            put("7-4", "{\"y\":\"嫁娶 纳采 订盟 安床 安葬 祭祀 入殓 移柩 成服 除服 进人口 开光 立碑 启鑽 塑绘\",\"j\":\"交易 开市 作灶 破土\"}");
            put("7-5", "{\"y\":\"嫁娶 会亲友 祈福 安床 祭祀 冠笄 捕捉 伐木 进人口 掘井 开柱眼 求嗣 斋醮 作梁 畋猎\",\"j\":\"安葬 开生坟 行丧 破土\"}");
            put("7-6", "{\"y\":\"嫁娶 会亲友 出行 纳采 赴任 裁衣 订盟 动土 祈福 栽种 安床 沐浴 安葬 安门 祭祀 修造 拆卸 入殓 移柩 捕捉 伐木 破土 上梁 竖柱 谢土 斋醮\",\"j\":\"入宅 开市 盖屋 作灶\"}");
            put("7-7", "{\"y\":\"嫁娶 出行 移徙 纳采 动土 祈福 安葬 祭祀 修造 破土\",\"j\":\"入宅 开市 斋醮\"}");
            put("7-8", "{\"y\":\"扫舍 纳采 裁衣 订盟 动土 祈福 沐浴 安葬 祭祀 修造 拆卸 起基 移柩 出火 伐木 开柱眼 上梁 谢土 斋醮 合帐\",\"j\":\"立券 开市 安床 作灶\"}");
            put("7-9", "{\"y\":\"出行 纳采 祈福 盖屋 安葬 安门 祭祀 起基 入殓 求嗣 斋醮 定磉\",\"j\":\"嫁娶 纳财 开市 出火\"}");
            put("7-10", "{\"y\":\"出行 解除 裁衣 安葬 祭祀 入殓 移柩 成服 除服 开光 破土 启鑽 塑绘\",\"j\":\"嫁娶 入宅 动土 架马 修造 拆卸 出火 伐木 开柱眼 上梁\"}");
            put("7-11", "{\"y\":\"出行 移徙 纳采 入宅 订盟 动土 祈福 盖屋 安门 祭祀 修造 拆卸 起基 冠笄 安香 出火 开池 上梁 竖柱 斋醮 定磉\",\"j\":\"嫁娶 开市 安葬 合寿木\"}");
            put("7-12", "{\"y\":\"解除 整手足甲 沐浴 安葬 祭祀 入殓 移柩 破土 启鑽\",\"j\":\"嫁娶 移徙 交易 入宅 开市 栽种 安门 作灶\"}");
            put("7-13", "{\"y\":\"解除 安葬 祭祀 入殓 捕捉 结网 破土 普渡 畋猎\",\"j\":\"嫁娶 交易 入宅 开市\"}");
            put("7-14", "{\"y\":\"解除 动土 安葬 拆卸 起基 修坟 移柩 开光 立碑 破土 启鑽 上梁\",\"j\":\"嫁娶 出行 移徙 置产 入宅 安床 祭祀 作灶 出火 进人口\"}");
            put("7-15", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 祈福 安床 纳畜 安葬 祭祀 起基 安香 捕捉 出火 开光 纳婿 求嗣 上梁 竖柱 造庙 斋醮\",\"j\":\"开市 合寿木 掘井 破土\"}");
            put("7-16", "{\"y\":\"解除 安床 纳畜 安葬 修造 拆卸 入殓 开光 启鑽\",\"j\":\"嫁娶 移徙 入宅 开市 动土 栽种 分居 作灶 安香 出火 掘井 破土\"}");
            put("7-17", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 盖屋 安门 祭祀 修造 起基 安碓磑 安香 出火 合嵴 求嗣 上梁 斋醮\",\"j\":\"出行 安葬 行丧 掘井 破土\"}");
            put("7-18", "{\"y\":\"嫁娶 移徙 动土 祈福 安床 祭祀 修造 进人口 开光 求嗣\",\"j\":\"出行 入宅 开市 栽种 安葬 安门 作灶 掘井\"}");
            put("7-19", "{\"y\":\"嫁娶 会亲友 出行 入学 纳采 习艺 订盟 安葬 牧养 入殓 移柩 捕捉 进人口 启鑽\",\"j\":\"入宅 开市 动土 盖屋 开光\"}");
            put("7-20", "{\"y\":\"嫁娶 移徙 理发 入学 赴任 裁衣 动土 祈福 架马 安葬 祭祀 修造 拆卸 放水 起基 入殓 移柩 冠笄 出火 伐木 开光 求嗣 塑绘 谢土 斋醮 作梁 定磉 合帐\",\"j\":\"入宅 安门\"}");
            put("7-21", "{\"y\":\"解除 纳采 订盟 祈福 安葬 祭祀 求医 取渔 治病 起基 入殓 开光 启鑽 求嗣 谢土 造船 斋醮 定磉\",\"j\":\"开市 动土 掘井 开池\"}");
            put("7-22", "{\"y\":\"嫁娶 会亲友 解除 裁衣 动土 祈福 安床 架马 祭祀 修造 放水 起基 冠笄 伐木 进人口 开光 求嗣 上梁 竖柱 作梁 合帐\",\"j\":\"\"}");
            put("7-23", "{\"y\":\"沐浴 祭祀 取渔 馀事勿取 捕捉 结网 畋猎\",\"j\":\"嫁娶 交易 开市 安葬 行丧\"}");
            put("7-24", "{\"y\":\"解除 理发 安葬 祭祀 入殓 破土\",\"j\":\"嫁娶 移徙 置产 入宅 开市 安门 作灶 出火 斋醮\"}");
            put("7-25", "{\"y\":\"纳畜 安葬 祭祀 牧养 入殓 移柩 捕捉 成服 除服 破土 启鑽 畋猎\",\"j\":\"嫁娶 纳采 入宅 开市 订盟\"}");
            put("7-26", "{\"y\":\"解除 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("7-27", "{\"y\":\"会亲友 立券 交易 纳财 开市 习艺 经络 祈福 栽种 安机械 开厕 安葬 祭祀 牧养 求医 治病 出火 结网 开池 破土 启鑽 求嗣 造庙 斋醮 畋猎\",\"j\":\"嫁娶 伐木 掘井 开光 作梁\"}");
            put("7-28", "{\"y\":\"解除 整手足甲 理发 祭祀 进人口 针灸\",\"j\":\"嫁娶 出行 移徙 入宅 开市 动土 安葬 修造 作灶 掘井 开池 破土 上梁 造船\"}");
            put("7-29", "{\"y\":\"嫁娶 移徙 纳采 入宅 裁衣 动土 安床 祭祀 修造 拆卸 放水 冠笄 安香 捕捉 伐木 结网 进人口 开光 上梁 竖柱 塑绘 畋猎\",\"j\":\"出行 开市 安葬 修坟\"}");
            put("7-30", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 订盟 动土 祈福 安床 纳畜 安葬 祭祀 拆卸 出火 开光 破土 谢土\",\"j\":\"交易 开市 盖屋 安门 作灶 伐木 上梁\"}");
            put("7-31", "{\"y\":\"嫁娶 解除 移徙 纳采 入宅 裁衣 订盟 祈福 安床 安葬 安门 祭祀 取渔 入殓 移柩 冠笄 安香 捕捉 酬神 出火 伐木 启鑽 合帐\",\"j\":\"开市 动土 栽种 作灶\"}");
            put("7-32", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 祈福 栽种 安葬 祭祀 出火 伐木 开光 破土 求嗣 谢土\",\"j\":\"交易 纳财 开市 安床 盖屋 作灶 上梁 造船\"}");
            put("7-33", "{\"y\":\"嫁娶 出行 移徙 纳采 祈福 祭祀 求医\",\"j\":\"开市 动土 破土\"}");
            put("7-34", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 订盟 动土 祈福 栽种 安床 安葬 挂匾 祭祀 修造 拆卸 入殓 移柩 出火 进人口 开光 破土 求嗣 谢土\",\"j\":\"立券 开市 合寿木 造船\"}");
            put("7-35", "{\"y\":\"出行 移徙 纳采 入宅 订盟 动土 祈福 祭祀 修造\",\"j\":\"开市 安葬\"}");
            put("7-36", "{\"y\":\"解除 整手足甲 祈福 安床 沐浴 安葬 祭祀 入殓 移柩 破土 启鑽 谢土\",\"j\":\"嫁娶 出行 移徙 入宅 开市 安门 作灶 出火 伐木 斋醮\"}");
            put("7-37", "{\"y\":\"安葬 入殓 捕捉 结网 破土\",\"j\":\"嫁娶 入宅\"}");
            put("7-38", "{\"y\":\"解除 动土 安葬 安门 牧养 修造 拆卸 修坟 移柩 开光 破土 竖柱\",\"j\":\"嫁娶 移徙 入宅 开市 祈福 安床 祭祀 探病 出火\"}");
            put("7-39", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 动土 祈福 安葬 祭祀 破土\",\"j\":\"开市 赴任\"}");
            put("7-40", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 订盟 栽种 安葬 祭祀 修造 拆卸 入殓 出火 伐木 开光\",\"j\":\"交易 开市 动土 安门 作灶 破土\"}");
            put("7-41", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 祭祀 修造\",\"j\":\"开市 安葬\"}");
            put("7-42", "{\"y\":\"整手足甲 理发 沐浴 安葬 入殓 修坟 捕捉 成服 除服 立碑 破土 启鑽 谢土 畋猎\",\"j\":\"嫁娶 纳采 开市 订盟 盖屋 安门 上梁 斋醮\"}");
            put("7-43", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 动土 祈福 栽种 安床 纳畜 安葬 祭祀 拆卸 出火 破土 启鑽 上梁\",\"j\":\"理发 立券 开市 作灶\"}");
            put("7-44", "{\"y\":\"出行 移徙 入宅 动土 祈福 安葬 修造 破土 斋醮\",\"j\":\"嫁娶 纳采 开市 安床 开光\"}");
            put("7-45", "{\"y\":\"解除 入宅 祈福 安床 纳畜 安葬 安门 祭祀 修造 拆卸 出火 开光 启鑽 求嗣\",\"j\":\"交易 纳财 开市 动土 挂匾 伐木 掘井 破土\"}");
            put("7-46", "{\"y\":\"嫁娶 会亲友 解除 纳采 订盟 动土 祈福 纳畜 安葬 祭祀 牧养 求医 治病 入殓 捕捉 开光 破土 斋醮\",\"j\":\"移徙 入宅 盖屋 架马\"}");
            put("7-47", "{\"y\":\"出行 移徙 入宅 动土 祈福 安床 祭祀 修造 拆卸 起基 出火 伐木 开光 求嗣\",\"j\":\"嫁娶 交易 开市 安葬 修坟 行丧\"}");
            put("7-48", "{\"y\":\"理发 沐浴 安葬 入殓 移柩 捕捉 启鑽\",\"j\":\"嫁娶 入宅 动土 作灶 出火 破土 上梁\"}");
            put("7-49", "{\"y\":\"安葬 祭祀 入殓 移柩 馀事勿取 破土 塞穴\",\"j\":\"诸事不宜\"}");
            put("7-50", "{\"y\":\"沐浴 安葬 入殓 捕捉 成服 除服 破土 启鑽\",\"j\":\"嫁娶 入宅 开市 安床 祭祀 探病 上梁\"}");
            put("7-51", "{\"y\":\"安葬 祭祀 开生坟 入殓 移柩 成服 除服 破土 启鑽\",\"j\":\"馀事勿取\"}");
            put("7-52", "{\"y\":\"嫁娶 解除 移徙 纳采 订盟 祈福 安床 安葬 祭祀 求医 治病 入殓 移柩 捕捉 成服 除服 伐木 结网 开光 立碑 塑绘 谢土 作梁 畋猎\",\"j\":\"开市 动土 破土 造庙\"}");
            put("7-53", "{\"y\":\"解除 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("7-54", "{\"y\":\"嫁娶 出行 移徙 理发 入宅 裁衣 沐浴 安葬 祭祀 放水 入殓 移柩 捕捉 成服 除服 启鑽 畋猎\",\"j\":\"开市 动土 盖屋 破土\"}");
            put("7-55", "{\"y\":\"嫁娶 动土 安葬 入殓 移柩 破土\",\"j\":\"入宅 开市 裁衣 安床 作灶 上梁\"}");
            put("7-56", "{\"y\":\"解除 扫舍 理发 沐浴 安葬 祭祀 取渔 入殓 修坟 移柩 捕捉 成服 除服 结网 立碑 启鑽 谢土 畋猎\",\"j\":\"嫁娶 入宅 安床 作灶\"}");
            put("7-57", "{\"y\":\"解除 扫舍 整手足甲 安葬 祭祀 取渔 入殓 移柩 捕捉 成服 除服 启鑽 谢土 斋醮 畋猎\",\"j\":\"动土 破土\"}");
            put("7-58", "{\"y\":\"嫁娶 移徙 纳采 入宅 动土 安葬 求医 修造 治病 破土\",\"j\":\"开市 开光\"}");
            put("7-59", "{\"y\":\"沐浴 祭祀 取渔 馀事勿取 捕捉 结网 畋猎\",\"j\":\"嫁娶 开市 安葬 行丧 启鑽\"}");
            put("8-0", "{\"y\":\"破屋 祭祀 馀事勿取 坏垣\",\"j\":\"移徙 入宅 出货财 开仓\"}");
            put("8-1", "{\"y\":\"破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-2", "{\"y\":\"破屋 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 纳采 入宅 订盟 祈福 安葬\"}");
            put("8-3", "{\"y\":\"沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"出行 移徙 入宅 栽种\"}");
            put("8-4", "{\"y\":\"沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 出行 入宅 安葬 上梁\"}");
            put("8-5", "{\"y\":\"解除 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-6", "{\"y\":\"破屋 治病 馀事勿取 坏垣\",\"j\":\"移徙 入宅\"}");
            put("8-7", "{\"y\":\"解除 破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-8", "{\"y\":\"解除 扫舍 理发 沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 安葬\"}");
            put("8-9", "{\"y\":\"破屋 求医 治病 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-10", "{\"y\":\"解除 沐浴 破屋 祭祀 求医 治病 馀事勿取 坏垣\",\"j\":\"开市 祈福 安葬 斋醮\"}");
            put("8-11", "{\"y\":\"解除 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-12", "{\"y\":\"沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 移徙 入宅\"}");
            put("8-13", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-14", "{\"y\":\"沐浴 破屋 馀事勿取 坏垣\",\"j\":\"开市 斋醮\"}");
            put("8-15", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-16", "{\"y\":\"解除 沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 开市\"}");
            put("8-17", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-18", "{\"y\":\"沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 出行 移徙 入宅 盖屋 探病\"}");
            put("8-19", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-20", "{\"y\":\"解除 扫舍 沐浴 破屋 祭祀 求医 治病 馀事勿取 坏垣\",\"j\":\"入宅 开市 安葬\"}");
            put("8-21", "{\"y\":\"破屋 祭祀 治病 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-22", "{\"y\":\"解除 沐浴 破屋 祭祀 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 交易 入宅 开市 安葬\"}");
            put("8-23", "{\"y\":\"解除 沐浴 破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-24", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣 畋猎\",\"j\":\"嫁娶 入宅\"}");
            put("8-25", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-26", "{\"y\":\"破屋 治病 馀事勿取 坏垣\",\"j\":\"安葬 行丧\"}");
            put("8-27", "{\"y\":\"破屋 祭祀 治病 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-28", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-29", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 安葬\"}");
            put("8-30", "{\"y\":\"破屋 祭祀 求医 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-31", "{\"y\":\"解除 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"开市 动土 破土\"}");
            put("8-32", "{\"y\":\"破屋 求医\",\"j\":\"诸事不宜\"}");
            put("8-33", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 开光\"}");
            put("8-34", "{\"y\":\"解除 祭祀 求医 治病 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("8-35", "{\"y\":\"解除 沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"安葬 开光\"}");
            put("8-36", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("8-37", "{\"y\":\"解除 破屋 馀事勿取 坏垣\",\"j\":\"嫁娶 安葬\"}");
            put("8-38", "{\"y\":\"沐浴 破屋 治病 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-39", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣\",\"j\":\"移徙 入宅\"}");
            put("8-40", "{\"y\":\"解除 破屋 祭祀 坏垣\",\"j\":\"馀事勿取\"}");
            put("8-41", "{\"y\":\"解除 破屋 祭祀 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 安葬\"}");
            put("8-42", "{\"y\":\"破屋 治病 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-43", "{\"y\":\"破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 开市 斋醮\"}");
            put("8-44", "{\"y\":\"解除 扫舍 破屋 祭祀 治病 坏垣\",\"j\":\"馀事勿取\"}");
            put("8-45", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"嫁娶 移徙 入宅 开市\"}");
            put("8-46", "{\"y\":\"解除 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-47", "{\"y\":\"解除 沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"安葬 行丧\"}");
            put("8-48", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-49", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 出行\"}");
            put("8-50", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-51", "{\"y\":\"\",\"j\":\"探病 馀事勿取\"}");
            put("8-52", "{\"y\":\"解除 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-53", "{\"y\":\"破屋 祭祀 馀事勿取 坏垣\",\"j\":\"嫁娶 安葬\"}");
            put("8-54", "{\"y\":\"沐浴 破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-55", "{\"y\":\"破屋 馀事勿取 坏垣\",\"j\":\"嫁娶 开市 安葬\"}");
            put("8-56", "{\"y\":\"破屋 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 开市\"}");
            put("8-57", "{\"y\":\"破屋 坏垣\",\"j\":\"诸事不宜\"}");
            put("8-58", "{\"y\":\"解除 沐浴 破屋 祭祀 求医 治病 馀事勿取 坏垣\",\"j\":\"嫁娶 开市\"}");
            put("8-59", "{\"y\":\"破屋 祭祀 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("9-0", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 动土 安葬 祭祀 破土 上梁\",\"j\":\"祈福 斋醮\"}");
            put("9-1", "{\"y\":\"出行 动土 安床 开厕 祭祀 修造 造畜稠 放水 结网 掘井 开池 开光 破土 塑绘 斋醮\",\"j\":\"入宅 出火\"}");
            put("9-2", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 动土 安葬 破土 上梁\",\"j\":\"祈福 祭祀\"}");
            put("9-3", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 开市 祈福 栽种 安床 安葬 祭祀 安香 出火 伐木 开光 求嗣\",\"j\":\"理发 动土 作灶 掘井 开池 破土\"}");
            put("9-4", "{\"y\":\"嫁娶 出行 解除 交易 入宅 开市 订盟 安床 挂匾 祭祀 拆卸 起基 入殓 移柩 成服 除服 开光 开柱眼 破土 塑绘 谢土\",\"j\":\"盖屋 冠笄 掘井 造桥\"}");
            put("9-5", "{\"y\":\"会亲友 纳财 经络 安床 安门 祭祀 牧养 放水 冠笄 割蜜 进人口 求嗣 畋猎\",\"j\":\"嫁娶 纳采 入宅 订盟 祈福 安葬 斋醮\"}");
            put("9-6", "{\"y\":\"出行 解除 移徙 纳采 赴任 裁衣 订盟 动土 祈福 栽种 安床 纳畜 安葬 祭祀 修造 拆卸 入殓 移柩 冠笄 成服 除服 伐木 开光 破土 启鑽 上梁 竖柱 塑绘 斋醮\",\"j\":\"盖屋 治病\"}");
            put("9-7", "{\"y\":\"出行 理发 安床 架马 开厕 祭祀 入殓 修坟 移柩 成服 除服 伐木 开光 开柱眼 立碑 破土 启鑽 塑绘 作梁 畋猎\",\"j\":\"开市 安葬 安门 作灶 造桥\"}");
            put("9-8", "{\"y\":\"嫁娶 出行 纳采 订盟 安葬 入殓 移柩 成服 除服 开光 立碑 纳婿 启鑽 塑绘\",\"j\":\"入宅 安床\"}");
            put("9-9", "{\"y\":\"出行 移徙 纳采 入宅 开市 订盟 动土 祈福 安葬 祭祀 修造 安香 出火 破土\",\"j\":\"会亲友 安床 作灶 造船\"}");
            put("9-10", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 赴任 订盟 动土 祈福 安床 安机械 安葬 祭祀 造仓 拆卸 入殓 移柩 安香 进人口 立碑 破土 求嗣 上梁 谢土\",\"j\":\"出货财 开光\"}");
            put("9-11", "{\"y\":\"沐浴 取渔 捕捉 结网 畋猎\",\"j\":\"嫁娶 入宅 安葬 祭祀 作灶\"}");
            put("9-12", "{\"y\":\"嫁娶 会亲友 出行 解除 移徙 入宅 动土 祈福 栽种 安床 纳畜 安门 祭祀 牧养 修造 拆卸 出火 进人口 开光 求嗣 上梁 竖柱\",\"j\":\"\"}");
            put("9-13", "{\"y\":\"嫁娶 出行 交易 裁衣 祈福 安机械 祭祀 放水 掘井 开池 开光 求嗣 塑绘 斋醮 合帐\",\"j\":\"理发 安葬 作灶 行丧 造桥\"}");
            put("9-14", "{\"y\":\"嫁娶 出行 移徙 理发 立券 交易 入宅 开市 动土 栽种 安床 挂匾 修造 拆卸 出火 开光 作梁\",\"j\":\"纳畜 祭祀 伐木\"}");
            put("9-15", "{\"y\":\"纳采 立券 入宅 开市 订盟 祈福 安葬 挂匾 祭祀 安香 出火 启鑽 造桥\",\"j\":\"嫁娶 动土 安床 掘井 破土\"}");
            put("9-16", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 挂匾 修造 拆卸 入殓 成服 出火 除服 伐木 进人口 开光 破土 求嗣 上梁\",\"j\":\"\"}");
            put("9-17", "{\"y\":\"会亲友 纳采 立券 交易 纳财 订盟 栽种 纳畜 牧养\",\"j\":\"嫁娶 入宅 开市 祈福 安葬\"}");
            put("9-18", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 纳财 开市 动土 栽种 安床 纳畜 挂匾 祭祀 修造 拆卸 出火 开光\",\"j\":\"安葬 探病\"}");
            put("9-19", "{\"y\":\"理发 立券 交易 纳财 安床 放水 冠笄 出火 结网 掘井 开池 畋猎\",\"j\":\"动土 安葬 安门 行丧 成服 破土\"}");
            put("9-20", "{\"y\":\"嫁娶 出行 移徙 立券 交易 入宅 开市 动土 安葬 修造 拆卸 移柩 成服 出火 除服 开光 破土 启鑽\",\"j\":\"祈福 安床 纳畜 伐木\"}");
            put("9-21", "{\"y\":\"嫁娶 入宅 开市 动土 盖屋 安葬 祭祀 修造 拆卸 起基 入殓 移柩 冠笄 成服 除服 开池 破土 塞穴 上梁\",\"j\":\"栽种 安床 治病 作灶\"}");
            put("9-22", "{\"y\":\"嫁娶 出行 移徙 立券 交易 开市 动土 安床 祭祀 修造 入殓 移柩 冠笄 进人口 破土\",\"j\":\"安葬 作灶 开光 斋醮\"}");
            put("9-23", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("9-24", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 栽种 安床 造车器 安葬 挂匾 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 破土 求嗣\",\"j\":\"立券 开市\"}");
            put("9-25", "{\"y\":\"嫁娶 出行 经络 安床 安机械 祭祀 治病 入殓 结网 开光 破土 塞穴 塑绘\",\"j\":\"开市 安门 作灶 掘井\"}");
            put("9-26", "{\"y\":\"嫁娶 出行 入学 纳采 立券 交易 纳财 开市 出货财 订盟 动土 栽种 开仓 纳畜 安葬 牧养 开光 立碑 破土 启鑽\",\"j\":\"移徙 入宅 祭祀 作灶 谢土\"}");
            put("9-27", "{\"y\":\"嫁娶 出行 立券 交易 入宅 纳财 开市 祈福 安葬 入殓 移柩 冠笄 成服 除服 雕刻 开柱眼 启鑽 造桥 斋醮\",\"j\":\"订盟 动土 安床 开池 破土\"}");
            put("9-28", "{\"y\":\"嫁娶 出行 移徙 理发 纳采 入宅 订盟 动土 栽种 安床 纳畜 安葬 挂匾 祭祀 修造 拆卸 入殓 成服 出火 除服 进人口 开光 破土 作梁\",\"j\":\"开市 掘井 开渠 造船 造桥\"}");
            put("9-29", "{\"y\":\"嫁娶 会亲友 纳采 纳财 订盟 动土 安床 修造 拆卸 起基 纳婿 上梁 竖柱\",\"j\":\"出行 祈福 安葬 作灶\"}");
            put("9-30", "{\"y\":\"嫁娶 会亲友 出行 解除 移徙 入学 纳采 入宅 纳财 开市 订盟 动土 祈福 安床 安门 祭祀 牧养 修造 造畜稠 起基 雕刻 开池 造庙\",\"j\":\"出货财 开仓 盖屋 上梁 造船\"}");
            put("9-31", "{\"y\":\"出行 移徙 入宅 祈福 安床 安机械 祭祀 移柩 冠笄 安香 成服 除服 启鑽 斋醮\",\"j\":\"栽种 安门 治病 作灶 开光\"}");
            put("9-32", "{\"y\":\"嫁娶 移徙 纳采 立券 交易 入宅 纳财 开市 裁衣 订盟 动土 栽种 盖屋 安葬 安门 牧养 修造 起基 入殓 安香 成服 出火 除服 掘井 开池 开光 立碑 破土 畋猎\",\"j\":\"祈福 安床 祭祀 谢土 造庙\"}");
            put("9-33", "{\"y\":\"嫁娶 出行 解除 纳采 入宅 纳财 订盟 动土 祈福 沐浴 安葬 安门 修造 放水 移柩 安香 开光 破土 求嗣 上梁 竖柱 塑绘 谢土 斋醮\",\"j\":\"安床 作灶\"}");
            put("9-34", "{\"y\":\"纳采 立券 交易 动土 安床 安机械 安葬 移柩 立碑 破土\",\"j\":\"嫁娶 作灶 开光\"}");
            put("9-35", "{\"y\":\"沐浴 取渔 结网\",\"j\":\"嫁娶 入宅 安葬\"}");
            put("9-36", "{\"y\":\"嫁娶 出行 解除 移徙 纳采 入宅 订盟 动土 祈福 栽种 安床 纳畜 安葬 祭祀 拆卸 修坟 出火 开光 破土 求嗣 谢土\",\"j\":\"开市 经络 作灶\"}");
            put("9-37", "{\"y\":\"嫁娶 纳采 订盟 祈福 安葬 祭祀 入殓 破土\",\"j\":\"开市 开光\"}");
            put("9-38", "{\"y\":\"嫁娶 会亲友 移徙 立券 入宅 开市 出货财 经络 栽种 安床 开仓 安机械 纳畜 安葬 安门 挂匾 牧养 拆卸 入殓 移柩 开池 立碑 破土 启鑽\",\"j\":\"祈福 祭祀 探病 谢土 造桥\"}");
            put("9-39", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 订盟 祈福 安葬 祭祀 启鑽\",\"j\":\"动土 破土\"}");
            put("9-40", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 订盟 动土 祈福 安床 祭祀 修造 拆卸 放水 移柩 成服 出火 除服 合嵴 进人口 掘井 开光 破土 求嗣 上梁 谢土\",\"j\":\"开市 开仓 安葬 安门\"}");
            put("9-41", "{\"y\":\"会亲友 纳采 纳财 订盟 安机械 牧养\",\"j\":\"祈福 安葬\"}");
            put("9-42", "{\"y\":\"扫舍 安葬 入殓 移柩 馀事勿取 成服 除服 立碑 破土 启鑽\",\"j\":\"嫁娶 入宅 动土 祭祀 修造\"}");
            put("9-43", "{\"y\":\"入学 交易 订盟 动土 祈福 祭祀 修造 放水 起基 冠笄 伐木 开池 开光 求嗣 斋醮\",\"j\":\"理发 栽种 安门 作灶 造庙 造桥\"}");
            put("9-44", "{\"y\":\"立券 交易 纳财 开市 出货财 栽种 开仓 沐浴 纳畜 安葬 牧养 入殓 破土 畋猎\",\"j\":\"嫁娶 入宅 祈福 安床 造船\"}");
            put("9-45", "{\"y\":\"出行 移徙 入宅 动土 祈福 安葬 挂匾 祭祀 修造 拆卸 入殓 出火 开池 开光 破土 启鑽 求嗣 上梁\",\"j\":\"嫁娶 安床 作灶\"}");
            put("9-46", "{\"y\":\"嫁娶 会亲友 出行 动土 祭祀 修造 入殓 冠笄 破土\",\"j\":\"成服 除服 开光 塑绘 造桥\"}");
            put("9-47", "{\"y\":\"扫舍 馀事勿取 塞穴\",\"j\":\"诸事不宜\"}");
            put("9-48", "{\"y\":\"扫舍 沐浴 馀事勿取\",\"j\":\"嫁娶 开市 作灶 斋醮\"}");
            put("9-49", "{\"y\":\"立券 交易 纳财 开市 动土 经络 安床 开厕 祭祀 修造 放水 结网 开池 破土\",\"j\":\"嫁娶 移徙 词讼 栽种 安门 作灶 造桥\"}");
            put("9-50", "{\"y\":\"嫁娶 会亲友 出行 移徙 纳采 立券 交易 入宅 纳财 开市 订盟 安床 盖屋 安葬 挂匾 作灶 拆卸 起基 入殓 移柩 安香 出火 立碑 破土 启鑽\",\"j\":\"祈福 开仓 牧养 掘井 上梁\"}");
            put("9-51", "{\"y\":\"安葬 祭祀 入殓 移柩 馀事勿取 成服 除服 结网 启鑽\",\"j\":\"诸事不宜\"}");
            put("9-52", "{\"y\":\"移徙 纳采 立券 入宅 订盟 动土 祈福 安门 祭祀 修造 起基 安香 出火 开池 破土 上梁 竖柱 定磉\",\"j\":\"嫁娶 安葬 作灶 造船 造庙 造桥\"}");
            put("9-53", "{\"y\":\"嫁娶 会亲友 纳采 纳财 纳畜 牧养 结网 进人口 求嗣\",\"j\":\"出行 理发 安葬 安门 作灶 伐木 上梁\"}");
            put("9-54", "{\"y\":\"嫁娶 移徙 纳采 裁衣 订盟 安床 架马 开厕 安葬 祭祀 作灶 入殓 移柩 冠笄 成服 除服 伐木 结网 开池 开柱眼 启鑽 作梁 定磉 畋猎\",\"j\":\"动土 盖屋 破土 造船\"}");
            put("9-55", "{\"y\":\"动土 祈福 安床 架马 开厕 祭祀 入殓 冠笄 成服 除服 伐木 结网 开池 求嗣\",\"j\":\"栽种 安门 治病 作灶\"}");
            put("9-56", "{\"y\":\"会亲友 扫舍 入学 纳采 裁衣 订盟 栽种 纳畜 安葬 挂匾 祭祀 造仓 拆卸 入殓 修坟 出火 结网 掘井 开池 立碑 破土 求嗣 塑绘\",\"j\":\"嫁娶 祈福 安床 谢土 造庙\"}");
            put("9-57", "{\"y\":\"沐浴 安葬 祭祀 合寿木 开生坟 入殓 移柩 成服 除服 破土 斋醮\",\"j\":\"嫁娶 会亲友 入宅 开市 安床 作灶 上梁\"}");
            put("9-58", "{\"y\":\"出行 纳采 裁衣 订盟 动土 安床 安葬 祭祀 取渔 作灶 入殓 移柩 冠笄 结网 进人口 破土 合帐 畋猎\",\"j\":\"造庙 作梁\"}");
            put("9-59", "{\"y\":\"扫舍 沐浴 取渔 馀事勿取 结网 塞穴 畋猎\",\"j\":\"祈福 安葬\"}");
            put("10-0", "{\"y\":\"解除 立券 交易 开市 祈福 安床 安葬 挂匾 祭祀 修造 开光 求嗣\",\"j\":\"嫁娶 纳采 入宅 订盟 动土 开仓 纳畜 问名 出火 伐木 破土\"}");
            put("10-1", "{\"y\":\"纳采 开市 动土 祈福 纳畜 祭祀 求医 治病\",\"j\":\"嫁娶 安葬\"}");
            put("10-2", "{\"y\":\"解除 立券 交易 置产 开市 动土 栽种 安床 安葬 挂匾 修造 拆卸 开光 破土 上梁\",\"j\":\"嫁娶 入宅 祭祀 作灶 出火\"}");
            put("10-3", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 动土 安葬 破土 上梁\",\"j\":\"赴任\"}");
            put("10-4", "{\"y\":\"出行 移徙 纳采 立券 交易 开市 订盟 动土 祈福 栽种 安床 安机械 纳畜 安葬 祭祀 修造 拆卸 移柩 出火 进人口 开光 破土 普渡 求嗣 上梁\",\"j\":\"嫁娶 入宅 牧养 掘井\"}");
            put("10-5", "{\"y\":\"会亲友 立券 开市 赴任 动土 经络 安床 祭祀 拆卸 起基 冠笄 进人口 开光 上梁 塑绘\",\"j\":\"安葬 定磉\"}");
            put("10-6", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 交易 入宅 开市 订盟 动土 祈福 栽种 安床 造车器 安葬 安门 挂匾 祭祀 修造 拆卸 入殓 成服 除服 开光 立碑 破土 启鑽\",\"j\":\"纳畜 盖屋 起基 探病 伐木 作梁\"}");
            put("10-7", "{\"y\":\"会亲友 纳采 立券 交易 纳财 开市 裁衣 订盟 经络 祈福 安床 安机械 纳畜 安葬 祭祀 造畜稠 入殓 移柩 冠笄 成服 除服 启鑽 上梁 竖柱 谢土 筑堤 合帐\",\"j\":\"嫁娶 入宅 赴任 治病\"}");
            put("10-8", "{\"y\":\"嫁娶 出行 解除 移徙 入宅 祈福 纳畜 祭祀 入殓 修坟 开光 立碑 求嗣\",\"j\":\"动土 栽种 安床 伐木 破土 造桥 作梁\"}");
            put("10-9", "{\"y\":\"安葬 入殓 移柩 馀事勿取 成服 除服 立碑 启鑽\",\"j\":\"伐木 破土\"}");
            put("10-10", "{\"y\":\"取渔 结网 塞穴 畋猎\",\"j\":\"嫁娶 移徙 入宅 安葬 安门\"}");
            put("10-11", "{\"y\":\"出行 移徙 纳采 立券 入宅 开市 裁衣 动土 安床 沐浴 安门 挂匾 祭祀 拆卸 起基 安香 开光 求嗣 上梁 竖柱 塑绘\",\"j\":\"嫁娶 栽种 安葬 伐木\"}");
            put("10-12", "{\"y\":\"纳采 出货财 订盟 祈福 开仓 盖屋 安门 祭祀 起基 入殓 开光 破土 启鑽 求嗣 上梁 竖柱 谢土 斋醮 定磉\",\"j\":\"嫁娶 开市 出火\"}");
            put("10-13", "{\"y\":\"立券 交易 开市 动土 祈福 栽种 安床 安葬 祭祀 修造 拆卸 移柩 伐木 进人口 开光 破土\",\"j\":\"嫁娶 出行 移徙 理发 入宅 出火\"}");
            put("10-14", "{\"y\":\"纳采 立券 开市 动土 安机械 安葬 求医 修造 治病 冠笄 破土\",\"j\":\"嫁娶 移徙 入宅 祭祀 上梁 斋醮\"}");
            put("10-15", "{\"y\":\"嫁娶 出行 解除 移徙 立券 交易 入宅 开市 动土 祈福 栽种 安床 纳畜 安葬 挂匾 修造 拆卸 入殓 移柩 进人口 开光 求嗣\",\"j\":\"\"}");
            put("10-16", "{\"y\":\"嫁娶 移徙 立券 交易 入宅 开市 动土 祈福 安床 造车器 祭祀 修造 治病 安香 捕捉 结网 开光 普渡 斋醮 畋猎\",\"j\":\"纳采 订盟 经络 安葬 行丧 探病\"}");
            put("10-17", "{\"y\":\"立券 交易 入宅 开市 动土 栽种 安床 挂匾 祭祀 修造 拆卸 出火 进人口 开光\",\"j\":\"嫁娶 出行 移徙 纳畜 安葬 行丧 伐木 立碑\"}");
            put("10-18", "{\"y\":\"嫁娶 会亲友 出行 移徙 纳采 立券 入宅 开市 订盟 造车器 安葬 祭祀 破土\",\"j\":\"盖屋 架马 合寿木 开光 上梁\"}");
            put("10-19", "{\"y\":\"会亲友 解除 理发 祈福 栽种 纳畜 安葬 祭祀 牧养 修坟 开光 立碑 启鑽 求嗣\",\"j\":\"出行 移徙 入宅 赴任 词讼 作灶\"}");
            put("10-20", "{\"y\":\"会亲友 出行 解除 移徙 纳采 入宅 订盟 祈福 安机械 纳畜 盖屋 安门 祭祀 牧养 求医 修造 治病 起基 入殓 修坟 移柩 安香 出火 开光 立碑 启鑽 谢土 造船 斋醮 针灸\",\"j\":\"嫁娶 动土 安床 掘井 造桥\"}");
            put("10-21", "{\"y\":\"安葬 祭祀 入殓 修坟 成服 除服 立碑 破土 启鑽\",\"j\":\"馀事勿取\"}");
            put("10-22", "{\"y\":\"安葬 祭祀 入殓 移柩 成服 除服 结网 破土\",\"j\":\"馀事勿取\"}");
            put("10-23", "{\"y\":\"移徙 立券 交易 入宅 开市 动土 祈福 安床 挂匾 祭祀 拆卸 进人口 开光 上梁\",\"j\":\"嫁娶 理发 纳畜 架马 安葬 牧养 行丧 伐木 作梁\"}");
            put("10-24", "{\"y\":\"纳采 开市 裁衣 订盟 动土 经络 安床 安机械 祭祀 修造 拆卸 冠笄 开光 塑绘\",\"j\":\"入宅 安葬 出火 伐木\"}");
            put("10-25", "{\"y\":\"出行 解除 立券 交易 开市 动土 祈福 栽种 安床 纳畜 祭祀 牧养 开光 破土 上梁 竖柱\",\"j\":\"嫁娶 移徙 入宅 安葬 掘井\"}");
            put("10-26", "{\"y\":\"会亲友 纳采 开市 订盟 动土 栽种 纳畜 安葬 牧养 修造 拆卸 起基 入殓 移柩 成服 除服 雕刻 进人口 破土\",\"j\":\"\"}");
            put("10-27", "{\"y\":\"嫁娶 出行 移徙 纳采 立券 交易 入宅 开市 订盟 动土 祈福 栽种 安床 安葬 挂匾 祭祀 修造 拆卸 入殓 出火 进人口 开光 破土 求嗣 谢土\",\"j\":\"纳畜 合寿木 伐木 掘井\"}");
            put("10-28", "{\"y\":\"解除 纳采 开市 订盟 动土 祈福 纳畜 安葬 牧养 造仓 放水 开生坟 起基 入殓 移柩 成服 除服 破土 求嗣\",\"j\":\"\"}");
            put("10-29", "{\"y\":\"立券 交易 纳财 开市 动土 祈福 栽种 安床 挂匾 祭祀 拆卸 开光\",\"j\":\"嫁娶 出行 移徙 入宅 词讼 纳畜 安葬 出火 进人口 破土\"}");
            put("10-30", "{\"y\":\"嫁娶 会亲友 出行 移徙 纳采 立券 交易 入宅 纳财 开市 赴任 裁衣 订盟 经络 祈福 安床 安葬 祭祀 修造 拆卸 入殓 安香 进人口 开光 启鑽 上梁 塑绘 谢土 斋醮\",\"j\":\"开仓 冠笄 伐木 作梁\"}");
            put("10-31", "{\"y\":\"解除 祈福 栽种 纳畜 安葬 祭祀 修造 拆卸 修坟 伐木 开光 立碑 求嗣\",\"j\":\"嫁娶 出行 移徙 入宅 出火 进人口\"}");
            put("10-32", "{\"y\":\"出行 解除 移徙 修造 拆卸 入殓 修坟 移柩 成服 除服 立碑 启鑽 塑绘 谢土 造船 斋醮\",\"j\":\"\"}");
            put("10-33", "{\"y\":\"安葬 祭祀 入殓 修坟 成服 除服 立碑 破土 启鑽 斋醮\",\"j\":\"嫁娶 纳采 入宅 订盟 作灶\"}");
            put("10-34", "{\"y\":\"安葬 取渔 入殓 移柩 成服 除服 立碑 破土\",\"j\":\"嫁娶 入宅 作灶 上梁\"}");
            put("10-35", "{\"y\":\"解除 理发 经络 祈福 栽种 沐浴 祭祀 牧养 治病 掘井 开池 开光 立碑 求嗣 斋醮\",\"j\":\"嫁娶 安葬 合寿木 行丧 定磉\"}");
            put("10-36", "{\"y\":\"\",\"j\":\"诸事不宜\"}");
            put("10-37", "{\"y\":\"解除 纳采 立券 交易 纳财 开市 订盟 动土 祈福 栽种 纳畜 安葬 祭祀 造仓 起基 进人口 开池 开光 破土 求嗣\",\"j\":\"嫁娶 入宅 裁衣 安床 上梁\"}");
            put("10-38", "{\"y\":\"动土 安葬 求医 治病 入殓 破土 上梁\",\"j\":\"嫁娶 开光\"}");
            put("10-39", "{\"y\":\"嫁娶 会亲友 纳采 订盟 祈福 盖屋 安葬 安门 祭祀 求医 治病 起基 安碓磑 成服 除服 开池 开光 破土 上梁 竖柱 斋醮 筑堤\",\"j\":\"入宅 开市 词讼 合寿木 掘井\"}");
            put("10-40", "{\"y\":\"嫁娶 移徙 纳采 入宅 订盟 动土 祈福 安葬 祭祀 求医 治病 破土\",\"j\":\"开光 针灸\"}");
            put("10-41", "{\"y\":\"嫁娶 解除 移徙 纳采 立券 交易 入宅 开市 订盟 祈福 安床 挂匾 祭祀 出火 进人口 开光 求嗣\",\"j\":\"出行 栽种 纳畜 安葬 行丧 伐木 造庙 造桥\"}");
            put("10-42", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅 开市 订盟 动土 祈福 安葬 祭祀 破土\",\"j\":\"安门 斋醮\"}");
            put("10-43", "{\"y\":\"会亲友 纳采 订盟 动土 祈福 安机械 安葬 祭祀 修造 破土\",\"j\":\"嫁娶 移徙 入宅 开市 出火\"}");
            put("10-44", "{\"y\":\"解除 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("10-45", "{\"y\":\"解除 沐浴 祭祀 馀事勿取 补垣 断蚁 塞穴\",\"j\":\"嫁娶 入宅 安葬 修造 行丧 造庙\"}");
            put("10-46", "{\"y\":\"安葬 入殓 移柩 成服 除服 结网 破土\",\"j\":\"诸事不宜\"}");
            put("10-47", "{\"y\":\"出行 移徙 纳采 立券 交易 纳财 开市 动土 修造 拆卸 起基 冠笄 出火 开光 求嗣 上梁 造船\",\"j\":\"嫁娶 祈福 安葬 破土\"}");
            put("10-48", "{\"y\":\"解除 纳采 动土 祈福 安床 安葬 祭祀 拆卸 入殓 移柩 冠笄 出火 进人口 掘井 开池 开光 破土 求嗣 上梁 造庙\",\"j\":\"\"}");
            put("10-49", "{\"y\":\"会亲友 立券 交易 开市 动土 栽种 安机械 盖屋 开厕 安葬 安门 牧养 求医 修造 造畜稠 治病 作灶 放水 起基 开池 开光 立碑 破土 上梁 竖柱 定磉\",\"j\":\"嫁娶 移徙 入宅 出火\"}");
            put("10-50", "{\"y\":\"立券 交易 纳财 开市 动土 栽种 安床 安葬 修造 拆卸 入殓 成服 除服 破土 上梁\",\"j\":\"嫁娶 移徙 入宅 纳畜 祭祀 探病 出火 伐木\"}");
            put("10-51", "{\"y\":\"出行 移徙 纳采 入宅 订盟 动土 祈福 安机械 安葬 祭祀 修造 拆卸 起基 入殓 移柩 成服 出火 除服 破土 谢土 造庙 斋醮\",\"j\":\"嫁娶 开市 栽种 合寿木\"}");
            put("10-52", "{\"y\":\"嫁娶 移徙 立券 交易 入宅 开市 动土 祈福 安床 纳畜 安葬 祭祀 拆卸 入殓 出火 伐木 开光\",\"j\":\"出行 栽种 作灶 针灸\"}");
            put("10-53", "{\"y\":\"嫁娶 移徙 纳采 入宅 开市 订盟 动土 纳畜 挂匾 牧养 修造 造仓 拆卸 放水 起基 出火 雕刻 开池 开光 求嗣 上梁 造船\",\"j\":\"安葬 合寿木 行丧\"}");
            put("10-54", "{\"y\":\"嫁娶 出行 移徙 入宅 开市 安床 祭祀 修造 拆卸 出火 开光\",\"j\":\"置产 纳畜 安葬 修坟 行丧 伐木 立碑 作梁\"}");
            put("10-55", "{\"y\":\"会亲友 解除 入学 纳采 立券 交易 纳财 订盟 动土 经络 祈福 栽种 纳畜 安葬 祭祀 牧养 起基 入殓 开池 开光 立碑 破土 求嗣 斋醮 定磉\",\"j\":\"嫁娶 移徙 入宅 开市 出火\"}");
            put("10-56", "{\"y\":\"解除 扫舍 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("10-57", "{\"y\":\"安葬 入殓 修坟 移柩 成服 除服 立碑 启鑽\",\"j\":\"嫁娶 开市 伐木 作梁\"}");
            put("10-58", "{\"y\":\"安葬 祭祀 移柩 馀事勿取 成服 除服 结网 破土 塞穴 谢土\",\"j\":\"嫁娶 入宅\"}");
            put("10-59", "{\"y\":\"纳采 立券 入宅 纳财 开市 订盟 动土 沐浴 安门 祭祀 拆卸 起基 冠笄 安香 出火 开光 求嗣 上梁 竖柱 塑绘 合帐\",\"j\":\"嫁娶 安葬 伐木 造庙\"}");
            put("11-0", "{\"y\":\"栽种 沐浴 祭祀 捕捉\",\"j\":\"嫁娶 移徙 入宅 安葬 作灶\"}");
            put("11-1", "{\"y\":\"纳财 纳畜 安门 祭祀 取渔 馀事勿取\",\"j\":\"嫁娶 入宅\"}");
            put("11-2", "{\"y\":\"嫁娶 出行 移徙 纳采 入宅\",\"j\":\"动土 安葬 破土\"}");
            put("11-3", "{\"y\":\"祭祀 馀事勿取 结网\",\"j\":\"出行 入宅 安葬 掘井\"}");
            put("11-4", "{\"y\":\"纳财 祭祀 作灶 捕捉\",\"j\":\"开市 破土\"}");
            put("11-5", "{\"y\":\"嫁娶 会亲友 移徙 立券 交易 裁衣 动土 经络 祈福 栽种 安床 祭祀 修造 冠笄 进人口 求嗣 上梁 竖柱\",\"j\":\"出行 纳畜 安葬 行丧 伐木 造桥 作梁\"}");
            put("11-6", "{\"y\":\"嫁娶 会亲友 裁衣 祭祀 入殓 移柩 冠笄 捕捉 成服 除服 进人口 纳婿\",\"j\":\"移徙 入宅 作灶\"}");
            put("11-7", "{\"y\":\"会亲友 移徙 理发 纳财 祭祀 冠笄 捕捉\",\"j\":\"嫁娶 开市 开厕 开池 破土\"}");
            put("11-8", "{\"y\":\"扫舍 沐浴 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("11-9", "{\"y\":\"扫舍 理发 纳财 栽种 沐浴 祭祀 捕捉 结网 进人口 畋猎\",\"j\":\"会亲友 移徙 入宅 开市 安床 安葬 安门 作灶 行丧 出火\"}");
            put("11-10", "{\"y\":\"嫁娶 纳财 祈福 祭祀 作灶 入殓 捕捉 成服 除服 开光 塑绘 斋醮 畋猎\",\"j\":\"安床 开仓 盖屋 安葬\"}");
            put("11-11", "{\"y\":\"会亲友 出行 移徙 纳采 入宅 动土 祈福 祭祀 修造\",\"j\":\"嫁娶 开市 安葬 破土\"}");
            put("11-12", "{\"y\":\"嫁娶 纳财 裁衣 安床 入殓 冠笄 纳婿 合帐\",\"j\":\"开市 安葬 作灶 作梁\"}");
            put("11-13", "{\"y\":\"解除 祭祀 馀事勿取 捕捉\",\"j\":\"嫁娶 安葬\"}");
            put("11-14", "{\"y\":\"解除 馀事勿取 结网\",\"j\":\"诸事不宜\"}");
            put("11-15", "{\"y\":\"祭祀 作灶 馀事勿取\",\"j\":\"开市 安葬 修坟 掘井 破土\"}");
            put("11-16", "{\"y\":\"纳财 栽种 纳畜 祭祀 作灶 进人口\",\"j\":\"开市 经络 安床 安葬 修坟 立碑 破土 启鑽\"}");
            put("11-17", "{\"y\":\"嫁娶 会亲友 纳采 立券 纳财 开市 裁衣 订盟 安床 安机械 纳畜 牧养 作灶 冠笄\",\"j\":\"出行 安葬 行丧 掘井 破土\"}");
            put("11-18", "{\"y\":\"嫁娶 会亲友 理发 祭祀 入殓 移柩 进人口 针灸\",\"j\":\"入宅 安葬 作灶 探病 伐木 开渠\"}");
            put("11-19", "{\"y\":\"纳财 祭祀 作灶 馀事勿取 捕捉 畋猎\",\"j\":\"开市 动土 安葬 破土\"}");
            put("11-20", "{\"y\":\"沐浴 祭祀 入殓 移柩 成服 除服 结网\",\"j\":\"嫁娶 交易 开市 出货财 安床 安葬 作灶 修坟\"}");
            put("11-21", "{\"y\":\"扫舍 纳财 安床 沐浴 祭祀 作灶 捕捉 畋猎\",\"j\":\"开市 安葬 破土 斋醮\"}");
            put("11-22", "{\"y\":\"解除 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("11-23", "{\"y\":\"移徙 纳采 裁衣 订盟 动土 祈福 安床 纳畜 安门 修造 造仓 拆卸 起基 冠笄 结网 开光 求嗣 塑绘\",\"j\":\"入宅 安葬 取渔 作灶 伐木\"}");
            put("11-24", "{\"y\":\"嫁娶 理发 冠笄 进人口\",\"j\":\"置产 纳畜 安葬 造畜稠 作灶 开生坟 伐木 破土 作梁\"}");
            put("11-25", "{\"y\":\"祭祀\",\"j\":\"嫁娶 安床 馀事勿取 造庙\"}");
            put("11-26", "{\"y\":\"出行 解除 移徙 纳采 入宅 纳畜 牧养 作灶 冠笄 进人口 上梁 竖柱\",\"j\":\"动土 安床 架马 安葬 祭祀 修造 修坟 伐木 破土\"}");
            put("11-27", "{\"y\":\"修饰垣墙 祭祀 取渔 馀事勿取 捕捉\",\"j\":\"诸事不宜\"}");
            put("11-28", "{\"y\":\"交易 纳财 栽种 纳畜 祭祀 牧养 作灶 冠笄 结网 进人口\",\"j\":\"出行 开市 安床 安葬 开生坟 修坟 掘井 开渠 破土 造船\"}");
            put("11-29", "{\"y\":\"嫁娶 解除 移徙 纳采 立券 交易 入宅 纳财 开市 订盟 动土 纳畜 安门 分居 牧养 修造 拆卸 起基 出火 开光 塑绘\",\"j\":\"\"}");
            put("11-30", "{\"y\":\"嫁娶 会亲友 理发 祭祀 作灶 移柩 冠笄 进人口\",\"j\":\"开市 出货财 栽种 开仓 纳畜 盖屋 伐木 破土 启鑽 上梁\"}");
            put("11-31", "{\"y\":\"祭祀 作灶 入殓 成服 除服 畋猎\",\"j\":\"开市 动土 栽种 安葬\"}");
            put("11-32", "{\"y\":\"解除 扫舍 沐浴 馀事勿取 捕捉 塞穴 畋猎\",\"j\":\"嫁娶 入宅 开市 安床 修坟 破土\"}");
            put("11-33", "{\"y\":\"纳财 安床 沐浴 祭祀 捕捉 畋猎\",\"j\":\"开市 破土\"}");
            put("11-34", "{\"y\":\"纳财 祭祀 捕捉 斋醮 畋猎\",\"j\":\"嫁娶 入宅 开市 安床 安葬 破土\"}");
            put("11-35", "{\"y\":\"纳采 立券 交易 纳财 开市 裁衣 订盟 经络 安床 安机械 沐浴 纳畜 祭祀 取渔 造仓 冠笄 捕捉 酬神 结网 开池 求嗣 合帐\",\"j\":\"安葬 作灶 伐木 作梁\"}");
            put("11-36", "{\"y\":\"理发 立券 交易 纳财 栽种 取渔 捕捉 教牛马 结网 进人口\",\"j\":\"入宅 盖屋 安葬 竖柱\"}");
            put("11-37", "{\"y\":\"解除 馀事勿取 坏垣\",\"j\":\"诸事不宜\"}");
            put("11-38", "{\"y\":\"祭祀 馀事勿取 捕捉 结网\",\"j\":\"嫁娶 开市 探病\"}");
            put("11-39", "{\"y\":\"栽种 祭祀 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("11-40", "{\"y\":\"嫁娶 会亲友 出行 解除 移徙 入学 纳采 入宅 订盟 祈福 栽种 纳畜 盖屋 祭祀 牧养 拆卸 起基 安香 出火 开光 上梁 竖柱 塑绘 斋醮\",\"j\":\"开市 出货财 开仓 安葬 破土 启鑽\"}");
            put("11-41", "{\"y\":\"纳采 订盟 祈福 安机械 纳畜 祭祀 作灶\",\"j\":\"动土 安葬\"}");
            put("11-42", "{\"y\":\"祭祀 冠笄 馀事勿取 捕捉\",\"j\":\"嫁娶 开市 盖屋 合寿木 作梁\"}");
            put("11-43", "{\"y\":\"祭祀 馀事勿取 塞穴\",\"j\":\"诸事不宜\"}");
            put("11-44", "{\"y\":\"扫舍 沐浴 祭祀 捕捉 结网 畋猎\",\"j\":\"嫁娶 纳采 订盟 动土 安床 安葬 破土\"}");
            put("11-45", "{\"y\":\"扫舍 理发 沐浴\",\"j\":\"嫁娶 入宅 纳畜 安葬 安门 造畜稠 作灶 伐木 上梁 造船 作梁\"}");
            put("11-46", "{\"y\":\"嫁娶 会亲友 纳采 纳财 裁衣 订盟 祭祀 作灶 冠笄 问名 捕捉 进人口\",\"j\":\"开市 安床 安葬 修坟\"}");
            put("11-47", "{\"y\":\"出行 解除 移徙 雇庸 动土 祈福 安床 安门 祭祀 起基 进人口 开光 上梁\",\"j\":\"嫁娶 纳畜 安葬 牧养 作灶 行丧 破土 作梁\"}");
            put("11-48", "{\"y\":\"嫁娶 理发 栽种 冠笄 捕捉 进人口 针灸\",\"j\":\"纳财 开市 安葬 破土\"}");
            put("11-49", "{\"y\":\"解除 破屋 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("11-50", "{\"y\":\"栽种 馀事勿取 捕捉 畋猎\",\"j\":\"开市 动土 安葬 祭祀 探病 斋醮\"}");
            put("11-51", "{\"y\":\"祭祀 作灶 馀事勿取\",\"j\":\"诸事不宜\"}");
            put("11-52", "{\"y\":\"纳财 纳畜 祭祀 牧养 馀事勿取 捕捉 进人口\",\"j\":\"入宅 开市 动土 安床 安葬\"}");
            put("11-53", "{\"y\":\"解除 立券 交易 纳财 纳畜 祭祀 进人口 开光\",\"j\":\"嫁娶 出行 移徙 理发 入宅 动土 分居 安香 出火 破土\"}");
            put("11-54", "{\"y\":\"嫁娶 祭祀 捕捉\",\"j\":\"入宅 开市 动土 安门 修造 开光 破土\"}");
            put("11-55", "{\"y\":\"嫁娶 纳财 祭祀 作灶\",\"j\":\"开市 安葬 修坟 立碑\"}");
            put("11-56", "{\"y\":\"会亲友 解除 入殓 移柩 馀事勿取 捕捉 成服 除服 畋猎\",\"j\":\"安床 安葬 安门 修坟 破土\"}");
            put("11-57", "{\"y\":\"扫舍 整手足甲 理发 安床 祭祀 作灶 教牛马 开光\",\"j\":\"嫁娶 交易 开市 动土 纳畜 安葬 开生坟 伐木 破土 作梁\"}");
            put("11-58", "{\"y\":\"祭祀 作灶 入殓 馀事勿取 除服\",\"j\":\"开市 安床\"}");
            put("11-59", "{\"y\":\"理发 栽种 沐浴 祭祀 作灶 结网\",\"j\":\"嫁娶 开市 词讼 纳畜 安葬 牧养 造畜稠 行丧 伐木 作梁\"}");
        }
    };
    // 月支 + 日干支
    public static final JSONObject TAI_SHEN = new JSONObject() {
        @Serial
        private static final long serialVersionUID = 1L;

        {
            put("寅甲子", "占门碓外东南");
            put("寅乙丑", "碓磨厕外东南");
            put("寅丙寅", "厨灶炉外正南");
            put("寅丁卯", "仓库门外正南");
            put("寅戊辰", "房床栖外正南");
            put("寅己巳", "占门床外正南");
            put("寅庚午", "占碓磨外正南");
            put("寅辛未", "厨灶厕外西南");
            put("寅壬申", "仓库炉外西南");
            put("寅癸酉", "房床门外西南");
            put("寅甲戌", "门鸡栖外西南");
            put("寅乙亥", "碓磨床外西南");
            put("寅丙子", "厨灶碓外西南");
            put("寅丁丑", "仓库厕外西南");
            put("寅戊寅", "房床厕外正南");
            put("寅己卯", "占门厕外正南");
            put("寅庚辰", "碓磨栖外正西");
            put("寅辛巳", "厨灶床外正西");
            put("寅壬午", "仓库碓外西北");
            put("寅癸未", "房床厕外西北");
            put("寅甲申", "占门炉外西北");
            put("寅乙酉", "碓磨门外西北");
            put("寅丙戌", "厨灶栖外西北");
            put("寅丁亥", "仓库床外西北");
            put("寅戊子", "房床碓外正北");
            put("寅己丑", "占门厕外正北");
            put("寅庚寅", "碓磨炉外正北");
            put("寅辛卯", "厨灶门外正北");
            put("寅壬辰", "仓库栖外正北");
            put("寅癸巳", "占房床房内北");
            put("寅甲午", "占门碓房内北");
            put("寅乙未", "碓磨厕房内北");
            put("寅丙申", "厨灶炉房内北");
            put("寅丁酉", "仓库门房内北");
            put("寅戊戌", "房床栖房内南");
            put("寅己亥", "占门床房内南");
            put("寅庚子", "占碓磨房内南");
            put("寅辛丑", "厨灶厕房内南");
            put("寅壬寅", "仓库炉房内南");
            put("寅癸卯", "房床门房内南");
            put("寅甲辰", "门鸡栖房内东");
            put("寅乙巳", "碓磨床房内东");
            put("寅丙午", "厨灶碓房内东");
            put("寅丁未", "仓库厕房内东");
            put("寅戊申", "房床炉房内东");
            put("寅己酉", "占大门外东北");
            put("寅庚戌", "碓磨栖外东北");
            put("寅辛亥", "厨灶床外东北");
            put("寅壬子", "仓库碓外东北");
            put("寅癸丑", "房床厕外东北");
            put("寅甲寅", "占门炉外东北");
            put("寅乙卯", "碓磨门外正东");
            put("寅丙辰", "厨灶栖外正东");
            put("寅丁巳", "仓库床外正东");
            put("寅戊午", "房床碓外正东");
            put("寅己未", "占门厕外正东");
            put("寅庚申", "碓磨炉外东南");
            put("寅辛酉", "厨灶门外东南");
            put("寅壬戌", "仓库栖外东南");
            put("寅癸亥", "占房床外东南");
            put("卯甲子", "占门碓外东南");
            put("卯乙丑", "碓磨厕外东南");
            put("卯丙寅", "厨灶炉外正南");
            put("卯丁卯", "仓库门外正南");
            put("卯戊辰", "房床栖外正南");
            put("卯己巳", "占门床外正南");
            put("卯庚午", "占碓磨外正南");
            put("卯辛未", "厨灶厕外西南");
            put("卯壬申", "仓库炉外西南");
            put("卯癸酉", "房床门外西南");
            put("卯甲戌", "门鸡栖外西南");
            put("卯乙亥", "碓磨床外西南");
            put("卯丙子", "厨灶碓外西南");
            put("卯丁丑", "仓库厕外西南");
            put("卯戊寅", "房床厕外正南");
            put("卯己卯", "占门厕外正南");
            put("卯庚辰", "碓磨栖外正西");
            put("卯辛巳", "厨灶床外正西");
            put("卯壬午", "仓库碓外西北");
            put("卯癸未", "房床厕外西北");
            put("卯甲申", "占门炉外西北");
            put("卯乙酉", "碓磨门外西北");
            put("卯丙戌", "厨灶栖外西北");
            put("卯丁亥", "仓库床外西北");
            put("卯戊子", "房床碓外正北");
            put("卯己丑", "占门厕外正北");
            put("卯庚寅", "碓磨炉外正北");
            put("卯辛卯", "厨灶门外正北");
            put("卯壬辰", "仓库栖外正北");
            put("卯癸巳", "占房床房内北");
            put("卯甲午", "占门碓房内北");
            put("卯乙未", "碓磨厕房内北");
            put("卯丙申", "厨灶炉房内北");
            put("卯丁酉", "仓库门房内北");
            put("卯戊戌", "房床栖房内南");
            put("卯己亥", "占门床房内南");
            put("卯庚子", "占碓磨房内南");
            put("卯辛丑", "厨灶厕房内南");
            put("卯壬寅", "仓库炉房内南");
            put("卯癸卯", "房床门房内南");
            put("卯甲辰", "门鸡栖房内东");
            put("卯乙巳", "碓磨床房内东");
            put("卯丙午", "厨灶碓房内东");
            put("卯丁未", "仓库厕房内东");
            put("卯戊申", "房床炉房内东");
            put("卯己酉", "占大门外东北");
            put("卯庚戌", "碓磨栖外东北");
            put("卯辛亥", "厨灶床外东北");
            put("卯壬子", "仓库碓外东北");
            put("卯癸丑", "房床厕外东北");
            put("卯甲寅", "占门炉外东北");
            put("卯乙卯", "碓磨门外正东");
            put("卯丙辰", "厨灶床外正东");
            put("卯丁巳", "仓库床外正东");
            put("卯戊午", "房床碓外正东");
            put("卯己未", "占门厕外正东");
            put("卯庚申", "碓磨炉外东南");
            put("卯辛酉", "厨灶门外东南");
            put("卯壬戌", "仓库栖外东南");
            put("卯癸亥", "占房床外东南");
            put("辰甲子", "占门碓外东南");
            put("辰乙丑", "碓磨厕外东南");
            put("辰丙寅", "厨灶炉外正南");
            put("辰丁卯", "仓库门外正南");
            put("辰戊辰", "房床栖外正南");
            put("辰己巳", "占门床外正南");
            put("辰庚午", "占碓磨外正南");
            put("辰辛未", "厨灶厕外西南");
            put("辰壬申", "仓库炉外西南");
            put("辰癸酉", "房床门外西南");
            put("辰甲戌", "门鸡栖外西南");
            put("辰乙亥", "碓磨床外西南");
            put("辰丙子", "厨灶碓外西南");
            put("辰丁丑", "仓库厕外西南");
            put("辰戊寅", "房床厕外正南");
            put("辰己卯", "占门厕外正南");
            put("辰庚辰", "碓磨栖外正西");
            put("辰辛巳", "厨灶床外正西");
            put("辰壬午", "仓库碓外西北");
            put("辰癸未", "房床厕外西北");
            put("辰甲申", "占门炉外西北");
            put("辰乙酉", "碓磨门外西北");
            put("辰丙戌", "厨灶栖外西北");
            put("辰丁亥", "仓库床外西北");
            put("辰戊子", "房床碓外正北");
            put("辰己丑", "占门厕外正北");
            put("辰庚寅", "碓磨炉外正北");
            put("辰辛卯", "厨灶门外正北");
            put("辰壬辰", "仓库栖外正北");
            put("辰癸巳", "占房床房内北");
            put("辰甲午", "占门碓房内北");
            put("辰乙未", "碓磨厕房内北");
            put("辰丙申", "厨灶炉房内北");
            put("辰丁酉", "仓库门房内北");
            put("辰戊戌", "房床栖房内南");
            put("辰己亥", "占门床房内南");
            put("辰庚子", "占碓磨房内南");
            put("辰辛丑", "厨灶厕房内南");
            put("辰壬寅", "仓库炉房内南");
            put("辰癸卯", "房床门房内南");
            put("辰甲辰", "门鸡栖房内东");
            put("辰乙巳", "碓磨床房内东");
            put("辰丙午", "厨灶碓房内东");
            put("辰丁未", "仓库厕房内东");
            put("辰戊申", "房床炉房内东");
            put("辰己酉", "占大门外东北");
            put("辰庚戌", "碓磨栖外东北");
            put("辰辛亥", "厨灶床外东北");
            put("辰壬子", "仓库碓外东北");
            put("辰癸丑", "房床厕外东北");
            put("辰甲寅", "占门炉外东北");
            put("辰乙卯", "碓磨门外正东");
            put("辰丙辰", "厨灶栖外正东");
            put("辰丁巳", "仓库床外正东");
            put("辰戊午", "房床碓外正东");
            put("辰己未", "占门厕外正东");
            put("辰庚申", "碓磨炉外东南");
            put("辰辛酉", "厨灶门外东南");
            put("辰壬戌", "仓库栖外东南");
            put("辰癸亥", "占房床外东南");
            put("巳甲子", "占门碓外东南");
            put("巳乙丑", "碓磨厕外东南");
            put("巳丙寅", "厨灶炉外正南");
            put("巳丁卯", "仓库门外正南");
            put("巳戊辰", "房床栖外正南");
            put("巳己巳", "占门床外正南");
            put("巳庚午", "占碓磨外正南");
            put("巳辛未", "厨灶厕外西南");
            put("巳壬申", "仓库炉外西南");
            put("巳癸酉", "房床门外西南");
            put("巳甲戌", "门鸡栖外西南");
            put("巳乙亥", "碓磨床外西南");
            put("巳丙子", "厨灶碓外西南");
            put("巳丁丑", "仓库厕外西南");
            put("巳戊寅", "房床厕外正南");
            put("巳己卯", "占门厕外正南");
            put("巳庚辰", "碓磨栖外正西");
            put("巳辛巳", "厨灶床外正西");
            put("巳壬午", "仓库碓外西北");
            put("巳癸未", "房床厕外西北");
            put("巳甲申", "占门炉外西北");
            put("巳乙酉", "碓磨门外西北");
            put("巳丙戌", "厨灶栖外西北");
            put("巳丁亥", "仓库床外西北");
            put("巳戊子", "房床碓外正北");
            put("巳己丑", "占门厕外正北");
            put("巳庚寅", "碓磨炉外正北");
            put("巳辛卯", "厨灶门外正北");
            put("巳壬辰", "仓库栖外正北");
            put("巳癸巳", "占房床房内北");
            put("巳甲午", "占门碓房内北");
            put("巳乙未", "碓磨厕房内北");
            put("巳丙申", "厨灶炉房内北");
            put("巳丁酉", "仓库门房内北");
            put("巳戊戌", "房床栖房内南");
            put("巳己亥", "占门床房内南");
            put("巳庚子", "占碓磨房内南");
            put("巳辛丑", "厨灶厕房内南");
            put("巳壬寅", "仓库炉房内南");
            put("巳癸卯", "房床门房内南");
            put("巳甲辰", "门鸡栖房内东");
            put("巳乙巳", "碓磨床房内东");
            put("巳丙午", "厨灶碓房内东");
            put("巳丁未", "仓库厕房内东");
            put("巳戊申", "房床炉房内东");
            put("巳己酉", "占大门外东北");
            put("巳庚戌", "碓磨栖外东北");
            put("巳辛亥", "厨灶床外东北");
            put("巳壬子", "仓库碓外东北");
            put("巳癸丑", "房床厕外东北");
            put("巳甲寅", "占门炉外东北");
            put("巳乙卯", "碓磨门外正东");
            put("巳丙辰", "厨灶栖外正东");
            put("巳丁巳", "仓库床外正东");
            put("巳戊午", "房床碓外正东");
            put("巳己未", "占门厕外正东");
            put("巳庚申", "碓磨炉外东南");
            put("巳辛酉", "厨灶门外东南");
            put("巳壬戌", "仓库栖外东南");
            put("巳癸亥", "占房床外东南");
            put("午甲子", "占门碓外东南");
            put("午乙丑", "碓磨厕外东南");
            put("午丙寅", "厨灶炉外正南");
            put("午丁卯", "仓库门外正南");
            put("午戊辰", "房床栖外正南");
            put("午己巳", "占门床外正南");
            put("午庚午", "占碓磨外正南");
            put("午辛未", "厨灶厕外西南");
            put("午壬申", "仓库炉外西南");
            put("午癸酉", "房床门外西南");
            put("午甲戌", "门鸡栖外西南");
            put("午乙亥", "碓磨床外西南");
            put("午丙子", "厨灶碓外西南");
            put("午丁丑", "仓库厕外西南");
            put("午戊寅", "房床厕外正南");
            put("午己卯", "占门厕外正南");
            put("午庚辰", "碓磨栖外正西");
            put("午辛巳", "厨灶床外正西");
            put("午壬午", "仓库碓外西北");
            put("午癸未", "房床厕外西北");
            put("午甲申", "占门炉外西北");
            put("午乙酉", "碓磨门外西北");
            put("午丙戌", "厨灶栖外西北");
            put("午丁亥", "仓库床外西北");
            put("午戊子", "房床碓外正北");
            put("午己丑", "占门厕外正北");
            put("午庚寅", "碓磨炉外正北");
            put("午辛卯", "厨灶门外正北");
            put("午壬辰", "仓库栖外正北");
            put("午癸巳", "占房床房内北");
            put("午甲午", "占门碓房内北");
            put("午乙未", "碓磨厕房内北");
            put("午丙申", "厨灶炉房内北");
            put("午丁酉", "仓库门房内北");
            put("午戊戌", "房床栖房内南");
            put("午己亥", "占门床房内南");
            put("午庚子", "占碓磨房内南");
            put("午辛丑", "厨灶厕房内南");
            put("午壬寅", "仓库炉房内南");
            put("午癸卯", "房床门房内南");
            put("午甲辰", "门鸡栖房内东");
            put("午乙巳", "碓磨床房内东");
            put("午丙午", "厨灶碓房内东");
            put("午丁未", "仓库厕房内东");
            put("午戊申", "房床炉房内东");
            put("午己酉", "占大门外东北");
            put("午庚戌", "碓磨栖外东北");
            put("午辛亥", "厨灶床外东北");
            put("午壬子", "仓库碓外东北");
            put("午癸丑", "房床厕外东北");
            put("午甲寅", "占门炉外东北");
            put("午乙卯", "碓磨门外正东");
            put("午丙辰", "厨灶栖外正东");
            put("午丁巳", "仓库床外正东");
            put("午戊午", "房床碓外正东");
            put("午己未", "占门厕外正东");
            put("午庚申", "碓磨炉外东南");
            put("午辛酉", "厨灶门外东南");
            put("午壬戌", "仓库栖外东南");
            put("午癸亥", "占房床外东南");
            put("未甲子", "占门碓外东南");
            put("未乙丑", "碓磨厕外东南");
            put("未丙寅", "厨灶炉外正南");
            put("未丁卯", "仓库门外正南");
            put("未戊辰", "房床栖外正南");
            put("未己巳", "占门床外正南");
            put("未庚午", "占碓磨外正南");
            put("未辛未", "厨灶厕外西南");
            put("未壬申", "仓库炉外西南");
            put("未癸酉", "房床门外西南");
            put("未甲戌", "门鸡栖外西南");
            put("未乙亥", "碓磨床外西南");
            put("未丙子", "厨灶碓外西南");
            put("未丁丑", "仓库厕外西南");
            put("未戊寅", "房床厕外正南");
            put("未己卯", "占门厕外正南");
            put("未庚辰", "碓磨栖外正西");
            put("未辛巳", "厨灶床外正西");
            put("未壬午", "仓库碓外西北");
            put("未癸未", "房床厕外西北");
            put("未甲申", "占门炉外西北");
            put("未乙酉", "碓磨门外西北");
            put("未丙戌", "厨灶栖外西北");
            put("未丁亥", "仓库床外西北");
            put("未戊子", "房床碓外正北");
            put("未己丑", "占门厕外正北");
            put("未庚寅", "碓磨炉外正北");
            put("未辛卯", "厨灶门外正北");
            put("未壬辰", "仓库栖外正北");
            put("未癸巳", "占房床房内北");
            put("未甲午", "占门碓房内北");
            put("未乙未", "碓磨厕房内北");
            put("未丙申", "厨灶炉房内北");
            put("未丁酉", "仓库门房内北");
            put("未戊戌", "房床栖房内南");
            put("未己亥", "占门床房内南");
            put("未庚子", "占碓磨房内南");
            put("未辛丑", "厨灶厕房内南");
            put("未壬寅", "仓库炉房内南");
            put("未癸卯", "房床门房内南");
            put("未甲辰", "门鸡栖房内东");
            put("未乙巳", "碓磨床房内东");
            put("未丙午", "厨灶碓房内东");
            put("未丁未", "仓库厕房内东");
            put("未戊申", "房床炉房内东");
            put("未己酉", "占大门外东北");
            put("未庚戌", "碓磨栖外东北");
            put("未辛亥", "厨灶床外东北");
            put("未壬子", "仓库碓外东北");
            put("未癸丑", "房床厕外东北");
            put("未甲寅", "占门炉外东北");
            put("未乙卯", "碓磨门外正东");
            put("未丙辰", "厨灶栖外正东");
            put("未丁巳", "仓库床外正东");
            put("未戊午", "房床碓外正东");
            put("未己未", "占门厕外正东");
            put("未庚申", "碓磨炉外东南");
            put("未辛酉", "厨灶门外东南");
            put("未壬戌", "仓库栖外东南");
            put("未癸亥", "占房床外东南");
            put("申甲子", "占门碓外东南");
            put("申乙丑", "碓磨厕外东南");
            put("申丙寅", "厨灶炉外正南");
            put("申丁卯", "仓库门外正南");
            put("申戊辰", "房床栖外正南");
            put("申己巳", "占门床外正南");
            put("申庚午", "占碓磨外正南");
            put("申辛未", "厨灶厕外西南");
            put("申壬申", "仓库炉外西南");
            put("申癸酉", "房床门外西南");
            put("申甲戌", "门鸡栖外西南");
            put("申乙亥", "碓磨床外西南");
            put("申丙子", "厨灶碓外西南");
            put("申丁丑", "仓库厕外西南");
            put("申戊寅", "房床厕外正南");
            put("申己卯", "占门厕外正南");
            put("申庚辰", "碓磨栖外正西");
            put("申辛巳", "厨灶床外正西");
            put("申壬午", "仓库碓外西北");
            put("申癸未", "房床厕外西北");
            put("申甲申", "占门炉外西北");
            put("申乙酉", "碓磨门外西北");
            //申乙酉
            put("申丁亥", "仓库床外西北");
            put("申戊子", "房床碓外正北");
            put("申己丑", "占门厕外正北");
            put("申庚寅", "碓磨炉外正北");
            put("申辛卯", "厨灶门外正北");
            put("申壬辰", "仓库床外正北");
            put("申癸巳", "占房床房内北");
            put("申甲午", "占门碓房内北");
            put("申乙未", "碓磨厕房内北");
            put("申丙申", "厨灶炉房内北");
            put("申丁酉", "仓库门房内北");
            put("申戊戌", "房床栖房内南");
            put("申己亥", "占门床房内南");
            put("申庚子", "占碓磨房内南");
            put("申辛丑", "厨灶厕房内南");
            put("申壬寅", "仓库炉房内南");
            put("申癸卯", "房床门房内南");
            put("申甲辰", "门鸡栖房内东");
            put("申乙巳", "碓磨床房内东");
            put("申丙午", "厨灶碓房内东");
            put("申丁未", "仓库厕房内东");
            put("申戊申", "房床炉房内东");
            put("申己酉", "占大门外东北");
            put("申庚戌", "碓磨栖外东北");
            put("申辛亥", "厨灶床外东北");
            put("申壬子", "仓库碓外东北");
            put("申癸丑", "房床厕外东北");
            put("申甲寅", "占门炉外东北");
            put("申乙卯", "碓磨门外正东");
            put("申丙辰", "厨灶栖外正东");
            put("申丁巳", "仓库床外正东");
            put("申戊午", "房床碓外正东");
            put("申己未", "占门厕外正东");
            put("申庚申", "碓磨炉外东南");
            put("申辛酉", "厨灶门外东南");
            put("申壬戌", "仓库栖外东南");
            put("申癸亥", "占房床外东南");
            put("酉甲子", "占门碓外东南");
            put("酉乙丑", "碓磨厕外东南");
            put("酉丙寅", "厨灶炉外正南");
            put("酉丁卯", "仓库门外正南");
            put("酉戊辰", "房床栖外正南");
            put("酉己巳", "占门床外正南");
            put("酉庚午", "占碓磨外正南");
            put("酉辛未", "厨灶厕外西南");
            put("酉壬申", "仓库炉外西南");
            put("酉癸酉", "房床门外西南");
            put("酉甲戌", "门鸡栖外西南");
            put("酉乙亥", "碓磨床外西南");
            put("酉丙子", "厨灶碓外西南");
            put("酉丁丑", "仓库厕外西南");
            put("酉戊寅", "房床厕外正南");
            put("酉己卯", "占门厕外正南");
            put("酉庚辰", "碓磨栖外正西");
            put("酉辛巳", "厨灶床外正西");
            put("酉壬午", "仓库碓外西北");
            put("酉癸未", "房床厕外西北");
            put("酉甲申", "占门炉外西北");
            put("酉乙酉", "碓磨门外西北");
            put("酉丙戌", "厨灶栖外西北");
            put("酉丁亥", "仓库床外西北");
            put("酉戊子", "房床碓外正北");
            put("酉己丑", "占门厕外正北");
            put("酉庚寅", "碓磨炉外正北");
            put("酉辛卯", "厨灶门外正北");
            put("酉壬辰", "仓库栖外正北");
            put("酉癸巳", "占房床房内北");
            put("酉甲午", "占门碓房内北");
            put("酉乙未", "碓磨厕房内北");
            put("酉丙申", "厨灶炉房内北");
            put("酉丁酉", "仓库门房内北");
            put("酉戊戌", "房床栖房内南");
            put("酉己亥", "占门床房内南");
            put("酉庚子", "占碓磨房内南");
            put("酉辛丑", "厨灶厕房内南");
            put("酉壬寅", "仓库炉房内南");
            put("酉癸卯", "房床门房内南");
            put("酉甲辰", "门鸡栖房内东");
            put("酉乙巳", "碓磨床房内东");
            put("酉丙午", "厨灶碓房内东");
            put("酉丁未", "仓库厕房内东");
            put("酉戊申", "房床炉房内东");
            put("酉己酉", "占大门外东北");
            put("酉庚戌", "碓磨栖外东北");
            put("酉辛亥", "厨灶床外东北");
            put("酉壬子", "仓库碓外东北");
            put("酉癸丑", "房床厕外东北");
            put("酉甲寅", "占门炉外东北");
            put("酉乙卯", "碓磨门外正东");
            put("酉丙辰", "厨灶栖外正东");
            put("酉丁巳", "仓库床外正东");
            put("酉戊午", "房床碓外正东");
            put("酉己未", "占门厕外正东");
            put("酉庚申", "碓磨炉外东南");
            put("酉辛酉", "厨灶门外东南");
            put("酉壬戌", "仓库栖外东南");
            put("酉癸亥", "占房床外东南");
            put("戌甲子", "占门碓外东南");
            put("戌乙丑", "碓磨厕外东南");
            put("戌丙寅", "厨灶炉外正南");
            put("戌丁卯", "仓库门外正南");
            put("戌戊辰", "房床栖外正南");
            put("戌己巳", "占门床外正南");
            put("戌庚午", "占碓磨外正南");
            put("戌辛未", "厨灶厕外西南");
            put("戌壬申", "仓库炉外西南");
            put("戌癸酉", "房床门外西南");
            put("戌甲戌", "门鸡栖外西南");
            put("戌乙亥", "碓磨床外西南");
            put("戌丙子", "厨灶碓外西南");
            put("戌丁丑", "仓库厕外西南");
            put("戌戊寅", "房床厕外正南");
            put("戌己卯", "占门厕外正南");
            put("戌庚辰", "碓磨栖外正西");
            put("戌辛巳", "厨灶床外正西");
            put("戌壬午", "仓库碓外西北");
            put("戌癸未", "房床厕外西北");
            put("戌甲申", "占门炉外西北");
            put("戌乙酉", "碓磨门外西北");
            put("戌丙戌", "厨灶栖外西北");
            put("戌丁亥", "仓库床外西北");
            put("戌戊子", "房床碓外正北");
            put("戌己丑", "占门厕外正北");
            put("戌庚寅", "碓磨炉外正北");
            put("戌辛卯", "厨灶门外正北");
            put("戌壬辰", "仓库栖外正北");
            put("戌癸巳", "占房床房内北");
            put("戌甲午", "占门碓房内北");
            put("戌乙未", "碓磨厕房内北");
            put("戌丙申", "厨灶炉房内北");
            put("戌丁酉", "仓库门房内北");
            put("戌戊戌", "房床栖房内南");
            put("戌己亥", "占门床房内南");
            put("戌庚子", "占碓磨房内南");
            put("戌辛丑", "厨灶厕房内南");
            put("戌壬寅", "仓库炉房内南");
            put("戌癸卯", "房床门房内南");
            put("戌甲辰", "门鸡栖房内东");
            put("戌乙巳", "碓磨床房内东");
            put("戌丙午", "厨灶碓房内东");
            put("戌丁未", "仓库厕房内东");
            put("戌戊申", "房床炉房内东");
            put("戌己酉", "占大门外东北");
            put("戌庚戌", "碓磨栖外东北");
            put("戌辛亥", "厨灶床外东北");
            put("戌壬子", "仓库碓外东北");
            put("戌癸丑", "房床厕外东北");
            put("戌甲寅", "占门炉外东北");
            put("戌乙卯", "碓磨门外正东");
            put("戌丙辰", "厨灶栖外正东");
            put("戌丁巳", "仓库床外正东");
            put("戌戊午", "房床碓外正东");
            put("戌己未", "占门厕外正东");
            put("戌庚申", "碓磨炉外东南");
            put("戌辛酉", "厨灶门外东南");
            put("戌壬戌", "仓库栖外东南");
            put("戌癸亥", "占房床外东南");
            put("亥甲子", "占门碓外东南");
            put("亥乙丑", "碓磨厕外东南");
            put("亥丙寅", "厨灶炉外正南");
            put("亥丁卯", "仓库门外正南");
            put("亥戊辰", "房床栖外正南");
            put("亥己巳", "占门床外正南");
            put("亥庚午", "占碓磨外正南");
            put("亥辛未", "厨灶厕外西南");
            put("亥壬申", "仓库炉外西南");
            put("亥癸酉", "房床门外西南");
            put("亥甲戌", "门鸡栖外西南");
            put("亥乙亥", "碓磨床外西南");
            put("亥丙子", "厨灶碓外西南");
            put("亥丁丑", "仓库厕外西南");
            put("亥戊寅", "房床厕外正南");
            put("亥己卯", "占门厕外正南");
            put("亥庚辰", "碓磨栖外正西");
            put("亥辛巳", "厨灶床外正西");
            put("亥壬午", "仓库碓外西北");
            put("亥癸未", "房床厕外西北");
            put("亥甲申", "占门炉外西北");
            put("亥乙酉", "碓磨门外西北");
            put("亥丙戌", "厨灶栖外西北");
            put("亥丁亥", "仓库床外西北");
            put("亥戊子", "房床碓外正北");
            put("亥己丑", "占门厕外正北");
            put("亥庚寅", "碓磨炉外正北");
            put("亥辛卯", "厨灶门外正北");
            put("亥壬辰", "仓库栖外正北");
            put("亥癸巳", "占房床房内北");
            put("亥甲午", "占门碓房内北");
            put("亥乙未", "碓磨厕房内北");
            put("亥丙申", "厨灶炉房内北");
            put("亥丁酉", "仓库门房内北");
            put("亥戊戌", "房床栖房内南");
            put("亥己亥", "占门床房内南");
            put("亥庚子", "占碓磨房内南");
            put("亥辛丑", "厨灶厕房内南");
            put("亥壬寅", "仓库炉房内南");
            put("亥癸卯", "房床门房内南");
            put("亥甲辰", "门鸡栖房内东");
            put("亥乙巳", "碓磨床房内东");
            put("亥丙午", "厨灶碓房内东");
            put("亥丁未", "仓库厕房内东");
            put("亥戊申", "房床炉房内东");
            put("亥己酉", "占大门外东北");
            put("亥庚戌", "碓磨栖外东北");
            put("亥辛亥", "厨灶床外东北");
            put("亥壬子", "仓库碓外东北");
            put("亥癸丑", "房床厕外东北");
            put("亥甲寅", "占门炉外东北");
            put("亥乙卯", "碓磨门外正东");
            put("亥丙辰", "厨灶栖外正东");
            put("亥丁巳", "仓库床外正东");
            put("亥戊午", "房床碓外正东");
            put("亥己未", "占门厕外正东");
            put("亥庚申", "碓磨炉外东南");
            put("亥辛酉", "厨灶门外东南");
            put("亥壬戌", "仓库栖外东南");
            put("亥癸亥", "占房床外东南");
            put("子甲子", "占门碓外东南");
            put("子乙丑", "碓磨厕外东南");
            put("子丙寅", "厨灶炉外正南");
            put("子丁卯", "仓库门外正南");
            put("子戊辰", "房床栖外正南");
            put("子己巳", "占门床外正南");
            put("子庚午", "占碓磨外正南");
            put("子辛未", "厨灶厕外西南");
            put("子壬申", "仓库炉外西南");
            put("子癸酉", "房床门外西南");
            put("子甲戌", "门鸡栖外西南");
            put("子乙亥", "碓磨床外西南");
            put("子丙子", "厨灶碓外西南");
            put("子丁丑", "仓库厕外西南");
            put("子戊寅", "房床厕外正南");
            put("子己卯", "占门厕外正南");
            put("子庚辰", "碓磨栖外正西");
            put("子辛巳", "厨灶床外正西");
            put("子壬午", "仓库碓外西北");
            put("子癸未", "房床厕外西北");
            put("子甲申", "占门炉外西北");
            put("子乙酉", "碓磨门外西北");
            put("子丙戌", "厨灶栖外西北");
            put("子丁亥", "仓库床外西北");
            put("子戊子", "房床碓外正北");
            put("子己丑", "占门厕外正北");
            put("子庚寅", "碓磨炉外正北");
            put("子辛卯", "厨灶门外正北");
            put("子壬辰", "仓库栖外正北");
            put("子癸巳", "占房床房内北");
            put("子甲午", "占门碓房内北");
            put("子乙未", "碓磨厕房内北");
            put("子丙申", "厨灶炉房内北");
            put("子丁酉", "仓库门房内北");
            put("子戊戌", "房床栖房内南");
            put("子己亥", "占门床房内南");
            put("子庚子", "占碓磨房内南");
            put("子辛丑", "厨灶厕房内南");
            put("子壬寅", "仓库炉房内南");
            put("子癸卯", "房床门房内南");
            put("子甲辰", "门鸡栖房内东");
            put("子乙巳", "碓磨床房内东");
            put("子丙午", "厨灶碓房内东");
            put("子丁未", "仓库厕房内东");
            put("子戊申", "房床炉房内东");
            put("子己酉", "占大门外东北");
            put("子庚戌", "碓磨栖外东北");
            put("子辛亥", "厨灶床外东北");
            put("子壬子", "仓库碓外东北");
            put("子癸丑", "房床厕外东北");
            put("子甲寅", "占门炉外东北");
            put("子乙卯", "碓磨门外正东");
            put("子丙辰", "厨灶栖外正东");
            put("子丁巳", "仓库床外正东");
            put("子戊午", "房床碓外正东");
            put("子己未", "占门厕外正东");
            put("子庚申", "碓磨炉外东南");
            put("子辛酉", "厨灶门外东南");
            put("子壬戌", "仓库栖外东南");
            put("子癸亥", "占房床外东南");
            put("丑甲子", "占门碓外东南");
            put("丑乙丑", "碓磨厕外东南");
            put("丑丙寅", "厨灶炉外正南");
            put("丑丁卯", "仓库门外正南");
            put("丑戊辰", "房床栖外正南");
            put("丑己巳", "占门床外正南");
            put("丑庚午", "占碓磨外正南");
            put("丑辛未", "厨灶厕外西南");
            put("丑壬申", "仓库炉外西南");
            put("丑癸酉", "房床门外西南");
            put("丑甲戌", "门鸡栖外西南");
            put("丑乙亥", "碓磨床外西南");
            put("丑丙子", "厨灶碓外西南");
            put("丑丁丑", "仓库厕外西南");
            put("丑戊寅", "房床厕外正南");
            put("丑己卯", "占门厕外正南");
            put("丑庚辰", "碓磨栖外正西");
            put("丑辛巳", "厨灶床外正西");
            put("丑壬午", "仓库碓外西北");
            put("丑癸未", "房床厕外西北");
            put("丑甲申", "占门炉外西北");
            put("丑乙酉", "碓磨门外西北");
            put("丑丙戌", "厨灶栖外西北");
            put("丑丁亥", "仓库床外西北");
            put("丑戊子", "房床碓外正北");
            put("丑己丑", "占门厕外正北");
            put("丑庚寅", "碓磨炉外正北");
            put("丑辛卯", "厨灶门外正北");
            put("丑壬辰", "仓库栖外正北");
            put("丑癸巳", "占房床房内北");
            put("丑甲午", "占门碓房内北");
            put("丑乙未", "碓磨厕房内北");
            put("丑丙申", "厨灶炉房内北");
            put("丑丁酉", "仓库门房内北");
            put("丑戊戌", "房床栖房内南");
            put("丑己亥", "占门床房内南");
            put("丑庚子", "占碓磨房内南");
            put("丑辛丑", "厨灶厕房内南");
            put("丑壬寅", "仓库炉房内南");
            put("丑癸卯", "房床门房内南");
            put("丑甲辰", "门鸡栖房内东");
            put("丑乙巳", "碓磨床房内东");
            put("丑丙午", "厨灶碓房内东");
            put("丑丁未", "仓库厕房内东");
            put("丑戊申", "房床炉房内东");
            put("丑己酉", "占大门外东北");
            put("丑庚戌", "碓磨栖外东北");
            put("丑辛亥", "厨灶床外东北");
            put("丑壬子", "仓库碓外东北");
            put("丑癸丑", "房床厕外东北");
            put("丑甲寅", "占门炉外东北");
            put("丑乙卯", "碓磨门外正东");
            put("丑丙辰", "厨灶栖外正东");
            put("丑丁巳", "仓库床外正东");
            put("丑戊午", "房床碓外正东");
            put("丑己未", "占门厕外正东");
            put("丑庚申", "碓磨炉外东南");
            put("丑辛酉", "厨灶门外东南");
            put("丑壬戌", "仓库栖外东南");
            put("丑癸亥", "占房床外东南");
        }
    };
    public static final Integer[] TermTable = {
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355, //1900
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1901
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1902
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1903
            6, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 282, 297, 312, 327, 341, 356,//1904
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1905
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1906
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1907
            6, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 282, 297, 312, 327, 341, 356,//1908
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1909
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1910
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1911
            6, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 282, 297, 312, 326, 341, 356,//1912
            5, 19, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1913
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1914
            5, 20, 35, 50, 64, 80, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1915
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 281, 297, 312, 326, 341, 356,//1916
            5, 19, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1917
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1918
            5, 20, 35, 50, 64, 80, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1919
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 281, 297, 312, 326, 341, 356,//1920
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 340, 355,//1921
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1922
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1923
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 281, 297, 312, 326, 341, 356,//1924
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 340, 355,//1925
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1926
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1927
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 173, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1928
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1929
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1930
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1931
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1932
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1933
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1934
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1935
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1936
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1937
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1938
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1939
            5, 20, 35, 50, 65, 80, 95, 110, 126, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1940
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1941
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1942
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1943
            5, 20, 35, 50, 65, 80, 95, 110, 125, 141, 157, 172, 188, 204, 220, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1944
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1945
            5, 19, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1946
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1947
            5, 20, 35, 50, 64, 80, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1948
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1949
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1950
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1951
            5, 20, 35, 50, 64, 80, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1952
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1953
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 340, 355,//1954
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1955
            5, 20, 35, 50, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 251, 266, 281, 296, 311, 326, 341, 356,//1956
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1957
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1958
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1959
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1960
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1961
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1962
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1963
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 157, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1964
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1965
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1966
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1967
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1968
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1969
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1970
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1971
            5, 20, 35, 49, 64, 79, 95, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1972
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1973
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1974
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1975
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1976
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1977
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 326, 340, 355,//1978
            5, 19, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1979
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 204, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1980
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1981
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1982
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//1983
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//1984
            4, 19, 34, 49, 63, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1985
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1986
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 235, 250, 265, 281, 296, 311, 326, 340, 355,//1987
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1988
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//1989
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//1990
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1991
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1992
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//1993
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1994
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1995
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//1996
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//1997
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//1998
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//1999
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//2000
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2001
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2002
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2003
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//2004
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2005
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2006
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2007
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2008
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2009
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2010
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 326, 340, 355,//2011
            5, 20, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2012
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2013
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2014
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2015
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2016
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2017
            4, 19, 34, 49, 63, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2018
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2019
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 341, 355,//2020
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2021
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2022
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2023
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2024
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2025
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2026
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2027
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2028
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2029
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2030
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2031
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2032
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2033
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2034
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2035
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2036
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2037
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2038
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2039
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2040
            4, 19, 33, 48, 63, 78, 93, 109, 124, 139, 155, 171, 187, 202, 218, 234, 249, 264, 280, 295, 310, 325, 340, 354,//2041
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2042
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2043
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 326, 340, 355,//2044
            4, 19, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 187, 202, 218, 234, 249, 264, 280, 295, 310, 325, 340, 354,//2045
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2046
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2047
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2048
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 340, 354,//2049
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2050
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2051
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2052
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 340, 354,//2053
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2054
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2055
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2056
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2057
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2058
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2059
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2060
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2061
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2062
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2063
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2064
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2065
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2066
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2067
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2068
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2069
            4, 19, 33, 48, 63, 78, 93, 109, 124, 139, 155, 171, 187, 202, 218, 234, 249, 264, 280, 295, 310, 325, 340, 354,//2070
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2071
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2072
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 279, 295, 310, 325, 339, 354,//2073
            4, 19, 33, 48, 63, 78, 93, 109, 124, 139, 155, 171, 187, 202, 218, 234, 249, 264, 280, 295, 310, 325, 340, 354,//2074
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2075
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2076
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 279, 295, 310, 325, 339, 354,//2077
            4, 19, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 234, 249, 264, 280, 295, 310, 325, 340, 354,//2078
            4, 19, 34, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2079
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2080
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 170, 186, 202, 218, 233, 249, 264, 279, 295, 310, 324, 339, 354,//2081
            4, 19, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 340, 354,//2082
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2083
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2084
            3, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 170, 186, 202, 218, 233, 249, 264, 279, 295, 310, 324, 339, 354,//2085
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 340, 354,//2086
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2087
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2088
            3, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 170, 186, 202, 218, 233, 249, 264, 279, 295, 310, 324, 339, 354,//2089
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2090
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2091
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2092
            3, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 170, 186, 202, 218, 233, 249, 264, 279, 294, 309, 324, 339, 354,//2093
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2094
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2095
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2096
            3, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 170, 186, 202, 217, 233, 249, 264, 279, 294, 309, 324, 339, 354,//2097
            4, 18, 33, 48, 63, 78, 93, 108, 124, 139, 155, 171, 186, 202, 218, 233, 249, 264, 280, 295, 310, 325, 339, 354,//2098
            4, 19, 33, 48, 63, 78, 93, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 354,//2099
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2100
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2101
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2102
            5, 20, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2103
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//2104
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2105
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 280, 296, 311, 326, 340, 355,//2106
            5, 20, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 187, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2107
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//2108
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2109
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 326, 340, 355,//2110
            5, 20, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 341, 355,//2111
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//2112
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2113
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2114
            5, 20, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 341, 355,//2115
            5, 20, 35, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//2116
            4, 19, 34, 49, 63, 79, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2117
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 296, 311, 325, 340, 355,//2118
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 341, 355,//2119
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 356,//2120
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2121
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 219, 234, 250, 265, 280, 295, 311, 325, 340, 355,//2122
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2123
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//2124
            4, 19, 34, 49, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2125
            4, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2126
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2127
            5, 20, 34, 49, 64, 79, 94, 110, 125, 141, 156, 172, 188, 203, 219, 235, 250, 266, 281, 296, 311, 326, 341, 355,//2128
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 203, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2129
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2130
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355,//2131
            5, 20, 34, 49, 64, 79, 94, 110, 125, 140, 156, 172, 188, 203, 219, 235, 250, 265, 281, 296, 311, 326, 341, 355,//2132
            4, 19, 34, 48, 63, 78, 94, 109, 124, 140, 155, 171, 187, 202, 218, 234, 249, 265, 280, 295, 310, 325, 340, 355,//2133
            4, 19, 34, 49, 64, 79, 94, 109, 124, 140, 156, 171, 187, 203, 218, 234, 250, 265, 280, 295, 310, 325, 340, 355,//2134
            5, 19, 34, 49, 64, 79, 94, 109, 125, 140, 156, 172, 187, 203, 219, 234, 250, 265, 281, 296, 311, 326, 340, 355 //2135
    };
}

